{
  "sources": [
    {
      "title": "云野阁",
      "feedUrl": "https://marsperl.github.io/rss2.xml",
      "siteUrl": "https://yyg.js.cool/",
      "articles": [
        {
          "id": "https://yyg.js.cool/yyg/2eca17c7/",
          "author": null,
          "description": "博客加入Gitalk评论后，需要访问相应页面，才在存放评论的仓库创建Issues。本文通过脚本自动访问文章页面完成Gitalk自动创建评论Issues。脚本自attson/hexo-gitalk-init: Hexo gitalk 极简初始化脚本基础上修改而来（是在windows本地运行）。\n这是一个用于 Hexo 博客的 Gitalk 评论系统自动初始化脚本。它能自动扫描所有文章，识别出尚未创建评论 Issue 的页面，并通过模拟浏览器访问来触发 Gitalk 自动完成 Issue",
          "link": "https://yyg.js.cool/yyg/2eca17c7/",
          "publishedOn": "2025-10-08T14:06:07.000Z",
          "wordCount": 3172,
          "title": "Gitalk自动创建评论Issues",
          "imageUrl": "https://api.vvhan.com/api/wallpaper/views"
        },
        {
          "id": "https://marsperl.github.io/yyg/2eca17c7/",
          "author": null,
          "description": "博客加入Gitalk评论后，需要访问相应页面，才在存放评论的仓库创建Issues。本文通过脚本自动访问文章页面完成Gitalk自动创建评论Issues。脚本自attson/hexo-gitalk-init: Hexo gitalk 极简初始化脚本基础上修改而来（是在windows本地运行）。\n这是一个用于 Hexo 博客的 Gitalk 评论系统自动初始化脚本。它能自动扫描所有文章，识别出尚未创建评论 Issue",
          "link": "https://marsperl.github.io/yyg/2eca17c7/",
          "publishedOn": "2025-10-08T14:06:07.000Z",
          "wordCount": 4166,
          "title": "Gitalk自动创建评论Issues",
          "imageUrl": "https://picapi.pai.al/api/scenery.php"
        },
        {
          "id": "https://yyg.js.cool/yyg/986299a9/",
          "author": null,
          "description": "<a href=\"#网络\" class=\"headerlink\"",
          "link": "https://yyg.js.cool/yyg/986299a9/",
          "publishedOn": "2025-08-22T10:17:22.000Z",
          "wordCount": null,
          "title": "k8s知识梳理--进阶",
          "imageUrl": null
        },
        {
          "id": "https://marsperl.github.io/yyg/986299a9/",
          "author": null,
          "description": "<a href=\"#网络\" class=\"headerlink\"",
          "link": "https://marsperl.github.io/yyg/986299a9/",
          "publishedOn": "2025-08-22T10:17:22.000Z",
          "wordCount": 4569,
          "title": "k8s知识梳理--进阶",
          "imageUrl": "https://imgapi.cn/api.php?fl=fengjing&gs=images"
        },
        {
          "id": "https://yyg.js.cool/yyg/4789a872/",
          "author": null,
          "description": "前言\n在linux环境下，使用docker部署ollama+deepseek-r1:1.5b+open-webui，实现私有化部署DeepSeek。\n部署过程\n<a href=\"#安装docker\" class=\"headerlink\"",
          "link": "https://yyg.js.cool/yyg/4789a872/",
          "publishedOn": "2025-08-16T09:12:50.000Z",
          "wordCount": null,
          "title": "私有化部署DeepSeek",
          "imageUrl": null
        },
        {
          "id": "https://marsperl.github.io/yyg/4789a872/",
          "author": null,
          "description": "前言\n在linux环境下，使用docker部署ollama+deepseek-r1:1.5b+open-webui，实现私有化部署DeepSeek。\n部署过程\n<a href=\"#安装docker\"",
          "link": "https://marsperl.github.io/yyg/4789a872/",
          "publishedOn": "2025-08-16T09:12:50.000Z",
          "wordCount": null,
          "title": "私有化部署DeepSeek",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Hi, DIYgod",
      "feedUrl": "https://diygod.cc/feed/",
      "siteUrl": "https://diygod.cc",
      "articles": []
    },
    {
      "title": "whyes 的博客",
      "feedUrl": "http://whyes.org/feed.xml",
      "siteUrl": "http://whyes.org/",
      "articles": [
        {
          "id": "http://whyes.org/2025/abc-hcc-atezo-bev-tace-bclc-b",
          "author": null,
          "description": "一直以来，中期肝癌（BCLC B 期）被认为存在较大的异质性，从 2-3 枚肿瘤，其中一枚直径超过 3cm，到弥漫性肝癌，只要不伴有肉眼癌栓或远处转移，都属于中期肝癌。虽然在西方的指南中，中期肝癌的标准治疗是经肝动脉化疗栓塞（TACE），但...",
          "link": "http://whyes.org/2025/abc-hcc-atezo-bev-tace-bclc-b",
          "publishedOn": "2025-10-20T15:39:25.000Z",
          "wordCount": 180,
          "title": "ABC-HCC研究：系统治疗取代TACE，成为中期肝癌的标准治疗？ #ESMO25",
          "imageUrl": "https://i.typlog.com/whyes/8431633559_928745.jpg?x-oss-process=style/ss"
        },
        {
          "id": "http://whyes.org/2025/triplet-hcc-ipilimumab-atezo-bev",
          "author": null,
          "description": "",
          "link": "http://whyes.org/2025/triplet-hcc-ipilimumab-atezo-bev",
          "publishedOn": "2025-10-20T15:35:31.000Z",
          "wordCount": null,
          "title": "TRIPLET-HCC：小剂量伊匹木单抗未能给晚期肝癌一线靶免治疗增效 #ESMO25",
          "imageUrl": null
        },
        {
          "id": "http://whyes.org/2025/imbrave-152-tiragolumab-atezo-bev",
          "author": null,
          "description": "",
          "link": "http://whyes.org/2025/imbrave-152-tiragolumab-atezo-bev",
          "publishedOn": "2025-10-20T15:33:25.000Z",
          "wordCount": null,
          "title": "IMbrave152：TIGIT抗体未能给晚期肝癌的一线治疗增效 #ESMO25",
          "imageUrl": null
        },
        {
          "id": "http://whyes.org/2025/leap-012-hcc-tace-len-pembro-china",
          "author": null,
          "description": "在刚刚召开的 CSCO 年会上，LEAP-012 研究（中期为主的肝细胞癌：TACE+仑伐替尼+帕博利珠单抗 vs TACE+双安慰剂）公布了中国区患者的数据。主要借助中国区亚组的患者数据，这项联合治疗已经在国内获批上市，并且是同类方案中唯...",
          "link": "http://whyes.org/2025/leap-012-hcc-tace-len-pembro-china",
          "publishedOn": "2025-09-14T04:47:20.000Z",
          "wordCount": 178,
          "title": "LEAP-012 研究中国人群数据公布，OS 获益趋势明确 #CSCO25",
          "imageUrl": "https://i.typlog.com/whyes/8431633559_928745.jpg?x-oss-process=style/ss"
        }
      ]
    },
    {
      "title": "daverupert.com",
      "feedUrl": "https://daverupert.com/atom.xml",
      "siteUrl": "https://daverupert.com",
      "articles": [
        {
          "id": "https://daverupert.com/2025/10/quiet-ui/",
          "author": null,
          "description": "As President of Web Components, it’s my duty to publicly comment on every Web Component library and framework that exists. Today I’m taking a look at Quiet UI, a new source-available web component library soft-launched by Cory LaViska, the creator of Shoelace WebAwesome. You might be asking “another UI library? But why?” and that’s a good question, I’ll let Cory tell you in his own words…\nI wanted to play with bleeding edge features that weren’t available in all browsers yet… I wanted to take everything I learned from developing components over the years and challenge some ideas, try new things, and bake in opinions that I’ve traditionally veered away from. It felt liberating.\n“Play” as a foundation is compelling to me. A lot of writing and ancient programming advice says “Write the thing,…",
          "link": "https://daverupert.com/2025/10/quiet-ui/",
          "publishedOn": "2025-10-16T05:08:00.000Z",
          "wordCount": 1764,
          "title": "Lots to shout about in Quiet UI",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/10/custom-elements-manifest-killer-feature/",
          "author": null,
          "description": "One unsung feature in the web components space that I don’t think gets enough attention is the Custom Elements Manifest initiative. I think it’s the killer feature of web components.\nKnown as “CEM” to its friends, a CEM is a community standard JSON format that surfaces information about your component APIs. The analyzer scans your class-based component to build up a “manifest” of all the methods, events, slots, parts, tag name, and CSS variables you want to expose. It works on a single component or an entire system’s worth of components. If you want to surface more details to consumers (like accepted attributes or CSS custom properties), you can provide more context to the analyzer through JSDoc comments and/or TypeScript types – which is good code hygiene and a favor for your future self …",
          "link": "https://daverupert.com/2025/10/custom-elements-manifest-killer-feature/",
          "publishedOn": "2025-10-13T15:30:00.000Z",
          "wordCount": 1667,
          "title": "The killer feature of Web Components",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/10/why-i-hate-the-mvp-car/",
          "author": null,
          "description": "I have a love-hate relationship with “the MVP car”, that classic illustration that shows us the RIGHT and WRONG way to build a product. To be fair, I don’t think its creator Henrik Kniberg would want it called “the MVP car” at all. According to his post the whole point of the illustration is to replace “MVP” with something more descriptive like “Earliest Testable/Usable/Lovable Product”. I wholeheartedly agree with the notion and short-cycle iteration beats long-cycle “Bing Bang Delivery” as Kniberg refers to it.\nKniberg notes that sharing the car like a meme erases his original context and all we see is the car. Despite taking the time to get the context and being a lover of iteration, I think I have built up petty grievances over the years with the MVP car. The next thousand or so words …",
          "link": "https://daverupert.com/2025/10/why-i-hate-the-mvp-car/",
          "publishedOn": "2025-10-01T15:15:00.000Z",
          "wordCount": 1613,
          "title": "Why I hate the MVP car",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/09/you-cant-drink-coffee-on-a-running-horse/",
          "author": null,
          "description": "I’m coming up on 20 years of professional web development and I still don’t get it sometimes. I tend to measure myself or view work productivity through the lens of “How much code did I write?” and that does a great disservice to myself and what I do.\nThere’s a lot more to the job:\nChecking email\nScheduling calls\nWriting release notes\nContributing to newsletters\nDocumentation (code and otherwise)\nMaking spreadsheets\nDemystifying the work I do to teammates\nClarifying decisions\nHaving technical conversations with teammates\nHaving non-technical conversations with teammates\nInvestigating weird browser behaviors\nBabysitting servers and build processes\nReviewing PRs\nManual QA on branch deploys\nAttending meetings\nAttending talks (internal/external)\nCross-org contributions\nLearning\nPlanning\nDreaming\nScheming\nCommunity Ops\nMoving cards across a board\nReading thru backlogs\nAssociating tickets to PRs\nClosing out old tickets\nReading specs\nGiving feedback on web standards\nEating lunch\nTaking walks\nCleaning my home office\nThese are all aspects of becoming a better web developer. It’s not always about lines-of-code or hours-in-chair. Ideally, we’re all shipping our creations, but sometimes you’re the lead role and sometimes you’re a supporting role. A lot of the work is immeasurable, but it all counts towards something. So… self, don’t be so hard on yourself.",
          "link": "https://daverupert.com/2025/09/you-cant-drink-coffee-on-a-running-horse/",
          "publishedOn": "2025-09-11T13:26:00.000Z",
          "wordCount": null,
          "title": "Many years on the job and I still don't get it.",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/09/why-would-anybody-start-a-website/",
          "author": null,
          "description": "Nilay Patel sat down for a Decoder interview with Microsoft CTO Kevin Scott to talk about NLWeb, an open source effort to allow an LLM-style indexing of small websites and provide local search. Instead of having large centralized search indexes like Google or Bing, the indexing shifts to sites having their own local indexes that large search platforms hook into via an MCP, an API endpoint for LLMs (basically). Lots to unpack there, but at first glance I like the idea of local ownership of search indexes over the “scrape everything” model that’s killing the Open Web.\nI was listening to the episode because it’s relevant to my work, but I also like Nilay Patel’s perspective and think he has a sober 10,000ft view of the tech industry; without fawning over CEOs, new tech, and VC hype. That is r…",
          "link": "https://daverupert.com/2025/09/why-would-anybody-start-a-website/",
          "publishedOn": "2025-09-05T13:30:00.000Z",
          "wordCount": null,
          "title": "“Why would anybody start a website?”",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/08/git-diagramming-the-weave/",
          "author": null,
          "description": "We all know the current US President is one hell of an orator and often assures us that he has “the best words”:\nI went to an Ivy League school. I’m very highly educated. I know words. I have the best words.\nThe man knows words. Says so right there. While some might view his non-sequitur ramblings as the nascent stages of dementia or an unfiltered ADHD brain launching into successive short (at times racist) bullet-point diatribes based on the last word or phrase he said like a cursed game of word association, the President asserts this is not the case:\nYou know, I do the weave. You know what the weave is? I’ll talk about, like, nine different things, and they all come back brilliantly together. And it’s like - and friends of mine that are, like, English professors - they say, it’s the most…",
          "link": "https://daverupert.com/2025/08/git-diagramming-the-weave/",
          "publishedOn": "2025-08-31T02:22:00.000Z",
          "wordCount": null,
          "title": "Git diagramming \"The Weave\"",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/08/limiting-youtube-to-a-single-tab/",
          "author": null,
          "description": "This week I decided to go nuclear on my bad YouTube habit. I installed a plugin called Tab Limiter that lets me limit youtube.com to one tab at a time. Clicking links that open in new tabs will now auto-close the tab.\nWhy do this? I talked about it before but when I’m bored I open tabs. Adding friction here prevents me from CMD+clicking videos during moments of boredom and creating a month’s-worth unclose-able tabs of videos to watch. It encourages me to stay focused and nudges me towards YouTube’s lossy1 “Add to queue” feature to queue up one video at a time in a single tab. I sort of prefer this way of using YouTube and it makes it feel a lot more like a native app.\nThat inspired me to install the YouTube Progressive Web App and because the PWA is basically a dedicated tab, Tab Limiter keeps me from opening other videos in new tabs. I’m now funneled into the application.\nOpening a dropdown and clicking “Add to queue” is adding more “good friction” to the process. It also comes with a counter. 20 tabs open, no big deal, I’m immune to that effect. 20 items in a queue. Yeesh. That’s a todo list.\nTab Limiter has a brutalist UI and that’s what makes it perfect. It’s also open sourced on GitHub which is important to me so I can make sure it’s not sending my browsing history to China. And I can fork it. One improvement I’m considering is to add the closed video’s ID to the YouTube queue before closing the tab. It seems easy enough, but probably not as easy as I’m hoping. The core idea there is that it might be helpful if I come across an urgent watch-now link or someone sends me a link.\nI’m also still using Raycast Focus which is a great way to blockout time and stop distractions at the source.\n\n\n\n\nYouTube queues only exist in memory in the tab context, it’s not a cross-tab feature so if you close a tab and started a new one, the entire old queue got erased forever. ↩",
          "link": "https://daverupert.com/2025/08/limiting-youtube-to-a-single-tab/",
          "publishedOn": "2025-08-22T13:59:00.000Z",
          "wordCount": null,
          "title": "Limiting YouTube to a Single Tab",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/08/classifiers-and-cosmotechnics/",
          "author": null,
          "description": "I’ve been playing around with Midjourney for work and the one thing that makes Stable Diffusion cool and useful to me is the --sref flag to summon results in a specific visual style or “style reference” (e.g. Celestial Swirlscape is --sref 2566192150). They differ a bit from traditional or “artist” styles (e.g. “In the style of Picasso” or “Rip off Studio Ghibli”) but can be that or they can be more generic or compositional like “Pink Retronetic Dreamscape”. I’ve read a deep-dive on SREF codes and it’s still a bit unclear how they work to me. They’re like a hybrid between prompt shorthand and style classification. Curated and collected by humans, but a code generated by machines. I have to imagine there’s some clumped circles on a node graph chart somewhere that determine this… but I don’t…",
          "link": "https://daverupert.com/2025/08/classifiers-and-cosmotechnics/",
          "publishedOn": "2025-08-19T15:41:00.000Z",
          "wordCount": null,
          "title": "Classifiers and cosmotechnics",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/08/vibe-check-39/",
          "author": null,
          "description": "In the middle of the night on the morning of July 4th, a storm parked over the Texas Hill Country and caused the Guadalupe river to rise more than 25 feet in two hours. 135 dead, including dozens of children from summer camps along the river. As a parent, this is the greatest tragedy you could imagine. My heart goes out to the families and friends who lost a little one that week.\nAs a Texan, this is yet another tragedy in a growing list of rare but forecastable tragedies where federal, state, and local officials failed Texans. I’m tired.\nWith that event casting a dark shadow on the summer acknowledged, here’s a recap of the last couple months.\nA trip to the Grand Canyon\nIn late June my family stole away for a quick trip to Arizona. My in-laws bought a vacation place in Flagstaff to escape …",
          "link": "https://daverupert.com/2025/08/vibe-check-39/",
          "publishedOn": "2025-08-17T22:32:00.000Z",
          "wordCount": null,
          "title": "Vibe Check №39",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/08/got-99-engineering-problems-but-a-grift-aint-one/",
          "author": null,
          "description": "I was thinking this morning about how once you understand that your technology choices have security, performance, and accessibility considerations you become a much more boring developer. Acknowledging those obligations can sort of strips the fun out of programming, but we’re better for it.\nI decided to pull on that thread a little more and come up with a list of all the concerns you might have as an engineer/developer that ultimately compound to make you a boring, wet blanket of a person to be in meetings with.\nSecurity  - Make sure you’re not opening the door for hackers.\nPrivacy - Don’t leak personal information. Or don’t collect it in the first place.\nPerformance  - Can the software work on low-end devices? Can you deliver the large bundle over bad internet? Those are your problems.\nI…",
          "link": "https://daverupert.com/2025/08/got-99-engineering-problems-but-a-grift-aint-one/",
          "publishedOn": "2025-08-06T14:46:00.000Z",
          "wordCount": null,
          "title": "All the concerns that make you a boring developer",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/08/theater-ux/",
          "author": null,
          "description": "I saw this summer’s Marvel movie in the theater on Sunday. A bit of a last minute idea so we ended up going to the “legacy” movie theater across the highway. Before I continue, It’s important to understand my local cinema dynamics. We have two theaters here in Austin: The Alamo Drafthouse and All Other Cinemas.\nThe best place to see movies in Austin is at the Alamo Drafthouse. If you’ve never been to an Alamo, I’m sorry. It’s a movie theater for people who love movies by people who love movies. They craft the entire art house experience from end-to-end. From the custom pre-screener of thematically topical clips, to the strict no late arrival and no texting policies, to custom food and drink options that match the latest blockbuster movie. A waiter brings you food, drinks, and refills so yo…",
          "link": "https://daverupert.com/2025/08/theater-ux/",
          "publishedOn": "2025-08-05T13:43:00.000Z",
          "wordCount": null,
          "title": "Theater UX",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/08/digital-holidays/",
          "author": null,
          "description": "The cost of being online is getting too damn high and I’m tired of pretending it’s possible to fit these tasks into a normal life. That’s why I’d like to share a modest proposal for a new set of holidays to manage our digital lives:\n(Ahem.)\nA day to clear out your inboxes\nA day to reset your passwords and delete old accounts\nA day to fix your calendars\nA day to cancel online service subscriptions\nA day to manage the tags on your website\nA day to switch out any critical apps\nA day to backup your computer and phone\nA day to organize your photos\nA day to organize your music collection and playlists\nA day to setup your new phone/computer\nA day to try out a new app or major piece of software for your primary workflow\nA day to delete old text messages\nAll I’m asking for is 1/30th of a year that we end up cramming into other days. I’m willing to trade some of the B-tier holidays (Easter, Thanksgiving, etc) for this. If you work in the government please call me, it is URGENT.",
          "link": "https://daverupert.com/2025/08/digital-holidays/",
          "publishedOn": "2025-08-04T13:03:00.000Z",
          "wordCount": null,
          "title": "A modest proposal for new holidays to manage your digital life",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/08/back-in-my-day-a-movie-cost-five-cents/",
          "author": null,
          "description": "After all our summer trips I buckled down last weekend and did some budgetting and I’ve realized I have to update the spreadsheet in my head. Here’s how much things cost in my outdated DaveBrain 2000 operating system:\nFast food -$5/person = $20/family\nSnacks - $2.50/person = $10/family\nThat –as my bank account is telling me– is super incorrect. The real numbers are much more like:\nFast food - $12.50~$15/person = $50~$60/family\nSnacks  - $5~$7.50/person = $20~$30/family\nAnd groceries have gone up too. Woof. Hard times in the concrete jungle.\nWe’re updating the database and cutting back on these obvious financial vampires. And we know when/why we tend to rely on them to get us through the week. So that’s good. But when you have kids –snack-reliant kids at that– introducing austerity measures like this is hard, because being a penny-pinching dick about money all the time probably isn’t good for them either.\nDon’t worry about me though. I’m lucky to have a great job and two kidneys, I’m sure I can sell one of them for a decent amount.\nNamaste.",
          "link": "https://daverupert.com/2025/08/back-in-my-day-a-movie-cost-five-cents/",
          "publishedOn": "2025-08-02T13:50:00.000Z",
          "wordCount": null,
          "title": "A fiscal recalibration",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/08/the-economy-he-died-five-years-ago/",
          "author": null,
          "description": "I hold a conspiracy theory the global economy died five years ago during Covid. It’s been on life support through stimulus checks and flash tech hype cycles ever since trying to keep the dormant heart beating. You sense it too. There’s no beating heart. There’s no thumping energy. No vein of excitement. Tech and knowledge work seems to be suffering the most.\nThe death of the Economy started long before Covid if I’m honest. Since the iPhone it feels like everyone has been waiting for the next big hit, the next new shiny, the next money-maker. It’s like an endless distracted boyfriend meme looping year over year. And I regret to inform you that the investors are at it again. Today it’s LLMs, before that crypto and the Web3 Metaverse, before that VR, before that the gig economy, before that s…",
          "link": "https://daverupert.com/2025/08/the-economy-he-died-five-years-ago/",
          "publishedOn": "2025-08-01T15:11:00.000Z",
          "wordCount": null,
          "title": "The Economy? He died five years ago.",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/07/sci-fi-rectangles-with-corner-shape/",
          "author": null,
          "description": "In Chromium 139, CSS gets a new corner-shape property which unlocks some cool new CSS tricks. Most notably it gives us “squircles”, the mathematical superellipse shape introduced by Apple in iOS 7. Designers have been in love with them ever since and include them in every design comp using Figma’s “corner-smoothing” slider even tho CSS has no similar correlation… until now!\nFrontend Masters has a beautiful writeup on corner-shape and superellipses showing that it goes way beyond squircles to make some real complex shapes. One capability they didn’t cover in that post is probably the most important of all: CSS corner-shape enables easy sci-fi rectangles.\nBy “sci-fi rectangles” I am of course referring to the sci-fi film and television trope where all rectangles (doors, windows, furniture, u…",
          "link": "https://daverupert.com/2025/07/sci-fi-rectangles-with-corner-shape/",
          "publishedOn": "2025-07-31T14:36:00.000Z",
          "wordCount": null,
          "title": "Easy sci-fi rectangles with corner-shape",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/07/always-buy-the-yamaha/",
          "author": null,
          "description": "I don’t have much life advice but I do know one thing: Always buy the $200 Yamaha guitar.\nIf you’re thinking about it, do it. Talk to any guitarist you know who has been playing awhile and they’ll have a story about a $200 Yamaha and how good it sounds relative to the price. It’s with uncanny regularity I encounter fellow travelers with a similar story about this particular cheap guitar.\nMy $200 Yamaha story growing up was my step-dad’s acoustic. He had two acoustic guitars actually; the Yamaha which stayed out propped against his bedroom wall and another one (I don’t remember the brand) with fancy jade inlays that stayed clasped in the green felt case under his bed. I wasn’t supposed to touch any of his guitars but I would sneak in and noodle on that Yamaha every chance I got. The Yamaha …",
          "link": "https://daverupert.com/2025/07/always-buy-the-yamaha/",
          "publishedOn": "2025-07-30T13:31:00.000Z",
          "wordCount": null,
          "title": "Before I go: Always buy the $200 Yamaha",
          "imageUrl": null
        },
        {
          "id": "https://daverupert.com/2025/07/social-media-ethos/",
          "author": null,
          "description": "I’m trying to come up with an ethos of how I want to use social media. What rules and constraints do I put around it. This is a living document.\nRules for posting/reposting content:\nRepost/Share cool links from the internet\nRepost/Share cool art (and credit whenever possible)\nRepost/Share people looking for work\nDoubly-so if the people above are in tech and from an underrepresented group\nRepost/Share job listing from reputable companies\nThen… if you’ve done all that, promote your own thing\nGeneral principles for me and my brain:\nI have a bad habit of starting the day off with a goof, avoid this\nI like riffing and puns but it can have reply-guy vibes, limit this\nIn any conversation you have 3 options: Be rude, Be nice, Say nothing – the latter is usually the most correct answer\nIt’s okay to let people be wrong\nWrite down the issues you allow yourself to get outraged over\nRead the room before posting\nYou can block/mute any person or channel for any reason, it’s fun\nResearch suggests it takes 23m15s to resume a task after a distraction!\nRaycast Focus is your friend\nOn specific social-media apps:\nX is for Nazis and Russian bot nets, avoid.\nFB/Instgram are for family and friends, use on occasion.\nTikTok is a dopamine trap, avoid.\nYouTube is a dopamine trap, but useful.\nBluesky is fine.\nMastodon is for quality conversations.\nDiscord is for like-minded communities, prioritize intimate ones.\nLog into LinkedIn once a month and give some thumbs-ups. It supports your friends and colleagues in the algorithmic trash fire and that handshakefullness and relationship building might be helpful in the future if you need a job.",
          "link": "https://daverupert.com/2025/07/social-media-ethos/",
          "publishedOn": "2025-07-26T18:08:00.000Z",
          "wordCount": null,
          "title": "A social media ethos",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "老T博客",
      "feedUrl": "https://hyruo.com/index.xml",
      "siteUrl": "https://lawtee.com/",
      "articles": [
        {
          "id": "https://lawtee.com/article/luoxiang-crime-law/",
          "author": null,
          "description": "最近，老T有幸回到自己母校佛山大学，现场聆听风靡网络的罗翔老师过来讲课，感觉内心总有一种莫名的思绪在翻滚，但也不知道该怎么描述，于是，只好想到啥就说点啥，并就此记录下来。\n大家都是法盲\n\n从事法律工作十几年来，老T时常感到感到无助，怀疑是不是因为自己能力水平太差，是不是因为自己当年读的大学层次不够，总是出现本领恐慌甚至有点自卑，面对同行的专业素养和能力，经常手足无措。有时候面对新问题不知如何下手，面对困难问题不知从哪切入，面对一些无可奈何的事情，总是内心挣扎。\n\n\n这次，罗翔老师讲课的地点在佛山大学仙溪校区，也是我大学最开始的地方，在这里，我度过了人生中最为轻松快乐的时光。或许也是因为大学时过的太过安逸、舒适，以至于后来进入社会不断遭受挫折，由“从从容容、游刃有余”，逐渐演变为“匆匆忙忙、连滚带爬”。不过，无论如何还是庆幸自己当年高考选择了佛大，选择了法学这个专业，虽然毕业后磕磕绊绊，四处碰壁，但最终，又回到了佛山，重拾了法律工作。\n在罗翔老师的授课中，贯穿整场的一条主线是“我是法盲”“大家都是法盲”。他列举了大量刑事司法实践案例，这些案例中绝大多数都是涉及各类部门法，包括行政法、经济法、自然资源与环境保护法、国际法等等，每当提到这种跨部门法的案例时，他都会不由自主拉长音调，自嘲自己真是个“法盲”。\n\n\n的确，目前我国法律体系之庞大，毋庸置疑。比如他讲到一些“购买什么品种鹦鹉构成犯罪？” “用弹弓打麻雀在什么时间、什么地点构成犯罪？”“自己网上海淘购买哪些药品会构成犯罪？”“薅联程飞机票羊毛是否构成犯罪？”“无证办广场舞培训班是否构成犯罪？”等等。\n事实上别说一般法律工作者，就算专门研究这些领域的学者，也很难在短时间内得出答案，甚至很多时候，研究得出的结论还可能是错误的，因为部门法之庞大，有些时候不仅涉及国家层面规定，还得考虑省级以下甚至县一级行政机构的文件，而研究过程很难…",
          "link": "https://lawtee.com/article/luoxiang-crime-law/",
          "publishedOn": "2025-10-16T15:29:00.000Z",
          "wordCount": 65,
          "title": "当我在大学现场听罗翔老师讲课时，我在听什么",
          "imageUrl": "https://lawtee.com/article/luoxiang-crime-law/fs.webp"
        },
        {
          "id": "https://lawtee.com/article/how-do-foreigners-choose-names-when-they-come-to-china/",
          "author": null,
          "description": "最近在 Slate 上看到一个名叫 Giovanni Garcia-Fenech 的作者以《美国吃掉了我的名字》为题，写了一篇很有意思的文章。刚好，老T前些天也简单写了个 10月1日即将实施的K签证对普通人有什么影响 分析可能出现的外国移民现象，不由得开始思考，是否外国人到中国时也会遇到“吃掉名字”这种问题。\n美国吃掉了我的名字\n\n这篇《How the Government Ate My Name》文章作者出生于墨西哥，全名有四个名字 Leonel Giovanni García Fenech，这在西班牙语国家是标准起名方法，体现了家族传承和历史文化。\n但作者在移民美国后，他的名字因美国官僚系统而被简化，在入籍时去掉一个名字，在驾照和护照上名字出现顺序混乱，甚至被缩写为“Giovanni F. Garcia”。\n作者后来从美国移居西班牙时，又因文件上的名字不匹配而无法获取墨西哥护照。作者幽默地描述了这些经历，强调名字作为身份载体的脆弱性，以及在不同国家因为名字变更时所带来的不便。\n最让老T感到惊讶的是，在这篇文章的末尾，作者提到的一个小故事：\n作者在西班牙的一个小店看到一个来自中国的上了年纪的老板娘，这个老板娘的名字居然叫“Lola”（萝拉），而这个“Lola”名字的由来，仅仅是因为此前这个店里有一个名叫“Lola”的小姑娘在此工作过，有客人经常上门就问“萝拉在哪？”于是这个中国老板娘就在一声一声的询问中，变成了“萝拉”。\n其他国家的情况\n\n美国的情况主要是基于英文环境，不支持 ASCII （英文字母及其标点符号）以外的字符，导致 ü、ä、ß 等字母都被替换。对长名字也存在文化抵触，即便是姓名中有三个词，也总是拧巴的将中间那个省略掉或者简写。例如，奥巴马的 Barack Hussein Obama 绝大多数时候都只写 Barack Obama 或者简写成 Barack H.…",
          "link": "https://lawtee.com/article/how-do-foreigners-choose-names-when-they-come-to-china/",
          "publishedOn": "2025-10-10T08:30:00.000Z",
          "wordCount": 104,
          "title": "外国人来中国是怎么取名字的",
          "imageUrl": "https://lawtee.com/article/how-do-foreigners-choose-names-when-they-come-to-china/1.webp"
        },
        {
          "id": "https://lawtee.com/article/bus/",
          "author": null,
          "description": "这个国庆长假，跟往年过的别无二致。最近10来年，老T除了个别年份的国庆长假期间有外出旅游，其余时间大多是自驾车辆往返于湘粤“两个家”之间。\n如果一定要说有什么不同，那这次主要区别就是因家里出行人数较多，5座小车坐不下，又单独给家人买了火车票。正是这次买火车票的经历，让老T重新认识了巴士这种交通工具。\n曾经的天坑\n\n讲起巴士，老T身上就有一把辛酸史。高中时，从乡里乘车去县城的中巴车上四五次被偷学费、生活费；大学时，从乡里去衡阳火车站的路上也被偷过生活费、手机。就连不经过火车站中转的长途巴士也被骗过。2012年春运，老T花费320元购买了一张衡山到佛山的长途车票，结果车子一到花都，司机就想把乘客赶下车。也就幸好当年老T用的黑莓手机已经有带GPS定位的谷歌地图，最终据理力争下，才让司机把车开进了广州市区。\n\n\n回看这段经历，老T感觉恍如隔世，2012年至今不过13年。电子地图这种新鲜事物在当时大多数人手机上还未普及，而如今，几乎所有人早已习惯电子地图这种基础设施般的服务所带来便利性。也正是这种便利性，让曾经的很多“坑”都被填平了。\n现在是真香\n\n由于老T决定帮家人买火车票时已邻近国庆，只剩两天时间，不管是高铁票还是普铁票，几乎都出售殆尽，只剩一些普铁无座票还有售。没办法，也只能硬着头皮买张广州白云站到长沙火车站的无座票先顶着。毕竟时间也不长，总比超载挤在小车里熬十几个小时堵车要强。\n比较头疼的是进出火车站的交通工具选择。两头的火车站离家都挺远：家里到广州白云站有60公里，从长沙火车站回老家有140公里（正常是到衡阳下，但衡阳没票）。以往常规方法是选择两边的汽车站到汽车站，然后再从汽车站转火车站。\n但老T在微信上搜索发现，现在的巴士，居然已经不需要去汽车站了，而是可以直接在附近公交站上车，甚至有的巴士还能直接上门接送，跟网约车、顺风车没任何区别。\n\n\n最关键的是，这种巴士还特别便宜。老T随手一查，发现广州到深圳的这种巴士居然有长期只卖19.9元的，甚至还有卖9.9元的。\n看到这，老T不禁对此产生了兴趣，想了解下这背后到底有什么原因。\n变化的原因\n\n老T一边刷着各种微信小程序，一边在网上搜罗资料。\n发现，这几年城际巴士的“变身”，主要得益于互联网平台的强势介入。\n过去，巴士运营大多靠传统的汽车站和固定线路，效率低下，成本高企。像老T老家县城的公交公司，前几年亏损后停运了很长一段时间，顺带逼得县城到长沙的热门线路都被砍了一大半，结局就是越降本增效，越进入恶性循环，最终只能全部推倒从头再来，靠着将农村中巴线路全部整合进去，才重新盘活。\n现在，各种互联网平台依托大数据和算法，通过优化线路和调度，能实现点对点甚至上门接送的服务。乘客不用再大老远跑到汽车站排队买票，直接在手机上选好时间和地点，巴士就近上车，省时省力。\n更重要的是，价格为什么这么低？老T觉得，这一方面应该是平台之间的“补贴大战”，为了抢占市场份额，往往通过烧钱补贴来吸引用户，比如五六十公里的线路，长期保持在19.9元甚至9.9元这种“白菜价”。另一方面，大巴电动化所带来的运营成本的降低也功不可没。随着电动巴士的普及，油费支出大幅下降，加上共享经济模式，车辆利用率更高，空载率低，自然能把价格压下来。\n老T看到一篇报道，说这种城际巴士的低价策略，其实并不意味着不赚钱。连顺风车都有全职开的，能载几十人的大巴车，平摊下来成本确实也很低。\n想想看，高铁虽然快，但票价动辄几百；自驾油费加高速费也不少；飞机更别提了。巴士这种“老古董”借着科技东风，摇身一变，竟成了性价比之王。",
          "link": "https://lawtee.com/article/bus/",
          "publishedOn": "2025-10-09T05:10:00.000Z",
          "wordCount": 62,
          "title": "跨城巴士为何突然又开始流行起来了",
          "imageUrl": "https://lawtee.com/article/bus/0.webp"
        },
        {
          "id": "https://lawtee.com/article/whats-k-visa/",
          "author": null,
          "description": "这几天在知乎有个炒的火热的话题。国家即将开始颁发的K签证，引发很多人焦虑，是否外国人也要进来抢饭碗？\n老T从自己视角也试着简单回答了一下。\n总体来说，我认为这个签证政策对普通人没啥影响。K签讲白了还是个技术移民签证，虽然国家层面还没有制定具体办法，但大概率是按照美国H1B模式的。\n为啥现在要招外国人参与搞技术？\n\n重点还是服务国内制造业产业升级和关联产业需求。最主要是需要有懂第三世界国家语言、习俗、社会规范、消费习惯的人过来参与源头生产。\n毫无疑问，美国IT互联网巨头里边大量印度裔员工，对美国科技公司开拓印度市场、理解印度用户需求、以及产品设计中融入某些印度文化元素，起到了重要的催化剂、加速器和桥梁作用。\n中国制造想要有全球影响力，不是说在终端市场搞些研发中心就能解决问题，不可避免需要更多具有原生文化背景的外国人参与。\n而这类职业生态位，与本国人力资源几乎没有竞争关系。\n对普通人有什么影响？\n\n对普通人而言，K签证的实施几乎不会产生直接冲击。 它并非为了填补国内技术人才的“数量缺口”，而是精准地瞄准了“特定能力缺口”，即中国制造需要深度嵌入新兴市场本土语境（语言、文化、消费心理、社会网络）的稀缺能力。\n这类引进人才的核心价值，在于帮助中国制造业和关联产业从源头设计、生产环节就精准锚定海外目标市场的真实需求，减少“水土不服”。这与本土人才在技术研发、生产管理、国内市场开拓等方面的核心能力是高度互补而非竞争的关系。\n本质上，K签证是中国产业全球化深化到新阶段，为提升“本地化能力”和“源头创新适配性”而进行的一次战略性人才资源配置优化，其影响在于提升中国制造的全球竞争力与渗透力，而非与普通人争夺就业机会。\n会不会引进洋垃圾？\n\n老T也很理解大多数人对这种问题的想法，动则关联到留学生问题。\n但说到底，工作签证的前提是有工作，是国内企业愿意招外国人进来，是老板要真金白银给外国人发工资，需要解决企业内部沟通、管理问题，不可能有哪个老板请个“爹”来上班。如果不能发光发热，或者公司内部排斥导致其无法工作，那自然而然签证也就失效了。",
          "link": "https://lawtee.com/article/whats-k-visa/",
          "publishedOn": "2025-09-29T23:10:00.000Z",
          "wordCount": 63,
          "title": "10月1日即将实施的K签证对普通人有什么影响",
          "imageUrl": "https://lawtee.com/article/whats-k-visa/0.webp"
        },
        {
          "id": "https://lawtee.com/article/covid-anosmia-recurrence/",
          "author": null,
          "description": "最近受“桦加沙”台风影响，夜里气温不上不下，开空调嫌冷，不开又有点闷。老T想着省点电，就没开空调，靠电风扇吹了一夜。结果，省电不成，倒把自己吹感冒了。\n起初就是个普通感冒，流了两天鼻涕。可没想到，鼻涕快消停时，嗅觉突然又没了！\n这已经是我第四次经历嗅觉丧失了。 第一次是2022年底阳了之后；第二次是2023年，感觉像是新冠回潮；第三次是去年冬天，症状也像新冠。但这次，我敢肯定不是新冠，用试纸测了，只有一条线。\n这让我忍不住琢磨：搞不好前两次也不是新冠呢？ 因为除了第一次阳了和这次测了，中间那两次我其实都没做检测，当时只当是新冠了。现在想想，真有点细思恐极：难道得过新冠之后，再遇上普通感冒也会触发嗅觉失灵？\n作为医学门外汉，老T只好求助网络，想弄清楚感冒和嗅觉失灵之间到底有没有关联，也希望能给有类似经历的朋友一点参考。\n要回答这个问题，得从科学角度切入。老T在 Science 上查到一项研究显示，新冠病毒对嗅觉系统的冲击远超普通感冒。它不像感冒那样主要是鼻塞堵路，而是直接“入侵”嗅觉上皮，也就是鼻子里的那些负责闻味儿的细胞。病毒通过 ACE2 受体进入支持细胞（sustentacular cells），导致炎症风暴，进而影响嗅觉神经元。这不是一次性的损伤，而是可能留下“后遗症”：慢性炎症或神经修复不全，让嗅觉系统变得脆弱。\n\n\n由于老T看不懂这些具体内容，只能简单联想：新冠就好像一场“地震”，震坏了嗅觉基础结构，后续的小感冒则类似“余震”，轻易就能触发嗅觉失灵。\n具体到复发机制，《英国医学杂志》上的 Post-viral olfactory loss and parosmia 文章指出，新冠患者嗅觉失灵的发生率高达 50%，其中许多人会发展为持久型或异嗅（闻到的味道变味儿），感染后6个月仍有27-60%的患者有嗅觉问题，1年后26.5-46%，甚至2年后还有8.3%。\n\n\n为什么普通感冒会“借力打力”？因为感冒病毒（如鼻病毒）通常只引起暂时性鼻炎，但在前新冠患者身上，它可能放大残留的炎症。譬如，一篇案例研究描述了患者反复嗅觉失灵，可能源于过度炎症、再感染或病毒复制反弹。我的经历就很贴合：每次感冒后，不是鼻塞时就失灵，而是恢复期突然发作，这暗示不是机械堵塞，而是神经信号出了岔子。另一项研究进一步证实，后新冠嗅觉功能障碍与“长新冠”相关，涉及免疫细胞浸润和嗅觉上皮基因表达改变，导致系统对新感染更敏感。\n\n\n当然，这其实也不是什么大事，绝大多数情况下，这种嗅觉失常现象，都能在一两个星期内逐渐恢复，尤其是年轻患者。\n我自己这几天也在试着搞点恢复训练，闻闻柠檬、薄荷这些强烈气味，好像现在已经好很多了。\n\n\n假如你也遇上类似情况，别慌，记录下来，或许像我一样，找找背后的科学依据，心里就能多几分踏实。\n生活本就五味杂陈，闻不着时，就多尝尝回忆的味道吧。\n参考文献：\nOlfactory and gustatory dysfunctions as a clinical presentation of mild-to-moderate forms of the coronavirus disease (COVID-19): A multicenter European study. https://link.springer.com/article/10.1007/s00405-020-05965-1\nPost-viral olfactory loss and parosmia. https://pubmed.ncbi.nlm.nih.gov/37841969/\nLong-lasting olfactory dysfunction in COVID-19 patients https://link.springer.com/article/10.1007/s00405-021-07153-1\nNon-neuronal expression of SARS-CoV-2 entry genes in the olfactory system suggests mechanisms underlying COVID-19-associated anosmia. https://www.science.org/doi/10.1126/sciadv.abc5801\nPrognosis and persistence of smell and taste dysfunction in patients with covid-19: meta-analysis with parametric cure modelling of recovery curves https://pubmed.ncbi.nlm.nih.gov/35896188/",
          "link": "https://lawtee.com/article/covid-anosmia-recurrence/",
          "publishedOn": "2025-09-26T11:10:00.000Z",
          "wordCount": 142,
          "title": "为什么得过新冠后，再次感冒时容易嗅觉“失灵”",
          "imageUrl": "https://lawtee.com/article/covid-anosmia-recurrence/0.webp"
        },
        {
          "id": "https://lawtee.com/article/difference-between-wechat-and-blog/",
          "author": null,
          "description": "从 9 月 1 日老T正式开始启用公众号算起，到今天刚好 10 天，这 10 天说短也短，说长也长。短的是，自 2008 年老T开始网络写作以来，这 10 天几乎可以忽略不计。长的是，这 10 天算是老T 17 年写作历程中收获最多的时期，充满了新鲜感和挑战。\n微信公众号简要回顾\n\n这 10 天里，老T公众号共更新 10 篇文章，其中 8 篇都是从博客搬到公众号的，只有 2 篇是近期新作。\n在 8 篇搬迁的文章中，前 4 篇基本就是直接从博客复制粘贴，后 4 篇经过了大范围修订，几乎相当于重新写了一遍。\n10 篇文章共计阅读量 2.2 万，其中最高的约 1 万，最少的 17。\n\n\n另外，老T也收获了首个赞赏，来自安徽的网友 @Chulixia, 在此表示衷心的感谢！\n微信公众号与博客的区别\n\n本来，老T以为微信公众号只是另一个信息发布平台，在已有文稿的基础上，简单发布即可。但由于微信天然的社交属性，这种想法很快就破灭了。微信公众号和博客看似都是写作平台，但本质上差异巨大，尤其是传播机制、读者互动和写作要求等方面。下面，老T就结合这 10 天的亲身经历，谈谈几点主要区别。\n推荐算法与搜索排名\n\n微信公众号的核心是推荐算法，它像一个无形的编辑，总在决定每篇文章能不能被推送到更多人面前。老T感觉这些天来，无时无刻不在被算法左右：文章标题要吸引人、内容要迎合读者口味、甚至发布时间都要卡点。\n举个例子，老T的公众号目前总阅读量约 2.2 万，其中 90.4% 都来自算法推荐。如果算法不喜欢老T的文章，它就静静躺在后台，阅读量寥寥无几。\n相比之下，博客更像一个安静的图书馆，主要面对搜索引擎。文章一发，就扔到网络大海里，由用户自己去搜索、发现。没有算法的“喜好”来左右，不管写的是专业知识还是个人心得，都只是共享出去，设置好关键词，等着有缘人来找。例如，老T的博客文章，很多都是 10 几年前写的，但通过搜索引擎，至今还能带来流量。\n这种区别让写作心态完全不同。在微信上，老T得使劲琢磨“算法会不会推”，而在博客，老T只需问自己“这个内容有没有价值”就行。\n订阅数\n\n微信公众号的价值很大程度上取决于粉丝数。粉丝越多，推送就越稳，阅读基数越高。老T这 10 天，粉丝从 0 涨到 100+，主要靠算法推荐拉新。但目前粉丝基数很小，新文章容易石沉大海。\n博客的订阅数（比如 RSS 或邮件订阅）则没那么关键。博客读者往往是零散的搜索流量，订阅只是锦上添花。老T的博客订阅者不多，但文章通过 SEO 优化，也能持续吸引新访客。简单说，微信更像是是“粉丝经济”，而博客一直是“内容长尾”，前者靠积累人气，后者靠积累内容。\n另外，这里老T再补充另一个经常使用的知乎平台情况，完全是另外一套逻辑的。知乎既不靠粉丝数，也不靠搜索引擎，甚至也可以说不靠算法推荐。因为它默认使用算法将问题推送给所有潜在创作者和读者，创作者只需要沿着知乎推荐的问题进行回答即可获得大量自然流量，也算是另一种“算法平权”。例如，老T最近一个月在知乎的回答几个问题，累计阅读近 40 万，绝大多数阅读量都来源于用户被知乎问题所吸引而点进页面后查看的。不管是作为创作者还是用户，老T都完全不用担心算法或关注数的影响。\n\n\n写作风格\n\n这 10 天下来，老T感觉微信公众号的生态不适合太长、太专业的写法。读者大多用的是碎片化时间在阅读，刷朋友圈或订阅号时，更喜欢短平快的内容。老T花大力气写了几篇 5000 字以上的长文，比如分析印度强奸率、研究外国人如何看待93阅兵等，但阅读量和推荐最多的，反而是飞牛 NAS 相关的那些 2000 字以内的实用性文章。当然，这也可能因为内容差异，几篇长的文章，公众号后台审核后都明确不给推荐。\n博客则更注重专业性和深度。没有什么限制，可以尽情展开，写成万字长文也没关系，因为读者是主动搜索来的，往往有特定需求。老T在博客上写的那些长篇内容，阅读量虽不高，但反馈很专业，读者留言讨论也更深入。微信像快餐，博客像大餐，前者求速，后者求精。\n推荐限制的不确定性\n\n微信的运营规范有 23000 多字四五百条内容，说是包罗万象也不夸张。但创作者并不知道这些具体规范的阈值，只有写完提交后，才能从助推审核结果中看出端倪。老T阅读量最少的那几篇文章，至今没搞清到底因为什么原因不给推荐，反正后台通知就一句话：“不符合微信公众平台运营规范”。\n博客则没这些烦恼，只要遵纪守法即可，搜索引擎抓取后，更多的由用户自己判断。顶多是 SEO 优化的问题，但至少透明可控。\n结语\n\n总之，这10天让老T深刻感受到，微信公众号更像一场算法游戏，需要不断试错、优化。而博客则更适合个性化创作，注重长效价值。当然，两者不是非此即彼，老T会继续双管齐下，保持两边同步更新。希望这些心得对其他创作者有帮助。如果你也有类似经历，欢迎留言交流！",
          "link": "https://lawtee.com/article/difference-between-wechat-and-blog/",
          "publishedOn": "2025-09-10T10:20:00.000Z",
          "wordCount": 133,
          "title": "写微信公众号和写博客的区别",
          "imageUrl": "https://lawtee.com/article/difference-between-wechat-and-blog/0.webp"
        },
        {
          "id": "https://lawtee.com/article/one-million-works/",
          "author": null,
          "description": "昨天在 QQ 群看到朋友说我码字已经超 100 万。确实，截止目前，Hugo 统计 359 篇文章，已合计 1036977 字。其实这个统计在到八九十万的时候，我还是比较关注，毕竟很快要到 100 万，心里还有点激动。但真等到后边恰好破百万时，又没怎么在意了。这让我想到心理学中的目标达成悖论：人们往往在追求目标时投入巨大情感，真正实现后却可能产生空虚感。\n回顾码字经历\n\n这次码字破 100 万，也许是个迟来的“成就”。毕竟，熟悉老T的老朋友，特别是从 2008 年开始一起加入 Blogfans 的老兄弟们，都知道我曾经多次大量删除过以往的文章。按照老T在 2017 年留下的老 Mysql 数据库统计，当时字数就已经有 114 万，只是当年并没有去想过这个问题。而如今留下的这些内容里边，属于 2017 年以前写的，占原本比例应该不足 1/4 。不过，不管怎样，这次破 100 万，对自己来说还是有一定纪念意义。\n\n\n最初想法\n\n回顾老T 2008 年以来码字的经历，我想正是印证了最初写下的那句 When each sunrise, we start a new. 虽然在当年，这句话更多表达的是新生之意，晨光初启、新途又始。到后来，随着日复一日的坚持更新，这句话逐渐演变为红日再升、新章复启。如今，站在新的起点，我更多的在想，这很可能又是一个破晓之时，需要境界新开了。\n\n\n\n 1\n 2\n 3\n 4\n 5\n 6\n 7\n 8\n 9\n10\n11\n12\n\n\n\n---\ntitle: \"您好, 世界!\"\nslug: \"hello-world\"\ndate: 2008-05-21\ncategories: [\"技术\"]\ntags: [\"WordPress\"]\n---\n\n经过十多小时从零开始的学习，我终于开通了自己的第一个网站。\n在这里我要特别感谢抓抓，要是没有他在最后一刻发出的消息免费提供了本网站的…",
          "link": "https://lawtee.com/article/one-million-works/",
          "publishedOn": "2025-09-06T01:30:00.000Z",
          "wordCount": 191,
          "title": "码字百万之际—开通个人微信订阅号",
          "imageUrl": "https://lawtee.com/article/one-million-works/0.webp"
        },
        {
          "id": "https://lawtee.com/article/why-1000m-bandwith-tesed-300m/",
          "author": null,
          "description": "2020年，老T曾以这个标题写过一篇简单的 文章，主要是因为当年在百度上搜索这个问题答案时，找到的都是千篇一律洗稿内容，鲜有能够讲清这个问题的文章。\n甚至可以说，当时网上大多数关于这个问题的解答都是在瞎扯。有些讨论下边，还各种对提问者挖苦、讥讽，认为提问者丝毫不懂网络常识，但又不给出解决问题的思路办法。由于当年老T也恰好遇到这个问题，便进行一番研究。\n现今5年过去，国内网络环境又与此前有了一些不同，千兆宽带已成标配，甚至万兆宽带也开始进入部分家庭，老T觉得有必要重新对这个问题进行梳理。\n为何1000M光纤宽带，测速只有300M？\n\n当年老T遇到这个问题，首要原因就出在路由器上。\n在1000M光纤刚开始进入千家万户的时候，由于多数家庭用户还在使用旧型号路由器，有些路由器虽然参数上写着支持 1000Mbps 网口，但那个网速只是供内网传输使用的，内外网之间的速度并不能达到 1000M。\n也就是说，在内网配置没有明显问题的情况下，用户将两台电脑同时用网线连接到路由器时，这两台电脑之间的内网传输速度能够达到 1000Mbps。\n而当用户通过这台路由器连接外网时，这时由于路由器内部芯片处理能力限制，传输速度就会骤减至 300-500Mbps。\n老T 画了个示意图，争取把这个逻辑展示清楚。\n\n\n5年前，不少家庭用户都是因为这个情况导致测速结果达不到运营商标称的速度。\n例如：\n网件 R7000 WAN TO LAN 最大速率：931 Mbps \n网件 R6300v2 WAN TO LAN 最大速率：806 Mbps \n华硕 AC68U WAN TO LAN 最大速率: 754.5 Mbps \nTP-LINK TGR1900 WAN TO LAN 最大速率: 631 Mbps\n网件 R6100 WAN TO LAN 最大速率: 93.1 Mbps\n不过，当年老T 遇到的问题比这个还稍微复杂…",
          "link": "https://lawtee.com/article/why-1000m-bandwith-tesed-300m/",
          "publishedOn": "2025-09-05T03:30:00.000Z",
          "wordCount": 238,
          "title": "为何1000M宽带，有时候测速只有300M（二）",
          "imageUrl": "https://lawtee.com/article/why-1000m-bandwith-tesed-300m/1.webp"
        },
        {
          "id": "https://lawtee.com/article/china-military-parade/",
          "author": null,
          "description": "纪念中国人民抗日战争暨世界反法西斯战争胜利80周年阅兵仪式在昨日隆重举行。老话说，国之大事，在祀与戎，而和平年代的阅兵式，正是这两件事的完美结合。作为当今世界最受关注的事件，老T在网上冲浪过程中，也看到不少外国人的评价，其中很多都比较有意思，这里也简单跟大家分享一下。\n俄罗斯人如何看待93阅兵\n\n老T在日常混迹的多个技术论坛上都看到有人发贴讨论中国的阅兵式，其中最典型的评论就是：“看吧，中国果然没有向俄罗斯提供武器，不然战争局面早就改写了。” 由于在多个平台都看到这种评论，老T也感觉摸不着头脑。只能说，相比西方媒体这些年大肆宣扬的“中国威胁论”，西方民间对俄罗斯的恐惧感，确实是入心入肺了。\n\n\n由于我们这一代人都在亲身经历中国工业现代化进程，对国内的制造能力早已有充分认识。哪怕按照最朴素的唯物主义思维也知道，一个常住人口和GDP都比不过广东的国家，制造能力显然跟中国有巨大差距。\n但西方老百姓长期受媒体偏见影响，对中国的这种能力认识还是存在较大偏差。而此次阅兵展示，一定程度上也算是在帮他们纠偏。\n不过，在这过程中，我也很好奇，就是作为这种评论里的另一方，俄罗斯人会如何看待中国阅兵呢？\n老T特意找了些懂俄语的朋友帮忙，也翻了翻俄罗斯两大社交平台 VK.com 和 Pikabu.ru，了解下到底俄罗斯普通网友有何观后感。\n“大受震撼”的技术派\n主要评论包括： “规模惊人！技术顶尖！” “正步完美，装备像科幻片” “机器狗和核导弹？中国准备好应对一切了” “水下无人机和机器人才是未来战争，中国AI武器领先了” “新型坦克配高超音速导弹…北约想清楚要和谁打了吗？”\n\n\n\n照老T说，这反应在我们这边看来也还算实在。我们天天看着“下饺子” 新装备官宣，可能有点习以为常了。但对俄罗斯人来说，这次阅兵式上展示的装备，特别是高超音速、无人机、AI 这些新装备，确实刷新了他们的认知，甚至带点羡慕…",
          "link": "https://lawtee.com/article/china-military-parade/",
          "publishedOn": "2025-09-04T08:30:00.000Z",
          "wordCount": 103,
          "title": "当外国人看93阅兵时，他们在看什么",
          "imageUrl": "https://lawtee.com/article/china-military-parade/0.webp"
        },
        {
          "id": "https://lawtee.com/article/fix-pve-node-unknown-bug/",
          "author": null,
          "description": "周日下午，老T准备在 PVE 装个 RouterOS 测试，结果发现无法创建虚拟机。具体表现是，在虚拟机创建页面，节点处提示 “Node epson seems to be offline” ，然后 PVE 面板上，节点显示灰色问号，提示状态为 “Unknown”。由此，开始了老T一段跌宕起伏的 Bug 修复过程。\nPVE 存储设备配置冲突\n\n遇到 Bug 后，老T第一时间怀疑是不是节点配置冲突。因为节点内的虚拟机本身在正常运行，除了节点上有灰色问号，在节点中还有两个存储设备也同样显示黑色问号。\n这两个存储设备实际就是主机中的两个机械硬盘。此前，老T将这两个机械硬盘挂载后，直通给了 100 号虚拟机使用。\n但考虑到虚拟机中无法读取硬盘温度，便分离了存储，改用 PCI-E 硬件直通，将 SATA 控制器直通到虚拟机。故此遗留两个过期的存储设备。\n于是老T在 PVE 面板中直接删除了两个存储设备，然后刷新，看到问题依旧。\n老T在想，是否是因为集群状态还没更新，于是重启并强制刷新集群状态，同时检查存储挂载情况。\n\n\n\n1\n2\n3\n\n\n\nsystemctl restart pve-cluster\nsystemctl restart corosync\npvesm status\n\n\n\n\n\n果然，存储状态有点问题。PVE 配置中保留了两个 HDD 的 LVM 存储定义，但实际物理磁盘已经直通给 100 号虚拟机不可见。\n\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n\n\n\nroot@epson:# pvesm status\nCommand failed with status code 5.\ncommand '/sbin/vgscan --ignorelockingfailure --mknodes' failed: exit code 5\nName Type Status Total Used …",
          "link": "https://lawtee.com/article/fix-pve-node-unknown-bug/",
          "publishedOn": "2025-09-02T10:30:00.000Z",
          "wordCount": 1211,
          "title": "一次跌宕起伏的BUG修复——PVE节点出现Unknown状态故障",
          "imageUrl": "https://lawtee.com/article/fix-pve-node-unknown-bug/1.webp"
        },
        {
          "id": "https://lawtee.com/article/august-talk-about/",
          "author": null,
          "description": "这是老 T 在 8 月份的说说内容，这里将其一并提取发布，主要包括 Folo RSS 更换域名后的一些问题，医保用药问题，汽车滤芯损毁问题，以及在使用飞牛和群晖过程中遇到的一些问题等。\nGithub issue 作为博客说说发布页面的模板设置问题\n\n在设置模板过程中，需要留意以下几个问题：\n页面构建缓存。可能导致页面内容可能无法更新。\n\n\n\n1\n2\n3\n4\n5\n6\n\n\n\n {{ $url := \"https://api.github.com/repos/user/moments/issues/1/comments\" }}\n {{ $opts := dict\n \"headers\" (dict \"User-Agent\" \"Hugo Static Site Generator\")\n \"cache\" 300\n \"cacheKey\" (printf \"gh-comments-%s\" (now.Format \"2006-01-02-15:04\"))\n }}\n\n\n\n\n\n内容排序。 github issue api 输出数据是最新的内容在后边，需要倒过来。\n\n\n\n1\n2\n3\n4\n\n\n\n {{ with resources.GetRemote $url $opts }}\n {{ if and .Content (ne .Content \"\") }}\n {{ $comments := .Content | transform.Unmarshal (dict \"format\" \"json\") }}\n {{ $sortedComments := sort $comments \"created_at\" \"desc\" }}\n\n\n\n\n\n时间格式。github issue 默认使用 UTC 时间，中国的话，需要在基准上加8个小时。\n\n\n\n1\n2\n3\n\n\n\n<time>\n {{ (.created_at |…",
          "link": "https://lawtee.com/article/august-talk-about/",
          "publishedOn": "2025-08-30T12:30:00.000Z",
          "wordCount": 428,
          "title": "8月说说: Folo RSS迁移 医保药价 断机油滤芯 飞牛不显示硬盘温度",
          "imageUrl": "https://lawtee.com/article/august-talk-about/0.webp"
        },
        {
          "id": "https://lawtee.com/article/change-new-blog-name/",
          "author": null,
          "description": "虽然还没到 9 月 1 日，但我儿子今天已经提前去学校适应小学生活，随着新的阶段到来，我也想着给本博客换个名称。过程中，找两个小孩帮忙，顺便给他们解释了一下网站域名 Lawtee的含义，然后，不知怎得，两娃就突然开始喊我“老T”。感觉也是天意注定，那我就将本博名字改叫“老T博客”吧。\n老T即Lawtee\n\n去年我在选择 Lawtee.com 这个域名时，本来也没想太多，主要是 5 位带 law 三个字母的 com 域名，早已被注册殆尽，而 6 字母中带这三个字母的，也所剩无几，矮个子里边挑高个，最后也就选了这个。\n在英文发音中，Law 的美式发音  /lɑː/ 读起来跟 老 字很相近，而 Tee 发音为 /tiː/ 跟字母 T 一模一样。因此，Lawtee 读成 “老T” 倒也显得理所应当。\n这次更名前，我也在网上简单搜索了一下，好像叫“老T”这种名字的也不多，那就这样用了。\n为什么不再用之前名称\n\n此前，我将本博取名 “法律小茶馆” 其实是按照 Lawtee 意译而来，在一些欧洲国家，Tee 就是茶的意思，跟 Tea 的发音也没啥区别。\n但正如目前所现，本博其实大部分内容都跟法律没啥关系，与法律相关主题最多能占到 1/4，强行取个这样的名字，很容易让人误解。\n不过，总的来说，由于我长期从事法律工作，这个域名倒也没有继续更换的必要。只是文字介绍需要稍微变动一下，不再着重强调自己的职业，而是依据内容展现方向，改成了“法律、科技和生活”。\n毕竟，工作只占日常 1/3 不到的时间，工作之余，这个身份也没有必要随时挂着碍眼了。\n未来有何规划\n\n这里还是引用之前更换 Lawtee.com 域名时的想法吧，其实也没什么大的变化。\n正如我在 关于 页面中提到： “到 2023 年，自己也已经接近 35 岁，在一些行业都是开始想着退休的年龄，于是回头重构一下博客，想着就这样定型玩下去。” …",
          "link": "https://lawtee.com/article/change-new-blog-name/",
          "publishedOn": "2025-08-28T07:20:00.000Z",
          "wordCount": 515,
          "title": "将博客更名为“老T博客” 顺便更新自己使用过的一些硬件产品",
          "imageUrl": "https://lawtee.com/article/change-new-blog-name/1.webp"
        },
        {
          "id": "https://lawtee.com/article/repair-a-panasonic-smart-tolit-seat/",
          "author": null,
          "description": "最近，我家一个智能马桶盖出故障，控制板上，除了水温按钮有反应，其他按钮全失灵，而且重新上电也没任何反应。直觉告诉我，这应该不是单一故障，而是多个问题同时存在所导致。为此，我晚上花了几个小时仔细研究了一下这个产品。\n故障表现\n\n这台松下 EKS09 智能马桶盖是我 2019 年买的，迄今已接近 6 年，超出了五年保质期。要么自己修，要么换新的。\n考虑到我之后买的两个马桶盖水压普遍偏大，而这个松下的冲水柔和，主要是小孩在用，所以我第一反应还是想通过维修来解决。\n此前这个马桶盖曾出现过按键失灵情况，一度所有按钮都没反应，但隔天又好了，应该是排线板接触不良或腐蚀问题。\n这次故障更加麻烦点。\n控制面板上 8 个按钮。其中 6 个功能控制键中，只有 1 个水温键有反应；测试键方面，长按测试后灯常亮，但没进入测试，并且无论如何无法退出测试，着座键及灯光正常。\n在断电重新上电后，只听到电机嗡嗡声，但不出水，冲洗杆也不伸出来。\n\n\n问题查找和维修过程\n\n由于我此前对智能马桶盖的内部构造没有研究过，直觉上认为这次应该是两个问题。\n控制面板失灵；\n冲洗杆马达坏了或堵了。\n主板\n\n马桶盖外壳拆解倒是比较简单，总体来说，就是卸下螺丝，稍微用力就拆出来了。但真要找到问题所在还得花点功夫。\n\n\n首先是肉眼观察整个主板，发现已经作了防水处理，肉眼也没见到有元器件烧毁情况。也应证了水温按钮可以使用、上电后电机会嗡嗡出声的情况，总体功能上应该没大的问题。\n出水杆\n\n其次，重点是研究这个出水杆的构造。\n\n\n这个出水杆由两个马达控制，蓝色管进水，白色管输送到出水杆中。\n我一开始不知道这个东西原理，以为是出水杆末端马达控制升降，三角位的马达在抽水。\n后来才知道，出水杆末端那个马达仅仅是起到旋转开关的作用，控制阀门；而控制升降的是三角位的马达。\n但拆下这两个马达后，却也没发现什么异常情况。\n在整机上电后，末端马达能够…",
          "link": "https://lawtee.com/article/repair-a-panasonic-smart-tolit-seat/",
          "publishedOn": "2025-08-26T03:30:00.000Z",
          "wordCount": 85,
          "title": "维修一个松下智能马桶盖",
          "imageUrl": "https://lawtee.com/article/repair-a-panasonic-smart-tolit-seat/msedge_RQT9txkO9M.webp"
        },
        {
          "id": "https://lawtee.com/article/slim-down-nas-storage/",
          "author": null,
          "description": "之前在 群晖、迷你主机还是捡垃圾，家用NAS怎么选 提到，我家里 NAS 存储的重要家庭数据已经达到 1000GB，主要就是家中多年积累下来的照片、视频，共计约 20 万文件。虽说存储量也不大，但在迁移过程中，还是感觉很吃力，大量小文件读写，用移动硬盘复制都得几个小时。为了解决这个问题，便于日后轻松上阵，我借鉴之前在 hugo 和 soomal 项目中的经验，对 NAS 文件来了次大瘦身，节约 75% 的空间。\n清理重复文件\n\n\n\n我以前备份照片视频的模式，基本都是采取每年一到两次的频率，将相机、手机照片视频冷备份到 NAS。大体是选择在春节、国庆长假这种时间节点，以及换手机的时候，一股脑把手机上照片视频通过移动硬盘复制过去。\n在这过程中，有一个比较麻烦的事情是，每次我换手机都会将上一台手机的照片视频导入新手机，而上一台手机中很多照片、视频实际上都已经在 NAS 有备份。这种情况下，如果自己备份的时候认真一点，通常会考虑删除一遍重复文件，但很多时候比较懒就没管了。造成 NAS 中实际上有不少文件都是重复版本。\n要清理群晖 NAS 中的重复文件，通常有三种方法。\n群晖自带的存储空间分析器。打开群晖自带的存储空间分析器，查找“潜在重复文件”，通常会输出一个 csv 文件，列明重复文件。把需要删除的文件导出为 txt，然后在“任务计划”中通过命令 cat /volume3/video/delete.txt | xargs -I {} rm -f \"{}\" 就能把重复文件删除。\n\n\n\n这种方法只适合重复文件数量较少的情况。例如，我的群晖每次只支持查找 5000 个重复文件。如果重复文件显著超过这个数值，就不是很实用了。毕竟，每次查找重复文件都耗时颇多。\n\n\n\n第三方应用工具。 群晖第三方应用市场有几款删除文件工具比较实用。例如：dupeGuru fdupes 等。我也下载测试过，但…",
          "link": "https://lawtee.com/article/slim-down-nas-storage/",
          "publishedOn": "2025-08-19T08:30:00.000Z",
          "wordCount": 619,
          "title": "为 NAS 存储来个大瘦身 - 照片视频压缩方案",
          "imageUrl": "https://lawtee.com/article/slim-down-nas-storage/1.webp"
        },
        {
          "id": "https://lawtee.com/article/fnos-network-sercurity/",
          "author": null,
          "description": "飞牛 NAS 和群晖一样，自带系统级内网穿透功能。多年来，我一直使用群晖 quickconnect 用来访问家中的 NAS，虽然速度慢，但作为 NAS 界的扛把子，群晖服务的安全性还是让人比较安心。但飞牛这边就有点心结了，于是只好自己配置外网访问，同时通过防火墙和一定的规则设置，尽量在易用性和安全性中间寻求平衡，本文主要介绍我这种选择的原因和配置方案。\n为何不用飞牛 FN connect\n\n出于隐私安全考虑\n\n我在上一篇 《飞牛 OS 到底是选物理机安装还是虚拟机安装》 提到，毕竟飞牛还只是一家 20 多人的初创公司，从理性的角度来看，我可能没有必要把自己的隐私全交给它保管。\n相比而言，群晖那边，好歹是一家全球化企业，行业排名第一，在数据安全方面让人放心得多。\n虽然有点厚此薄彼，但这也是无奈的选择。\n此外，即便是群晖，也不是那么靠谱。例如，我单位机房有一台群晖 DS1618+，基于数据安全考虑，压根没有开启过外网连接，更谈不上使用 quickconnect 进行远程访问，所有数据都只保存在内网。\n还是个人信息安全\n\n从技术角度来看，以前想要从用户 NAS 中“偷数据”，总的来说难度还是不小。\n我相信，即便群晖要偷用户数据，也不可能一股脑将所有文件偷走，那个庞大的传输量，不可能不引发用户警觉，风险过高。\n真要“偷数据”也只能选择高价值的信息偷，而近年来兴起的 AI 识别功能就为“偷数据”创造了极佳条件。\n只需要有针对性设置关键词，“盗取”用户少量数据，即可实现“收益”最大化。\n此前，群晖的低下性能，让我觉得群晖很难用上这种手段，甚至到后来，由于我的 NAS 性能过于孱弱，我直接关闭了 AI 识图功能。\n而目前市面上各种国产 NAS（绿联、极空间等）或者图像软件（immich, mt photos, 飞牛相册等），无一不引用了更为强大的 AI 大模型，毫无疑问都可以更加精准地识…",
          "link": "https://lawtee.com/article/fnos-network-sercurity/",
          "publishedOn": "2025-08-16T14:30:00.000Z",
          "wordCount": 401,
          "title": "飞牛 NAS 公网防护设置的一些心得体会",
          "imageUrl": "https://lawtee.com/article/fnos-network-sercurity/1.webp"
        },
        {
          "id": "https://lawtee.com/article/pve-fnos/",
          "author": null,
          "description": "最近装了一台 x86 NAS，采用爱普生 ST190E 主机，搭配 4 核 4 线程的 i3-8300T 处理器，16GB DDR4 内存，以及 1TB Nvme M.2 接口固态硬盘和两个 2TB 的 SATA 接口 2.5 寸机械硬盘。这篇文章主要讲我如何在这台主机上安装飞牛 OS，重点是比较物理机安装和虚拟机安装的优劣。\n虚拟机安装（一）\n\n我一开始选的是 PVE 9.0 通过虚拟机安装飞牛 OS。\n安装教程参考飞牛官网方式，如何在虚拟机安装飞牛 fnOS？。\n但是这个教程中，并未提到 GPU 直通的问题。\n由于我的 i3-8300T 内置 UHD 630 核显，而我使用飞牛最主要的用途就是相册功能，因此我重点需要解决 UHD 630 核显直通飞牛 OS 问题。\n但这个事情并没有那么顺利。\n我先后尝试了两种方法：\n使用 PVEtools\n\n项目地址：github.com/ivanhak/pvetools\nPVEtools 有很多常用 pve 工具，可以快速配置 apt 源，并设置 PCI 硬件直通。其中就有核显直通功能。\n\n\n但是我在多次尝试后，发现并不如意，飞牛中一直未能显示出来 GPU。\n手动添加核显直通\n\n在 AI 帮助下，我直接在 PVE 终端中配置核显直通。\n主要就是通过安装 intel 核显驱动，然后配置 /etc/default/grub 文件进行。\n通过这种方式，我成功将 UHD 630 核显直通给了飞牛 OS。\n但却引发另一个问题 —— PVE 中无法管理飞牛了。在 PVE 面板中，无法连接飞牛虚拟机，一直提示 VM 100 qmp command 'set_password' failed - Could not set password.\n由于一直没能解决这个问题，后来我放弃使用虚拟机，重新在物理机上安装飞牛 OS。\n物理机安装飞牛OS\n\n物理机…",
          "link": "https://lawtee.com/article/pve-fnos/",
          "publishedOn": "2025-08-16T07:30:00.000Z",
          "wordCount": 297,
          "title": "飞牛 OS 到底是选物理机安装还是虚拟机安装",
          "imageUrl": "https://lawtee.com/article/pve-fnos/0.webp"
        },
        {
          "id": "https://lawtee.com/article/epson-st190e/",
          "author": null,
          "description": "接上一篇 群晖、迷你主机还是捡垃圾，家用NAS怎么选 ，在决定采用爱普生 ST190E 作为 NAS 主机之后，我便开始查找配件，进行组装。本文是我组装这台 NAS 迷你主机的一些简单经历。\n为什么选择爱普生 ST190E\n\n在上一篇已经讲过，这台主机整体是由和硕（华硕）代工，品质上与传统商用“御三家”没啥区别。\n之所以选爱普生，没选 ThinkCentre 或 Optiplex 的主要原因是这台小主机默认支持两个 SATA 盘位（几乎是唯一选择），并内置一个 M.2 固态盘位。此外，如果极限一点还可以通过 M.2 无线网卡接口（与 M.2 固态硬盘不是同一种接口），用转接线再接一个 SATA 口的固态硬盘。在目前主流洋垃圾里边，可以说特色鲜明了。\n功耗方面，官方标称理论最大功耗 102W（配备最高规格处理器加插满外设），正常最大配置时为 80W，正常使用一般 6.4W，待机 1W。我实测添加网口、两个HDD、两条内存、1个 M.2 SSD的情况下，安装飞牛后，运行功耗为 9.7W。\n优势\n\n两个 SATA 盘位可以组 RAID 1，显著提高了 NAS 存储的安全性。\nSATA 接口通常使用机械硬盘，在成本控制方面相比全闪方案更加实惠。\n机械硬盘如果出故障，一般都还能抢救，固态硬盘出故障就全崩了。\n2.5 寸机械硬盘相比 3.5 寸的盘，功耗大概只有 1/3-1/4，两个盘加起来也不到 5W。\n整机规格7.5×18×20cm，相比主流迷你主机外形稍大，内部体积达到 2L，有显著散热优势。\n劣势\n\n这种迷你机箱只能支持 2.5 寸硬盘，读写速度比 3.5 寸的要慢些，一般只能到 90MB/s。\n机箱成本：270 元（不带电源、内存、CPU、硬盘）。\n如何为爱普生 ST190E 挑选配件\n\n在了解这台主机大致情况后，配件选择就相对容易了。\nCPU 选择\n\n爱普生 ST190E …",
          "link": "https://lawtee.com/article/epson-st190e/",
          "publishedOn": "2025-08-11T04:00:00.000Z",
          "wordCount": 317,
          "title": "2025 年，组装一台 8 代英特尔的洋垃圾 NAS 迷你主机爱普生 EPSON ST190E",
          "imageUrl": "https://lawtee.com/article/epson-st190e/0.webp"
        }
      ]
    },
    {
      "title": "Rss Feed - 苏洋博客",
      "feedUrl": "https://soulteary.com/feed/",
      "siteUrl": "https://soulteary.com/feed/",
      "articles": []
    },
    {
      "title": "运维咖啡吧",
      "feedUrl": "https://blog.ops-coffee.cn/feed.xml",
      "siteUrl": "https://blog.ops-coffee.com/atom.xml",
      "articles": [
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day59-rv-life-cost-summary.html",
          "author": null,
          "description": "昨天离开了江西，进入浙江开化县，体验小城生活后，连夜赶回上海。文章记录了从开化到上海的最后一站，分享了自驾经历、花费和房车使用心得。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day59-rv-life-cost-summary.html",
          "publishedOn": "2025-10-17T05:21:37.000Z",
          "wordCount": 112,
          "title": "久违的暑假｜一人一车沿海自驾两个月总结",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day58-quzhou-kaihua.html",
          "author": null,
          "description": "探索开化县，一个宁静的小城，体验根雕艺术和开化纸的历史，漫步马金溪畔，欣赏自然美景和独特建筑，享受一场远离喧嚣的旅行。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day58-quzhou-kaihua.html",
          "publishedOn": "2025-10-16T05:35:40.000Z",
          "wordCount": 117,
          "title": "久违的暑假｜沿海自驾DAY58 - 开化",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day57-shangrao-sanqingshan.html",
          "author": null,
          "description": "本次沿海自驾的第57天，挑战难度极大的三清山徒步。从外双溪索道开始，历经西海岸、阳光海岸、南清园等景区，感受三清山的壮丽与秀美，体验高空栈道的惊险与震撼。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day57-shangrao-sanqingshan.html",
          "publishedOn": "2025-10-15T03:56:56.000Z",
          "wordCount": 133,
          "title": "久违的暑假｜沿海自驾DAY57 - 三清山",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day56-shangrao-xinjiang.html",
          "author": null,
          "description": "从鹰潭到上饶的沿海自驾之旅，体验龙潭湖公园的宁静与美丽，品尝当地美食如黄老头小炒黄牛肉，参观上饶博物馆和双塔公园，感受江西的自然与文化魅力。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day56-shangrao-xinjiang.html",
          "publishedOn": "2025-10-14T05:55:59.000Z",
          "wordCount": 120,
          "title": "久违的暑假｜沿海自驾DAY56 - 上饶",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day55-yingtan-longhushan.html",
          "author": null,
          "description": "从江西抚州到鹰潭的自驾之旅，探索了龙虎山的道教文化，游览了上清古镇，品尝了地道的牛骨粉，体验了不一样的江西风情。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day55-yingtan-longhushan.html",
          "publishedOn": "2025-10-13T06:40:28.000Z",
          "wordCount": 117,
          "title": "久违的暑假｜沿海自驾DAY55 - 鹰潭",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day54-fuzhou-wenchangli.html",
          "author": null,
          "description": "本文记录了沿海自驾游第54天在抚州的行程，参观了抚州博物馆、文昌里历史文化街区，品尝了江西特色米粉，体验了抚州的历史文化魅力。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day54-fuzhou-wenchangli.html",
          "publishedOn": "2025-10-12T08:16:10.000Z",
          "wordCount": null,
          "title": "久违的暑假｜沿海自驾DAY54 - 抚州",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day53-ganzhou-bajing.html",
          "author": null,
          "description": "赣州Day53旅行记，探索福寿沟博物馆、赣州古城墙、郁孤台等地标，体验赣南客家文化，记录一家三口的愉快旅程。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day53-ganzhou-bajing.html",
          "publishedOn": "2025-10-11T08:48:48.000Z",
          "wordCount": 129,
          "title": "久违的暑假｜沿海自驾DAY53 - 赣州",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day52-ganzhou-bowuguan.html",
          "author": null,
          "description": "在2025暑假沿海自驾游的第52天，作者从梅关古道来到赣州，探索了赣州博物馆和江南宋城，体验了赣州的历史文化和美食，与家人共享旅程的温馨。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day52-ganzhou-bowuguan.html",
          "publishedOn": "2025-10-10T07:01:58.000Z",
          "wordCount": 115,
          "title": "久违的暑假｜沿海自驾DAY52 - 相聚",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day51-ganzhou-dayu-meiguan.html",
          "author": null,
          "description": "在2025年暑假的第五十一天，作者探索了梅关古道，体验了古代交通要道的历史和文化，同时欣赏了赣州和大余县的自然与人文景观。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day51-ganzhou-dayu-meiguan.html",
          "publishedOn": "2025-10-09T09:09:42.000Z",
          "wordCount": 133,
          "title": "久违的暑假｜沿海自驾DAY51 - 大余",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day50-shaoguan-renhua.html",
          "author": null,
          "description": "从丹霞山出发，探访仁化县城与南雄市，体验锦江美景、古镇风情及美食，感受粤港澳大湾区的独特魅力。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day50-shaoguan-renhua.html",
          "publishedOn": "2025-09-30T03:58:16.000Z",
          "wordCount": 119,
          "title": "久违的暑假｜沿海自驾DAY50 - 仁化",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day49-shaoguan-danxiashan.html",
          "author": null,
          "description": "探索丹霞山的核心景区——阳元石与长老峰，体验云崖栈道、九九天梯的惊险，欣赏嘉遁亭与观日亭的壮丽风景，感受大自然的鬼斧神工。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day49-shaoguan-danxiashan.html",
          "publishedOn": "2025-09-29T07:13:18.000Z",
          "wordCount": 157,
          "title": "久违的暑假｜沿海自驾DAY49 - 丹霞山",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day48-shaoguan-shaoyanglou.html",
          "author": null,
          "description": "探索韶关的美丽风光，从韶阳楼的壮丽景色到丹霞山的自然奇观，感受韶关的历史文化和独特魅力。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day48-shaoguan-shaoyanglou.html",
          "publishedOn": "2025-09-28T02:11:49.000Z",
          "wordCount": 119,
          "title": "久违的暑假｜沿海自驾DAY48 - 韶阳楼",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day47-shaoguan-fengcai.html",
          "author": null,
          "description": "在韶关自驾游的第47天，探索了马坝人石峡遗址和百年东街。深入了解马坝人的历史，欣赏韶关的自然美景和文化遗产，感受韶关的独特魅力。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day47-shaoguan-fengcai.html",
          "publishedOn": "2025-09-27T05:38:46.000Z",
          "wordCount": 131,
          "title": "久违的暑假｜沿海自驾DAY47 - 韶关",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day46-qingyuan-beijiang.html",
          "author": null,
          "description": "从英德出发，沿北江一路自驾至韶关，途经G240国道和020乡道，欣赏北江画卷与喀斯特地貌的壮丽景色，体验京广铁路的繁忙与北江的宁静。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day46-qingyuan-beijiang.html",
          "publishedOn": "2025-09-26T04:00:57.000Z",
          "wordCount": 119,
          "title": "久违的暑假｜沿海自驾DAY46 - 北江",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day45-qingyuan-yingde.html",
          "author": null,
          "description": "2025暑期沿海自驾游的第45天，沿北江行驶，途经清远、英德，探索上岳古村，欣赏岭南建筑，体验G240国道的北江画卷美景，记录了一段难忘的自驾旅程。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day45-qingyuan-yingde.html",
          "publishedOn": "2025-09-25T05:04:30.000Z",
          "wordCount": 117,
          "title": "久违的暑假｜沿海自驾DAY45 - 英德",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day44-qingyuan-fogang.html",
          "author": null,
          "description": "在佛冈县的上岳古村，探索了具有深厚文化底蕴的岭南古村落，感受了朱熹后裔的历史传承。随后在民安小镇体验了当地生活，等待台风的到来，度过了一个宁静的夜晚。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day44-qingyuan-fogang.html",
          "publishedOn": "2025-09-24T04:48:42.000Z",
          "wordCount": 117,
          "title": "久违的暑假｜沿海自驾DAY44 - 佛冈",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day43-guangzhou-zhujiang.html",
          "author": null,
          "description": "沿海自驾Day43，探访广州珠江沿岸与沙面岛，欣赏广州塔与海心沙的独特城市天际线，感受沙面岛的历史文化氛围，体验广州的历史与现代交融之美。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day43-guangzhou-zhujiang.html",
          "publishedOn": "2025-09-23T09:40:18.000Z",
          "wordCount": 125,
          "title": "久违的暑假｜沿海自驾DAY43 - 广州",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day42-dongguan-songshanhu.html",
          "author": null,
          "description": "从深圳到广州的自驾旅程，雨中游览松山湖，错过华为欧洲小镇，与久违的广州朋友聚会，享受温暖的情谊与旅途中的每一刻。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day42-dongguan-songshanhu.html",
          "publishedOn": "2025-09-22T04:12:35.000Z",
          "wordCount": 111,
          "title": "久违的暑假｜沿海自驾DAY42 - 东莞",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day41-shenzhen-tiezaishan.html",
          "author": null,
          "description": "在深圳体验了一场美妙的早茶，品尝了繁楼的多款广式点心，随后与朋友一起轻松爬上铁仔山，俯瞰深圳的城市风光，感受这座年轻城市的活力与包容。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day41-shenzhen-tiezaishan.html",
          "publishedOn": "2025-09-21T08:14:15.000Z",
          "wordCount": 116,
          "title": "久违的暑假｜沿海自驾DAY41 - 情谊",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day40-shenzhen-shenzhenwan.html",
          "author": null,
          "description": "探索深圳湾公园的美丽沿海徒步路线，体验红树林的生态环境，观察候鸟迁徙，乘坐双层巴士游览城市风光，感受深圳的独特魅力。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day40-shenzhen-shenzhenwan.html",
          "publishedOn": "2025-09-20T11:14:01.000Z",
          "wordCount": 118,
          "title": "久违的暑假｜沿海自驾DAY40 - 深圳",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day39-shenzhen-meirenyu.html",
          "author": null,
          "description": "在2025年暑假的沿海自驾游中，作者来到了深圳大鹏半岛，徒步前往鹿嘴山庄，探索了周星驰拍摄美人鱼的地点，体验了深圳壮丽的沿海风光和清澈的海水。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day39-shenzhen-meirenyu.html",
          "publishedOn": "2025-09-19T04:51:08.000Z",
          "wordCount": 121,
          "title": "久违的暑假｜沿海自驾DAY39 - 美人鱼",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day38-shenzhen-pengcheng.html",
          "author": null,
          "description": "在深圳大亚湾与较场尾的探索中，体验了一次轮胎爆胎的插曲，探索了大鹏所城和东山古寺的历史，感受了海边民宿的独特魅力，以及如何在旅途中坦然面对突发状况。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day38-shenzhen-pengcheng.html",
          "publishedOn": "2025-09-18T03:50:27.000Z",
          "wordCount": 118,
          "title": "久违的暑假｜沿海自驾DAY38 - 鹏城",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day37-huizhou-dayawan-tangping.html",
          "author": null,
          "description": "本文记录了2025暑假沿海自驾游的第37天，探访了巽寮湾、稔山镇和大亚湾，体验了市井气息的稔山市场，探索了大亚湾的美丽海岸线，并了解了惠州的海景房和躺平文化。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day37-huizhou-dayawan-tangping.html",
          "publishedOn": "2025-09-17T05:38:39.000Z",
          "wordCount": 124,
          "title": "久违的暑假｜沿海自驾DAY37 - 躺平",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day36-huizhou-shuangyuewan-chonglang.html",
          "author": null,
          "description": "探索惠州双月湾的红海湾，感受其风浪与自然之美，体验冲浪乐趣，游览海龟湾及双月湾观景台，尽享沿海自驾的乐趣与美景。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day36-huizhou-shuangyuewan-chonglang.html",
          "publishedOn": "2025-09-16T03:19:22.000Z",
          "wordCount": 121,
          "title": "久违的暑假｜沿海自驾DAY36 - 冲浪",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day35-huizhou-shuangyuewan.html",
          "author": null,
          "description": "在金町湾的细沙滩上漫步，探索双月湾的美丽晚霞和海鲜美食。享受夏日沿海自驾游的宁静与美好，体验金町湾和双月湾的独特魅力。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day35-huizhou-shuangyuewan.html",
          "publishedOn": "2025-09-15T04:15:11.000Z",
          "wordCount": 122,
          "title": "久违的暑假｜沿海自驾DAY35 - 双月湾",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day34-shanwei-ermalu.html",
          "author": null,
          "description": "2025年夏季沿海自驾游第34天，探索汕尾的红海湾与品清湖，感受蓝天白云下的美丽海滩，体验汕尾的美食文化，尤其是二马路美食街的丰富选择。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day34-shanwei-ermalu.html",
          "publishedOn": "2025-09-14T05:11:55.000Z",
          "wordCount": 125,
          "title": "久违的暑假｜沿海自驾DAY34 - 汕尾",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day33-shanwei-honghaiwan.html",
          "author": null,
          "description": "在汕尾红海湾体验透明纯净的玻璃海，探访海边路咖啡一条街，打卡海上古堡与南海观世音景区，感受遮浪城隍庙的文化氛围，享受宁静的海滩时光。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day33-shanwei-honghaiwan.html",
          "publishedOn": "2025-09-13T04:04:56.000Z",
          "wordCount": 122,
          "title": "久违的暑假｜沿海自驾DAY33 - 红海湾",
          "imageUrl": null
        },
        {
          "id": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day32-shanwei-bolihai.html",
          "author": null,
          "description": "2025年暑假沿海自驾游第32天，探索汕尾红海湾与玻璃海，体验风车岛的独特风光，欣赏连岛路的美丽景色，感受后澳玻璃海的清澈与宁静。",
          "link": "https://blog.ops-coffee.com/r/2025-summer-coastal-road-trip-day32-shanwei-bolihai.html",
          "publishedOn": "2025-09-12T04:41:33.000Z",
          "wordCount": 123,
          "title": "久违的暑假｜沿海自驾DAY32 - 玻璃海",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Jimmy Song – 博客",
      "feedUrl": "https://jimmysong.io/blog/index.xml",
      "siteUrl": "https://jimmysong.io/blog/",
      "articles": [
        {
          "id": "https://jimmysong.io/blog/agentic-design-patterns-intro/",
          "author": "Jimmy Song",
          "description": "分享我翻译的《Agentic Design Patterns》，书中涵盖了全面的智能体设计模式，配有示例与图片，适合智能体爱好者学习；本文介绍阅读建议并提供 PDF 下载。",
          "link": "https://jimmysong.io/blog/agentic-design-patterns-intro/",
          "publishedOn": "2025-10-12T12:07:50.000Z",
          "wordCount": 775,
          "title": "智能体设计模式：Agentic Design Patterns 中文版电子书分享",
          "imageUrl": "https://assets.jimmysong.io/images/blog/agentic-design-patterns-intro/banner.webp"
        },
        {
          "id": "https://jimmysong.io/blog/civilizational-differences-china-japan-films/",
          "author": "Jimmy Song",
          "description": "为什么中国历史上频繁发生内部运动与自我毁灭，而日本则不断发动对外战争？从《武训传》和《七武士》两部电影的时代对照，看中日文明的深层动能差异。",
          "link": "https://jimmysong.io/blog/civilizational-differences-china-japan-films/",
          "publishedOn": "2025-10-09T04:08:40.000Z",
          "wordCount": 687,
          "title": "内斗与外侵：从《武训传》与《七武士》看中日文明的分野",
          "imageUrl": "https://assets.jimmysong.io/images/blog/civilizational-differences-china-japan-films/banner.webp"
        },
        {
          "id": "https://jimmysong.io/blog/ai-resources-rank-update/",
          "author": "Jimmy Song",
          "description": "探索 AI 资源库更新，收录超 500 个项目，新增评分系统与展示优化，助您高效筛选优质 AI 项目。",
          "link": "https://jimmysong.io/blog/ai-resources-rank-update/",
          "publishedOn": "2025-10-05T04:09:16.000Z",
          "wordCount": null,
          "title": "AI 资源库更新：收录项目超 500 个，新增评分与展示优化",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/ai-native-era-beginning/",
          "author": "Jimmy Song",
          "description": "深入分析 AI 原生时代下云原生企业的转型路径，探讨生成式 AI 对行业的影响与未来趋势。",
          "link": "https://jimmysong.io/blog/ai-native-era-beginning/",
          "publishedOn": "2025-10-01T06:59:47.000Z",
          "wordCount": null,
          "title": "云原生企业转型：AI 原生时代的深度解析",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/web-automation-advancement/",
          "author": "Jimmy Song",
          "description": "Chrome DevTools MCP 与 Playwright MCP 的推出标志着前端开发自动化进入新阶段，AI 助手能够更深层次地控制和调试浏览器，为开发者带来前所未有的自动化体验。",
          "link": "https://jimmysong.io/blog/web-automation-advancement/",
          "publishedOn": "2025-09-25T02:01:57.000Z",
          "wordCount": null,
          "title": "Chrome DevTools MCP：前端开发自动化又上了一个新台阶",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/github-gitcoin-fund-phishing-2025/",
          "author": "Jimmy Song",
          "description": "以我近期遭遇的“GitHub × Gitcoin Developer Fund 2025”钓鱼为案例，系统分析其利益驱动、完整链条、技术实现与个人/组织的防御与应急 SOP。",
          "link": "https://jimmysong.io/blog/github-gitcoin-fund-phishing-2025/",
          "publishedOn": "2025-09-22T02:08:57.000Z",
          "wordCount": null,
          "title": "新型 GitHub 资助申请诈骗全解析：利益链条、作案流程、技术实现与防御",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/verdent-first-impression/",
          "author": "Jimmy Song",
          "description": "探索 Verdent AI 编程助手在 VS Code 的使用体验，了解其独特功能与改进空间，助力开发者在 AI 时代更高效成长。",
          "link": "https://jimmysong.io/blog/verdent-first-impression/",
          "publishedOn": "2025-09-21T03:12:27.000Z",
          "wordCount": null,
          "title": "试用 Verdent 的一些感受：一款支持 Subagent 的 AI 编程助手",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/agentic-design-patterns-review/",
          "author": "Jimmy Song",
          "description": "探索智能体设计的 21 种模式，提升 AI 系统的自主性与效率，助力开发者应对复杂挑战。",
          "link": "https://jimmysong.io/blog/agentic-design-patterns-review/",
          "publishedOn": "2025-09-13T12:56:37.000Z",
          "wordCount": null,
          "title": "智能体的 21 种设计模式总结：Agentic Design Patterns 书评",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/ospo-2025-report-cn-analysis/",
          "author": "Jimmy Song",
          "description": "OSPO 已从合规与安全部门，演变为 AI 原生时代企业治理与创新的战略中枢。本文解析 2025 年 Linux Foundation 报告，并结合中国头部企业的开源实践，展望 OSPO 在中国的发展机遇。",
          "link": "https://jimmysong.io/blog/ospo-2025-report-cn-analysis/",
          "publishedOn": "2025-09-12T09:40:38.000Z",
          "wordCount": null,
          "title": "AI 原生时代的 OSPO：从全球报告看中国企业的新机遇",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/system-initiative-ai-native-infra/",
          "author": "Jimmy Song",
          "description": "System Initiative 通过 AI 代理与数字孪生技术，推动基础设施自动化进入新阶段。本文系统梳理其技术架构、产品特性及团队背景，帮助读者理解 AI Native Infra 的创新实践与未来趋势。",
          "link": "https://jimmysong.io/blog/system-initiative-ai-native-infra/",
          "publishedOn": "2025-09-12T08:07:16.000Z",
          "wordCount": null,
          "title": "System Initiative 深度调研报告：AI Native 基础设施的探索",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/thinking-devrel/",
          "author": "Jimmy Song",
          "description": "探索成功的开发者关系策略，了解 DevRel 团队结构与关键角色，助力开发者社区的真实参与与业务增长。",
          "link": "https://jimmysong.io/blog/thinking-devrel/",
          "publishedOn": "2025-09-10T10:53:11.000Z",
          "wordCount": null,
          "title": "精通 DevRel：开发者关系成功策略",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/devrel-role-evolution-and-value/",
          "author": "Jimmy Song",
          "description": "结合 Linux Foundation 发起 DevRel Foundation 的契机，系统解析 DevRel 的角色、组织位置、价值与度量，结合 CNCF Ambassador 实践与个人反思，并给出适用企业决策树与职业路径图。",
          "link": "https://jimmysong.io/blog/devrel-role-evolution-and-value/",
          "publishedOn": "2025-09-10T07:45:00.000Z",
          "wordCount": null,
          "title": "开发者关系的演变与价值：从个人实践到 DevRel Foundation",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/bilibili-index-tts-introduction/",
          "author": "Jimmy Song",
          "description": "探索工业级可控零样本文本到语音系统 Index TTS，精准控制语音时长与情感，重塑语音合成的未来。",
          "link": "https://jimmysong.io/blog/bilibili-index-tts-introduction/",
          "publishedOn": "2025-09-10T01:10:07.000Z",
          "wordCount": null,
          "title": "语音合成的未来已来：深入探索工业级可控零样本文本到语音系统 Index TTS！",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/pdf-to-markdown-open-source-deep-dive/",
          "author": "Jimmy Song",
          "description": "深入探讨开源 PDF 转 Markdown 工具，比较 Dolphin、MarkItDown、MinerU 和 Marker 的功能与优缺点，助您选择最佳解决方案。",
          "link": "https://jimmysong.io/blog/pdf-to-markdown-open-source-deep-dive/",
          "publishedOn": "2025-09-09T07:41:18.000Z",
          "wordCount": null,
          "title": "深度调研开源 PDF 转 Markdown 工具：Marker、MinerU 与替代方案",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/ai-ide-factions-and-vibe-coding/",
          "author": "Jimmy Song",
          "description": "探索 AI IDE 的关键分野，了解规格驱动、模式设计与云端联动如何影响开发者的选择与工程落地。",
          "link": "https://jimmysong.io/blog/ai-ide-factions-and-vibe-coding/",
          "publishedOn": "2025-09-07T06:16:49.000Z",
          "wordCount": null,
          "title": "AI IDE 的关键分野：Spec、模式、云端与模型选择",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/e2b-browserbase-report/",
          "author": "Jimmy Song",
          "description": "探索云端智能体基础设施新纪元，深入分析 E2B 与 Browserbase 的技术架构与全球趋势，助力 AI Agent 的未来发展。",
          "link": "https://jimmysong.io/blog/e2b-browserbase-report/",
          "publishedOn": "2025-09-03T09:16:04.000Z",
          "wordCount": null,
          "title": "云端智能体基础设施新纪元：E2B 与 Browserbase 深度调研与全球趋势分析",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/kubernetes-ai-native/",
          "author": "Jimmy Song",
          "description": "探讨 Kubernetes 在 AI Native 时代面临的挑战，以及如何从 Cloud Native 迈向 AI Native，实现平台的持续相关性。",
          "link": "https://jimmysong.io/blog/kubernetes-ai-native/",
          "publishedOn": "2025-09-03T03:15:27.000Z",
          "wordCount": null,
          "title": "Kubernetes 在 AI Native 时代的挑战与转型",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/vibe-coding-tools-comparison/",
          "author": "Jimmy Song",
          "description": "本文作为《AI 编程与氛围编程工具研究》的姊妹篇，全面补充当前市面上主流与新兴的氛围编程工具对比，包括独立 IDE、IDE 插件以及终端/CLI 工具，分析其开源程度、Agent 能力、模型接入方式与典型应用场景。",
          "link": "https://jimmysong.io/blog/vibe-coding-tools-comparison/",
          "publishedOn": "2025-09-02T06:59:30.000Z",
          "wordCount": null,
          "title": "氛围编程工具全景对比：从插件到 IDE、从终端到 Agent",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/hugo-mcp-server-vscode/",
          "author": "Jimmy Song",
          "description": "详细介绍如何开发一个 Hugo 网站的 MCP Server，深入解析 MCP 协议、工具注册机制、内容类型识别、智能 slug 生成等核心技术，并展示与 VS Code 的集成方案。",
          "link": "https://jimmysong.io/blog/hugo-mcp-server-vscode/",
          "publishedOn": "2025-09-01T11:27:39.000Z",
          "wordCount": null,
          "title": "Hugo Website MCP Server：打造智能博客内容生成脚手架并集成 VS Code",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/kubernetes-ai-oss-solo/",
          "author": "Jimmy Song",
          "description": "探索 Solo.io 开源项目如何助力 Kubernetes AI 应用，提升推理服务与自动化运维的能力，助你实现智能化转型。",
          "link": "https://jimmysong.io/blog/kubernetes-ai-oss-solo/",
          "publishedOn": "2025-09-01T03:35:09.000Z",
          "wordCount": null,
          "title": "Kubernetes AI 应用基础设施开源实践与创新：Solo.io 开源项目研究",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/markdown-wechat-publication/",
          "author": "Jimmy Song",
          "description": "本文分享开发将 Hugo 博客 Markdown 技术文章一键发布到微信公众号草稿的自动化工具的实践经验，涵盖整体架构设计、发布流程、微信平台格式适配、图片与代码处理、常见问题及定制化开发心得。",
          "link": "https://jimmysong.io/blog/markdown-wechat-publication/",
          "publishedOn": "2025-09-01T01:00:00.000Z",
          "wordCount": null,
          "title": "开发将 Markdown 一键发布到微信公众号草稿工具的经验分享",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/understanding-mcp/",
          "author": "Jimmy Song",
          "description": "深入理解 Model Context Protocol (MCP)，探索其在 AI 应用中的扩展能力，像 USB 一样简便的接口设计，助力开发者提升效率。",
          "link": "https://jimmysong.io/blog/understanding-mcp/",
          "publishedOn": "2025-08-28T06:00:00.000Z",
          "wordCount": null,
          "title": "深入理解 MCP：像 USB 一样的 AI 扩展协议",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/vs-code-copilot-vibe-coding-guide/",
          "author": "Jimmy Song",
          "description": "掌握 VS Code 与 GitHub Copilot 的高效开发技巧，提升你的编程体验与效率，开启愉快的 vibe coding 之旅。",
          "link": "https://jimmysong.io/blog/vs-code-copilot-vibe-coding-guide/",
          "publishedOn": "2025-08-25T08:46:37.000Z",
          "wordCount": null,
          "title": "使用 VS Code 与 GitHub Copilot 高效 Vibe Coding 指南",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/qoder-alibaba-ai-ide-personal-review/",
          "author": "Jimmy Song",
          "description": "从个人视角深度体验阿里巴巴最新推出的 Qoder AI IDE，探索 Agentic Coding 平台的革命性功能与发展前景。",
          "link": "https://jimmysong.io/blog/qoder-alibaba-ai-ide-personal-review/",
          "publishedOn": "2025-08-22T00:00:00.000Z",
          "wordCount": null,
          "title": "Qoder：阿里巴巴推出的 AI IDE，全方位了解其能力与未来",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/ai-native-software-delivery/",
          "author": "Jimmy Song",
          "description": "本文介绍我最近使用 AI 翻译的新书《AI 原生软件交付》，分享书中的核心观点与个人感受。",
          "link": "https://jimmysong.io/blog/ai-native-software-delivery/",
          "publishedOn": "2025-08-21T15:00:00.000Z",
          "wordCount": null,
          "title": "《AI 原生软件交付》读书笔记：用 AI 翻译的新书分享",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/ai-agent-translation/",
          "author": "Jimmy Song",
          "description": "AI Agent 自动化工作流让科技图书翻译效率提升十倍，详细介绍从人工到 AI 的转变、工作流设计与效率对比。",
          "link": "https://jimmysong.io/blog/ai-agent-translation/",
          "publishedOn": "2025-08-20T15:00:00.000Z",
          "wordCount": null,
          "title": "AI Agent 让科技图书翻译效率提升十倍",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/dark-mode-philosophy/",
          "author": "Jimmy Song",
          "description": "从视觉心理、产品体验和开发实践三个角度，分析暗色模式为什么逐渐成为默认设计范式，并结合美的美居和个人网站的真实场景探讨它的现实意义。",
          "link": "https://jimmysong.io/blog/dark-mode-philosophy/",
          "publishedOn": "2025-08-17T01:00:32.000Z",
          "wordCount": null,
          "title": "为什么我们越来越离不开暗色模式？——从视觉舒适到产品哲学的思考",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/big-data-stream-processing-vs-ai-agent/",
          "author": "Jimmy Song",
          "description": "对比大数据时代的流式数据处理与当下 AI 原生 Agent 工作流的异同，结合 Dataiku、IBM StreamSets 与 n8n 的最新动态进行案例分析与趋势判断，探讨技术演进与融合趋势。",
          "link": "https://jimmysong.io/blog/big-data-stream-processing-vs-ai-agent/",
          "publishedOn": "2025-08-15T06:00:00.000Z",
          "wordCount": null,
          "title": "从大数据流式处理到 AI 原生 Agent：以 Dataiku、StreamSets、n8n 为例的技术演进",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/n8n-deep-dive/",
          "author": "Jimmy Song",
          "description": "深入解析 n8n 的发展历程、技术架构、插件机制、扩展方式及企业级应用案例，评估其作为开源低代码 AI 工作流平台的优势与长期投资价值。",
          "link": "https://jimmysong.io/blog/n8n-deep-dive/",
          "publishedOn": "2025-08-15T01:45:00.000Z",
          "wordCount": null,
          "title": "n8n 深度分析：架构、插件机制与企业级应用案例",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/open-source-ai-agent-workflow-comparison/",
          "author": "Jimmy Song",
          "description": "对比 Coze Studio/Loop、n8n、Dify、FastGPT、RAGFlow、LangGraph、Fabric 等开源 AI Agent 与工作流平台，从功能定位、生态扩展、自托管能力、许可证限制、社区活跃度等维度全面分析，并重点探讨在这些工具中选择长期投入平台的参考依据。",
          "link": "https://jimmysong.io/blog/open-source-ai-agent-workflow-comparison/",
          "publishedOn": "2025-08-14T14:25:44.000Z",
          "wordCount": null,
          "title": "开源 AI Agent 与工作流平台全景对比分析",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/embedding-atlas-experience/",
          "author": "Jimmy Song",
          "description": "最近发现了 Apple 开源的 Embedding Atlas 项目，结合自己的网站 RAG 测试，体验了数据可视化和检索的强大功能。",
          "link": "https://jimmysong.io/blog/embedding-atlas-experience/",
          "publishedOn": "2025-08-10T02:00:00.000Z",
          "wordCount": null,
          "title": "发现 Embedding Atlas：网站数据可视化与检索新体验",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/china-ev-rise/",
          "author": "Jimmy Song",
          "description": "为什么中国电动车发展得如此激进？从国家政策、产业环境到国际竞争，中国新能源汽车产业正在经历怎样的变革与挑战？",
          "link": "https://jimmysong.io/blog/china-ev-rise/",
          "publishedOn": "2025-08-09T04:00:00.000Z",
          "wordCount": null,
          "title": "中国电动汽车的激进崛起：政策驱动、产业变革与全球竞争",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/manus-to-genspark/",
          "author": "Jimmy Song",
          "description": "基于 Manus 的早期体验与 Genspark AI Slide 幻灯片生成功能最新试用，深入分析这类多智能体工具的能力边界、价值亮点及改进方向。",
          "link": "https://jimmysong.io/blog/manus-to-genspark/",
          "publishedOn": "2025-08-09T02:00:00.000Z",
          "wordCount": null,
          "title": "从 Manus 到 Genspark：多智能体协作工具的潜力与盲区",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/rag-handbook-release/",
          "author": "Jimmy Song",
          "description": "详细介绍我新编写的《RAG 实践手册》以及配套的开源示例项目 rag-chatbot，该聊天机器人已部署在我的网站上，基于 Cloudflare Workers 运行。",
          "link": "https://jimmysong.io/blog/rag-handbook-release/",
          "publishedOn": "2025-08-07T13:00:00.000Z",
          "wordCount": null,
          "title": "发布《RAG 实践手册》：构建基于 Cloudflare 和千问大模型的智能聊天机器人",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/hugo-book-pdf-exporter/",
          "author": "Jimmy Song",
          "description": "介绍如何用 Hugo 构建的 Markdown 图书导出为专业 PDF，包括多语言、Emoji 渲染、代码高亮、图片处理、章节排序、封面自定义等关键技术，并简述 PDF Book Exporter 的架构与使用方法，适用于技术文档和电子书出版。",
          "link": "https://jimmysong.io/blog/hugo-book-pdf-exporter/",
          "publishedOn": "2025-08-06T13:00:00.000Z",
          "wordCount": null,
          "title": "出版级 PDF 电子书导出工具分享：将 Hugo Markdown 图书导出为 PDF",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/uninstalling-wisprflow/",
          "author": "Jimmy Song",
          "description": "试用 WisprFlow 语音识别工具一周后的真实体验：服务不稳定、非实时识别、指令识别错乱、占用空间大、性价比低——我为什么选择卸载它。",
          "link": "https://jimmysong.io/blog/uninstalling-wisprflow/",
          "publishedOn": "2025-08-03T02:00:00.000Z",
          "wordCount": null,
          "title": "WisprFlow 被严重高估了：试用一周后我选择卸载",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/json-prompt-3d-icon/",
          "author": "Jimmy Song",
          "description": "以生成 Jelly 风格 3D 图标为例，深入解析 JSON Prompt 的写法与最佳实践，让你的 AI 输出更精准、更高效。",
          "link": "https://jimmysong.io/blog/json-prompt-3d-icon/",
          "publishedOn": "2025-08-03T02:00:00.000Z",
          "wordCount": null,
          "title": "用 JSON Prompt 构建 3D 图标：结构化提示词的强大实践",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/cline-ai-funding/",
          "author": "Jimmy Song",
          "description": "开源 AI 编码工具 Cline 完成 3200 万美元融资，凭借透明定价和无约束模型使用迅速崛起。本文解析其成功秘诀及对 AI 编码行业的深远影响。",
          "link": "https://jimmysong.io/blog/cline-ai-funding/",
          "publishedOn": "2025-08-01T06:27:13.000Z",
          "wordCount": null,
          "title": "Cline 获 3200 万美元融资，AI 编码新时代来袭！",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/kubesphere-opensource-exit/",
          "author": "Jimmy Song",
          "description": "青云宣布 KubeSphere 暂停开源版支持，引发社区强烈反响。这篇文章从开源参与者的视角出发，理性分析其背后的动因与影响，并呼吁以更成熟的方式应对企业开源项目的生命周期变化。",
          "link": "https://jimmysong.io/blog/kubesphere-opensource-exit/",
          "publishedOn": "2025-08-01T02:30:00.000Z",
          "wordCount": null,
          "title": "理解 KubeSphere 的“转身”，但遗憾它没有好好告别",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/launch-ai-resource-page/",
          "author": "Jimmy Song",
          "description": "我在 jimmysong.io 上线了一个全新的 AI 页面，精选收录了面向开发者的优质教程、开源项目、工具与产品，支持中英文、标签分类、GitHub 评论，持续更新中，欢迎探索人工智能的无限可能。",
          "link": "https://jimmysong.io/blog/launch-ai-resource-page/",
          "publishedOn": "2025-07-28T12:50:00.000Z",
          "wordCount": null,
          "title": "打造你的 AI 能力图谱：我上线了一个开发者专属的人工智能资源库",
          "imageUrl": null
        },
        {
          "id": "https://jimmysong.io/blog/ai-coding-and-vibe-tools-research/",
          "author": "Jimmy Song",
          "description": "本文详细分析了当前主流的 AI 编程工具和氛围编程平台，包括 IDE 类、CLI 类和应用生成平台三大类别，帮助开发者选择合适的工具。",
          "link": "https://jimmysong.io/blog/ai-coding-and-vibe-tools-research/",
          "publishedOn": "2025-07-25T04:00:00.000Z",
          "wordCount": null,
          "title": "当前 AI 编程与氛围编程工具研究报告",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Ops doesn't need to work overtime~",
      "feedUrl": "https://nops.icu/feed/",
      "siteUrl": "/",
      "articles": [
        {
          "id": "https://nops.icu/archives/219/",
          "author": "季兴",
          "description": "两三年前，无意刷到“杨旭游记”视频，独特的房车旅游形式，杨旭操着一口京腔娓娓道来，主人公大多数是自己。从祖国的边陲到非洲的角落，偶尔在寒暑假有他女儿客串。从一个人穿越500公里无人区，在石油小镇...",
          "link": "https://nops.icu/archives/219/",
          "publishedOn": "2025-09-09T06:54:00.000Z",
          "wordCount": 520,
          "title": "买房车前建议你租一天",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "卡瓦邦噶！",
      "feedUrl": "https://www.kawabangga.com/feed/",
      "siteUrl": "https://www.kawabangga.com",
      "articles": [
        {
          "id": "https://www.kawabangga.com/?p=7048",
          "author": "laixintao",
          "description": "很久之前画重金买的阅读器是 A4 纸大小，无论是阅读电子书还是 paper 都很好。但是后来莫名其妙地屏幕部分 […]\nContinue reading...",
          "link": "https://www.kawabangga.com/posts/7048",
          "publishedOn": "2025-08-02T12:20:45.000Z",
          "wordCount": 1084,
          "title": "PDF 电子书重排和裁剪",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Derek Seaman's Tech Blog",
      "feedUrl": "https://www.derekseaman.com/feed/",
      "siteUrl": "https://www.derekseaman.com",
      "articles": [
        {
          "id": "https://www.derekseaman.com/?p=21145",
          "author": "Derek Seaman",
          "description": "Hot off the press is Proxmox Backup Server 4.0. PBS is a great tool to use with your Proxmox VE servers to do fast and easy backups of your VMs and LXCs. It’s very easy to setup, and can be deployed in a variety of forms: bare metal, VM or LXC.  Personally, I’ve deployed Proxmox […]",
          "link": "https://www.derekseaman.com/2025/08/proxmox-backup-server-pbs-4-0-blog-series.html",
          "publishedOn": "2025-08-21T19:44:45.000Z",
          "wordCount": 4254,
          "title": "Proxmox Backup Server (PBS) 4.0 Blog Series",
          "imageUrl": "https://www.derekseaman.com/wp-content/uploads/copilot_20250817_094613.jpeg"
        },
        {
          "id": "https://www.derekseaman.com/?p=20892",
          "author": "Derek Seaman",
          "description": "Many home labs have both Proxmox VE hosts (for running VMs and LXCs) as well as a Synology NAS. If you want to run Proxmox Backup Server on your Synology NAS as a VM, this post is for you. I’ll show you how to install PBS as VM on your NAS, as well as configure […]",
          "link": "https://www.derekseaman.com/2025/08/how-to-proxmox-backup-server-4-as-a-synology-vm.html",
          "publishedOn": "2025-08-17T23:28:33.000Z",
          "wordCount": 5103,
          "title": "How To: Proxmox Backup Server 4 as a Synology VM",
          "imageUrl": "https://www.derekseaman.com/wp-content/uploads/copilot_20250817_094613.jpeg"
        },
        {
          "id": "https://www.derekseaman.com/?p=20829",
          "author": "Derek Seaman",
          "description": "New to Proxmox Backup Server (PBS) 4.0 is a ‘tech preview’ feature for using S3 buckets as a datastore. While many people associate S3 buckets with Amazon, it is more or less a standard that many cloud providers support. This opens up many possibilities for direct PBS to cloud backups, which is great news. However, […]",
          "link": "https://www.derekseaman.com/2025/08/how-to-backblaze-b2-as-a-proxmox-backup-server-4-0-datastore.html",
          "publishedOn": "2025-08-17T21:32:37.000Z",
          "wordCount": 5403,
          "title": "How To: Backblaze B2 as a Proxmox Backup Server 4 S3 Datastore",
          "imageUrl": "https://www.derekseaman.com/wp-content/uploads/copilot_20250817_094613.jpeg"
        },
        {
          "id": "https://www.derekseaman.com/?p=20647",
          "author": "Derek Seaman",
          "description": "If you have a Synology NAS and want to use it with Proxmox Backup Server (PBS), you have two primary options for your datastore: NFS or an iSCSI LUN. If you want to use NFS storage, check out my previous article: How To: Setup Synology NFS for Proxmox Backup Server Datastore . However, the NFS datastore […]",
          "link": "https://www.derekseaman.com/2025/08/how-to-synology-iscsi-lun-for-proxmox-backup-server-datastore.html",
          "publishedOn": "2025-08-17T17:15:50.000Z",
          "wordCount": 5207,
          "title": "How To: Synology iSCSI LUN for Proxmox Backup Server Datastore",
          "imageUrl": "https://www.derekseaman.com/wp-content/uploads/copilot_20250817_094613.jpeg"
        },
        {
          "id": "https://www.derekseaman.com/?p=20775",
          "author": "Derek Seaman",
          "description": "This refreshed 2025 post covers using a Synology NAS NFS share as a datastore for Proxmox backups. Configuring a NFS share for the proper Proxmox Backup Server permissions can be quite challenging. The permissions requirements for PBS are different from just a basic NFS mount to a Proxmox VE host that you use for VE […]",
          "link": "https://www.derekseaman.com/2025/08/how-to-synology-nfs-for-proxmox-backup-server-datastore-2025.html",
          "publishedOn": "2025-08-17T16:47:41.000Z",
          "wordCount": 5129,
          "title": "How To: Synology NFS for Proxmox Backup Server Datastore (2025)",
          "imageUrl": "https://www.derekseaman.com/wp-content/uploads/copilot_20250817_094613.jpeg"
        },
        {
          "id": "https://www.derekseaman.com/?p=20537",
          "author": "Derek Seaman",
          "description": "In this article I will walk you through how to install Proxmox Backup Server (PBS) 4.0 inside of a VM running on Proxmox 9.0. You might be wondering why you might want to install PBS as a VM instead of a LXC. Good question! If you want to use iSCSI LUNs as a PBS datastore, […]",
          "link": "https://www.derekseaman.com/2025/08/how-to-proxmox-backup-server-4-vm-installation.html",
          "publishedOn": "2025-08-17T15:52:44.000Z",
          "wordCount": 7282,
          "title": "How To: Proxmox Backup Server 4 (VM) Installation",
          "imageUrl": "https://www.derekseaman.com/wp-content/uploads/copilot_20250817_094613.jpeg"
        }
      ]
    },
    {
      "title": "Ather Beg's Useful Thoughts",
      "feedUrl": "https://atherbeg.com/feed/",
      "siteUrl": "https://atherbeg.com",
      "articles": []
    },
    {
      "title": "Virtualization Howto",
      "feedUrl": "https://www.virtualizationhowto.com/feed/",
      "siteUrl": "https://www.virtualizationhowto.com/",
      "articles": [
        {
          "id": "https://www.virtualizationhowto.com/?p=303928",
          "author": "Brandon Lee",
          "description": "I continue to get more and more excited about the mini PC space and what is possible in the small form factor of computing. I am still rocking two MS-01’s…\nThe post Minisforum MS-02 Ultra Has Insane Home Lab Potential with 256GB RAM, Triple PCIe, and 25Gb Networking appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/minisforum-ms-02-ultra-has-insane-home-lab-potential-with-256gb-ram-triple-pcie-and-25gb-networking/",
          "publishedOn": "2025-10-20T12:27:14.000Z",
          "wordCount": 12187,
          "title": "Minisforum MS-02 Ultra Has Insane Home Lab Potential with 256GB RAM, Triple PCIe, and 25Gb Networking",
          "imageUrl": "https://www.virtualizationhowto.com/wp-content/uploads/2025/10/minisforum-ms-02-ultra-feat-3.png"
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303869",
          "author": "Brandon Lee",
          "description": "What are we talking about? Keep a home lab safe??? Well, it is easy to get carried away when you run a home lab. The whole point of having one…\nThe post How I Keep My Home Lab Safe While Experimenting with New Tools appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/how-i-keep-my-home-lab-safe-while-experimenting-with-new-tools/",
          "publishedOn": "2025-10-17T13:03:46.000Z",
          "wordCount": 14394,
          "title": "How I Keep My Home Lab Safe While Experimenting with New Tools",
          "imageUrl": "https://www.virtualizationhowto.com/wp-content/uploads/2025/10/Keep-Your-home-lab-safe.png"
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303843",
          "author": "Brandon Lee",
          "description": "There is no question that Terraform is my favorite infrastructure as code tool in the home lab for standing up infrastructure. Ansible is my favorite for configuration management. With Terraform,…\nThe post Best Terraform Modules for Home Labs in 2025 appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/best-terraform-modules-for-home-labs-in-2025/",
          "publishedOn": "2025-10-16T12:35:45.000Z",
          "wordCount": 14412,
          "title": "Best Terraform Modules for Home Labs in 2025",
          "imageUrl": "https://www.virtualizationhowto.com/wp-content/uploads/2025/10/Best-Terraform-modules.png"
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303824",
          "author": "Brandon Lee",
          "description": "We have exciting times to be able to run a home lab with all the automation, AI, and other tools available to us to use. In fact, I am more…\nThe post How I Built a Self-Healing Home Lab That Fixes Itself appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/how-i-built-a-self-healing-home-lab-that-fixes-itself/",
          "publishedOn": "2025-10-15T12:24:51.000Z",
          "wordCount": 12054,
          "title": "How I Built a Self-Healing Home Lab That Fixes Itself",
          "imageUrl": "https://www.virtualizationhowto.com/wp-content/uploads/2025/10/Self-healing-Home-Lab.png"
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303779",
          "author": "Brandon Lee",
          "description": "In case you haven’t seen the news, TrueNAS announced a new open beta of a new and exciting app called, TrueNAS Connect. It is a hosted, management interface that is…\nThe post TrueNAS Connect Open Beta Just Dropped and its A Game-Changer for Home and Enterprise NAS appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/truenas-connect-open-beta-just-dropped-and-its-a-game-changer-for-home-and-enterprise-nas/",
          "publishedOn": "2025-10-14T12:08:52.000Z",
          "wordCount": 14661,
          "title": "TrueNAS Connect Open Beta Just Dropped and its A Game-Changer for Home and Enterprise NAS",
          "imageUrl": "https://www.virtualizationhowto.com/wp-content/uploads/2025/10/TrueNAS-Connect-Beta.png"
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303726",
          "author": "Brandon Lee",
          "description": "I think all of us are looking for very cool tools that can add modern dashboards to Proxmox and to help monitor what is going on with your Proxmox host,…\nThe post This Free Tool Gives Proxmox the Monitoring Dashboard It Always Needed appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/this-free-tool-gives-proxmox-the-monitoring-dashboard-it-always-needed/",
          "publishedOn": "2025-10-13T12:14:16.000Z",
          "wordCount": 12119,
          "title": "This Free Tool Gives Proxmox the Monitoring Dashboard It Always Needed",
          "imageUrl": "https://www.virtualizationhowto.com/wp-content/uploads/2025/10/Pulse-proxmox-monitoring.png"
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303705",
          "author": "Brandon Lee",
          "description": "Every accomplishment in the home lab starts with curiosity about various technologies. That to me, is the spark that motivates all of us. We want to try new things, break…\nThe post Weekend Home Lab Challenges to Level Up Your Skills appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/weekend-home-lab-challenges-to-level-up-your-skills/",
          "publishedOn": "2025-10-10T12:41:51.000Z",
          "wordCount": 11108,
          "title": "Weekend Home Lab Challenges to Level Up Your Skills",
          "imageUrl": "https://www.virtualizationhowto.com/wp-content/uploads/2025/10/Weekend-Home-Lab-Challenges.png"
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303679",
          "author": "Brandon Lee",
          "description": "Linux is one of the best choices for self-hosting applications. It is generally very fast, lightweight, and lacks the bloat of other operating systems like Windows Server OS when it…\nThe post Best Lightweight Linux Distros for Home Server appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/best-lightweight-linux-distros-for-home-server/",
          "publishedOn": "2025-10-09T12:09:08.000Z",
          "wordCount": 11294,
          "title": "Best Lightweight Linux Distros for Home Server",
          "imageUrl": "https://www.virtualizationhowto.com/wp-content/uploads/2025/10/Lightweight-Linux-Distros.png"
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303659",
          "author": "Brandon Lee",
          "description": "There is no question that one of THE most important parts of your home lab is the networking component. Home labs are like real production environments. If the network is…\nThe post Home Lab Networking 101: VLANs, Subnets, and Segmentation for Beginners appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/home-lab-networking-101-vlans-subnets-and-segmentation-for-beginners/",
          "publishedOn": "2025-10-08T12:08:52.000Z",
          "wordCount": 11187,
          "title": "Home Lab Networking 101: VLANs, Subnets, and Segmentation for Beginners",
          "imageUrl": "https://www.virtualizationhowto.com/wp-content/uploads/2025/10/Home-Lab-Networking-101.png"
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303631",
          "author": "Brandon Lee",
          "description": "With most running Proxmox or leaning towards running Proxmox in the home lab for the foreseeable future, running Docker containers on top of a Proxmox environment is a given. Proxmox…\nThe post How to Run Docker on Proxmox the Right Way (and Avoid Common Mistakes) appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/how-to-run-docker-on-proxmox-the-right-way-and-avoid-common-mistakes/",
          "publishedOn": "2025-10-07T12:07:25.000Z",
          "wordCount": null,
          "title": "How to Run Docker on Proxmox the Right Way (and Avoid Common Mistakes)",
          "imageUrl": null
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303599",
          "author": "Brandon Lee",
          "description": "Backups are never the “fun” part of a home lab and honestly it may be one of the last things you think about. I know for me the most exciting…\nThe post Ultimate Home Lab Backup Strategy (2025 Edition) appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/ultimate-home-lab-backup-strategy-2025-edition/",
          "publishedOn": "2025-10-06T12:09:48.000Z",
          "wordCount": null,
          "title": "Ultimate Home Lab Backup Strategy (2025 Edition)",
          "imageUrl": null
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303528",
          "author": "Brandon Lee",
          "description": "When I say that my home lab has changed over the years, that is definitely an understatement. It has gone through several iterations of build outs. Most of the upgrades…\nThe post The 5 Home Lab Upgrades that Changed Everything for Me appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/the-5-home-lab-upgrades-that-changed-everything-for-me/",
          "publishedOn": "2025-10-03T12:32:49.000Z",
          "wordCount": null,
          "title": "The 5 Home Lab Upgrades that Changed Everything for Me",
          "imageUrl": null
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303531",
          "author": "Brandon Lee",
          "description": "I have been playing around with and using OPNsense for a while now and it is a rock solid open-srouce firewall that can do just about anything you want to…\nThe post The OPNsense Plugin You Must Install in 2025: Zenarmor Guide & Review appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/the-opnsense-plugin-you-must-install-in-2025-zenarmor-guide-review/",
          "publishedOn": "2025-10-02T13:10:36.000Z",
          "wordCount": null,
          "title": "The OPNsense Plugin You Must Install in 2025: Zenarmor Guide & Review",
          "imageUrl": null
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303510",
          "author": "Brandon Lee",
          "description": "DNS is absolutely one of the core critical services in your home lab environment. It isn’t flashy or the “next new thing” but if DNS isn’t working, nothing else will…\nThe post Why I run multiple DNS servers in my home lab (and you should too) appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/10/why-i-run-multiple-dns-servers-in-my-home-lab-and-you-should-too/",
          "publishedOn": "2025-10-01T12:01:28.000Z",
          "wordCount": null,
          "title": "Why I run multiple DNS servers in my home lab (and you should too)",
          "imageUrl": null
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303434",
          "author": "Brandon Lee",
          "description": "Since I have moved my home lab now to mostly mini PCs, I definitely keep my eyes open for great mini PC configurations and offerings that make sense for home…\nThe post MINIX Elite EU715-AI Review The Mini PC Designed for AI and Home Labs appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/09/minix-elite-eu715-ai-review-the-mini-pc-designed-for-ai-and-home-labs/",
          "publishedOn": "2025-09-30T11:58:52.000Z",
          "wordCount": null,
          "title": "MINIX Elite EU715-AI Review The Mini PC Designed for AI and Home Labs",
          "imageUrl": null
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303432",
          "author": "Brandon Lee",
          "description": "Reverse proxies I think are one of the most important services that you can spin up in your home lab. In fact, if you caught my recent blog post and…\nThe post Why Pangolin is the one reverse proxy I’d pick if I was starting my home lab today appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/09/why-pangolin-is-the-one-reverse-proxy-id-pick-if-i-was-starting-my-home-lab-today/",
          "publishedOn": "2025-09-29T12:30:47.000Z",
          "wordCount": null,
          "title": "Why Pangolin is the one reverse proxy I’d pick if I was starting my home lab today",
          "imageUrl": null
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303382",
          "author": "Brandon Lee",
          "description": "Recently, I covered the first services that you should spin up in a home lab, including core services that are needed to make sure things work as expected with apps…\nThe post The First Hardware I Always Buy for Any Home Lab appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/09/the-first-hardware-i-always-buy-for-any-home-lab/",
          "publishedOn": "2025-09-26T11:31:14.000Z",
          "wordCount": null,
          "title": "The First Hardware I Always Buy for Any Home Lab",
          "imageUrl": null
        },
        {
          "id": "https://www.virtualizationhowto.com/?p=303367",
          "author": "Brandon Lee",
          "description": "I have been testing a lot of reverse proxies lately, comparing features, and thinking about which ones are best for which use cases. For a long while, I have thought…\nThe post Nginx Proxy Manager vs NPMplus Which One is Better for Your Home Lab? appeared first on Virtualization Howto.",
          "link": "https://www.virtualizationhowto.com/2025/09/nginx-proxy-manager-vs-npmplus-which-one-is-better-for-your-home-lab/",
          "publishedOn": "2025-09-25T12:06:54.000Z",
          "wordCount": null,
          "title": "Nginx Proxy Manager vs NPMplus Which One is Better for Your Home Lab?",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Collabnix",
      "feedUrl": "https://collabnix.com/feed/",
      "siteUrl": "https://collabnix.com",
      "articles": [
        {
          "id": "https://collabnix.com/?p=57524",
          "author": "Collabnix Team",
          "description": "Introduction: The AI Revolution You Haven’t Heard About While the world focuses on GPT-4, Claude, and Gemini as standalone models, a quiet revolution is happening in AI architecture: Multi-Agent Multi-LLM systems. These distributed AI systems are solving problems that single models cannot, achieving performance levels that seemed impossible just months ago. The Paradigm Shift Traditional […]",
          "link": "https://collabnix.com/multi-agent-multi-llm-systems-the-future-of-ai-architecture-complete-guide-2025/",
          "publishedOn": "2025-10-21T07:12:46.000Z",
          "wordCount": 6513,
          "title": "Multi-Agent Multi-LLM Systems: The Future of AI Architecture (Complete Guide 2025)",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=57521",
          "author": "Collabnix Team",
          "description": "Discover the Key Cursor AI Benefits for 2025 Introduction: Why Developers Are Making the Switch Over 1 million developers have already made the switch to Cursor AI, including engineers at OpenAI, Perplexity, Samsung, Shopify, and Midjourney. The question isn’t whether AI will transform coding—it’s whether you’re ready to leverage it before your competition does. If […]",
          "link": "https://collabnix.com/top-5-reasons-to-switch-to-cursor-ai-in-2025-the-complete-comparison-guide/",
          "publishedOn": "2025-10-21T07:03:36.000Z",
          "wordCount": 6235,
          "title": "Discover Cursor AI Benefits for 2025 Success",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=57514",
          "author": "Tanvir Kour",
          "description": "Understanding AI Text Detection in 2025 I have tried more than a dozen AI detectors within the last six months, and I have to say something uncomfortable to you: YES, AI-generated text can be identified, but the process of identifying it is messy, inconsistent and, more often than not, erroneous. When you are writing essays […]",
          "link": "https://collabnix.com/can-ai-text-be-detected-what-students-need-to-know-in-2025/",
          "publishedOn": "2025-10-21T06:56:45.000Z",
          "wordCount": 3855,
          "title": "AI Text Detection: What Students Must Know in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=57509",
          "author": "Collabnix Team",
          "description": "Exploring Cursor AI: Features and Best Practices Cursor AI has rapidly emerged as one of the most powerful AI-assisted development environments in 2025, serving billions of code completions daily to developers at Fortune 500 companies. Unlike traditional IDEs with bolt-on AI features, Cursor was architected from the ground up to integrate artificial intelligence into every […]",
          "link": "https://collabnix.com/cursor-ai-deep-dive-technical-architecture-advanced-features-best-practices-2025/",
          "publishedOn": "2025-10-21T06:48:06.000Z",
          "wordCount": 4961,
          "title": "Cursor AI Deep Dive: Technical Architecture, Advanced Features & Best Practices (2025)",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=57198",
          "author": "Collabnix Team",
          "description": "AI-powered development tools are revolutionizing how developers write code, and Cursor AI has emerged as the leading AI-first code editor. Built as a fork of VS Code, Cursor combines familiar workflows with groundbreaking AI capabilities that can dramatically accelerate development. This comprehensive guide covers everything from setup to advanced techniques for maximizing productivity with Cursor. […]",
          "link": "https://collabnix.com/cursor-ai-the-complete-developers-guide-to-ai-powered-coding-in-2025/",
          "publishedOn": "2025-10-18T14:43:29.000Z",
          "wordCount": 3889,
          "title": "Cursor AI: The Complete Developer’s Guide to AI-Powered Coding in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=57184",
          "author": "Tanvir Kour",
          "description": "Be it through attending events in the community or live-streaming their adventures online, the mobile gaming category is absolutely booming right now. On both iOS and Android devices, gamers are now exposed to an increasing number of innovative products, with today’s powerful smartphones now being able to handle console-quality titles and even virtual reality products. […]",
          "link": "https://collabnix.com/your-guide-to-10-top-mobile-games-to-play-in-2025/",
          "publishedOn": "2025-10-18T13:43:26.000Z",
          "wordCount": null,
          "title": "Your Guide to 10 Top Mobile Games to play in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=56983",
          "author": "Tanvir Kour",
          "description": "An essential component of financial management is revenue recognition in business. And as businesses scale and transactions become more complex, it can be even more difficult for finance teams to accurately recognize revenue. This process guarantees that the financial statements portray true earnings and promote stakeholder confidence. With its crucial role in keeping financial integrity […]",
          "link": "https://collabnix.com/what-makes-revenue-recognition-solutions-vital-for-finance-teams/",
          "publishedOn": "2025-10-16T21:32:38.000Z",
          "wordCount": 2500,
          "title": "What Makes Revenue Recognition Solutions Vital for Finance Teams",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=56981",
          "author": "Tanvir Kour",
          "description": "Salespeople are always looking for ways to sharpen their skills. Micro practice is a powerful technique to improve selling skills. Here, each of the different components of the sales process will be broken down so that everyone can work on a tiny segment of it at a time to improve. Understanding Micro Practice Micro practice […]",
          "link": "https://collabnix.com/how-to-upgrade-sales-skills-with-micro-practice/",
          "publishedOn": "2025-10-16T21:30:26.000Z",
          "wordCount": 2518,
          "title": "How to Upgrade Sales Skills With Micro Practice",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=56969",
          "author": "Tanvir Kour",
          "description": "Streaming platforms face constant pressure to keep subscribers engaged while competition grows. Many users cancel when they feel the content is not relevant or the experience is not smooth. AI agents help reduce churn and boost retention by predicting user behavior, personalizing recommendations, and improving customer support. These systems analyze viewing patterns, identify when someone […]",
          "link": "https://collabnix.com/can-ai-agents-help-ott-providers-reduce-churn-and-boost-retention-through-smarter-engagement-strategies/",
          "publishedOn": "2025-10-16T21:28:17.000Z",
          "wordCount": 3170,
          "title": "Can AI Agents Help OTT Providers Reduce Churn and Boost Retention Through Smarter Engagement Strategies",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=56908",
          "author": "Tanvir Kour",
          "description": "Crafting for AI and developer platforms can feel overwhelming. Clear, structured templates simplify this process. This guide offers examples of essential options that cater to everyday communication needs. Each helps with real-world tasks, such as announcements and documentation. Implementing these practical resources helps save time while ensuring consistency across all channels. Whether you’re updating users […]",
          "link": "https://collabnix.com/5-launch-templates-for-ai-and-developer-platforms/",
          "publishedOn": "2025-10-15T22:00:27.000Z",
          "wordCount": 2553,
          "title": "5 Launch Templates for AI and Developer Platforms",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=56905",
          "author": "Tanvir Kour",
          "description": "Connected parking garages constitute an ideal convergence of cybersecurity weaknesses. These infrastructures merge surveillance equipment, transaction machines, mobile software, entry mechanisms, and network-linked detectors into an extensive vulnerability landscape that most entities have insufficiently protected. The ramifications surpass monetary damages or information compromises. When digital malfunctions undermine physical entry safeguards or monitoring infrastructures, the tangible […]",
          "link": "https://collabnix.com/smart-parking-threats-and-how-zero-trust-helps/",
          "publishedOn": "2025-10-15T21:46:23.000Z",
          "wordCount": null,
          "title": "Smart Parking Threats and How Zero Trust Helps",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=56592",
          "author": "Tanvir Kour",
          "description": "You want to incorporate AI technology into your workflow? Learn about the best AI services available that can help you manage this process.",
          "link": "https://collabnix.com/10-ai-services-transforming-businesses-in-2025/",
          "publishedOn": "2025-10-11T05:35:50.000Z",
          "wordCount": 3270,
          "title": "10 AI Services Transforming Businesses in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=56345",
          "author": "Tanvir Kour",
          "description": "How well a company does depends a lot on how engaged its workers are. Employees are more motivated and productive at work when they feel like they belong, are valued, and are supported. But in many companies, engagement goes down because the systems that teams use don’t work effectively together. It’s hard to gather information, […]",
          "link": "https://collabnix.com/creating-a-connected-workplace-that-boosts-employee-engagement/",
          "publishedOn": "2025-10-07T18:05:51.000Z",
          "wordCount": 2881,
          "title": "Creating a Connected Workplace That Boosts Employee Engagement",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=55833",
          "author": "Tanvir Kour",
          "description": "Introduction In today’s digital economy, enterprises face a relentless wave of cyber threats that target every layer of their IT infrastructure. Attackers are no longer relying on simple viruses but instead deploy ransomware, phishing campaigns, and advanced persistent threats designed to steal sensitive data or disrupt operations. For businesses operating in hybrid and cloud-first environments, […]",
          "link": "https://collabnix.com/firewall-definition-simplified-for-modern-enterprise-security/",
          "publishedOn": "2025-10-05T08:37:34.000Z",
          "wordCount": null,
          "title": "Firewall Definition Simplified for Modern Enterprise Security",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=55758",
          "author": "Collabnix Team",
          "description": "As Large Language Model (LLM)-based autonomous agents transition from experimental prototypes to production systems, they introduce a paradigm shift in both capabilities and security challenges. Unlike traditional AI systems that merely process inputs and generate outputs, agentic AI systems possess reasoning capabilities, persistent memory, tool integration, and multi-step planning abilities that fundamentally expand the attack […]",
          "link": "https://collabnix.com/agentic-ai-and-security-a-deep-technical-analysis/",
          "publishedOn": "2025-10-05T06:24:36.000Z",
          "wordCount": null,
          "title": "Agentic AI and Security: A Deep Technical Analysis",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=55812",
          "author": "Collabnix Team",
          "description": "Discover how Ollama AI is revolutionizing business intelligence, customer service, and automation by bringing enterprise-grade AI capabilities to your local infrastructure - without the cloud costs or privacy risks",
          "link": "https://collabnix.com/unlocking-the-power-of-ollama-ai-transform-your-business-with-local-llms/",
          "publishedOn": "2025-10-05T03:52:03.000Z",
          "wordCount": null,
          "title": "Unlocking the Power of Ollama AI: Transform Your Business with Local LLMs",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=55750",
          "author": "Collabnix Team",
          "description": "In the world of containerization, security is paramount. For years, one of Docker’s most significant attack vectors has been the requirement to run the Docker daemon as root. Enter Rootless Docker—a game-changing security feature that allows you to run both the Docker daemon and containers as a non-root user, dramatically reducing your attack surface. Why […]",
          "link": "https://collabnix.com/rootless-docker-running-containers-securely-without-root-privileges/",
          "publishedOn": "2025-10-04T17:34:44.000Z",
          "wordCount": null,
          "title": "Rootless Docker: Running Containers Securely Without Root Privileges",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=55735",
          "author": "Collabnix Team",
          "description": "Understanding Agentic AI and Its Transformative Business Impact Agentic AI represents the next evolution in artificial intelligence—systems that can autonomously plan, execute, and optimize tasks with minimal human intervention. Unlike traditional AI tools that simply respond to prompts, agentic AI takes initiative, makes decisions, and adapts its approach based on outcomes. For businesses evaluating this […]",
          "link": "https://collabnix.com/agentic-ai-roi-measuring-business-value-and-real-world-returns-in-2025/",
          "publishedOn": "2025-10-04T17:09:20.000Z",
          "wordCount": null,
          "title": "Agentic AI ROI: Measuring Business Value and Real-World Returns in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=55725",
          "author": "Collabnix Team",
          "description": "Discover the key differences between AI Agents and Agentic AI with practical code examples using LangChain, AutoGen, and CrewAI. Learn architecture patterns, implementation strategies, and real-world applications.",
          "link": "https://collabnix.com/ai-agents-vs-agentic-ai-a-complete-technical-guide-with-code-examples-2025/",
          "publishedOn": "2025-10-04T16:25:47.000Z",
          "wordCount": null,
          "title": "AI Agents vs Agentic AI: A Complete Technical Guide with Code Examples (2025)",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=55585",
          "author": "Tanvir Kour",
          "description": "In today’s competitive business environment across American companies, maintaining employee engagement and retention is crucial. Companies constantly seek innovative tools to enhance these aspects, and one such tool is a Learning Management System (LMS). But how exactly does this technology create meaningful change in the workplace? By supporting Learning and Development (L&D), a learning management […]",
          "link": "https://collabnix.com/10-ways-a-learning-management-system-transforms-employee-engagement-and-retention/",
          "publishedOn": "2025-10-03T07:55:06.000Z",
          "wordCount": null,
          "title": "10 Ways a Learning Management System Transforms Employee Engagement and Retention",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=55520",
          "author": "Tanvir Kour",
          "description": "You want to keep all your business data and operations in one place? Learn how unified management systems can help you achieve that.",
          "link": "https://collabnix.com/how-unified-systems-impact-modern-business-operations/",
          "publishedOn": "2025-10-02T18:14:18.000Z",
          "wordCount": null,
          "title": "How Unified Systems Impact Modern Business Operations",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=55276",
          "author": "Tanvir Kour",
          "description": "Going from a DevOps Engineer to becoming a DevLead translates to a major shift in your professional life. It basically changes everything: from a job focused on using tools and performing tasks to taking a leading role focused on other people and planning. In the age of automation, however, coaching yourself to develop new skills […]",
          "link": "https://collabnix.com/how-to-move-from-devops-to-devlead-in-the-age-of-automation/",
          "publishedOn": "2025-10-01T07:51:58.000Z",
          "wordCount": null,
          "title": "How to Move From DevOps to DevLead In the Age of Automation",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=55163",
          "author": "Tanvir Kour",
          "description": "Artificial Intelligence (AI) has become a significant force in transforming various industries. One area where its impact is profound is Technology Assisted Review (TAR). This innovative approach enhances data analysis and document review processes, making them more efficient. By integrating intelligent algorithms, TAR has revolutionized how professionals handle large volumes of information. Understanding Technology Assisted […]",
          "link": "https://collabnix.com/how-ai-is-driving-advances-in-technology-assisted-review/",
          "publishedOn": "2025-09-29T09:52:59.000Z",
          "wordCount": null,
          "title": "How AI Is Driving Advances in Technology Assisted Review",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=54960",
          "author": "Tanvir Kour",
          "description": "Why Companies Choose Dedicated Development Team Companies in 2025 The shortage of IT talent in local markets has reached a critical point. If a few years ago companies could afford to wait for the “perfect” candidate for months, today this strategy simply does not work. This is especially true for high-tech sectors: in fintech, competition […]",
          "link": "https://collabnix.com/best-dedicated-development-team-providers-in-2025-top-companies-to-hire/",
          "publishedOn": "2025-09-27T16:39:18.000Z",
          "wordCount": null,
          "title": "Best Dedicated Development Team Providers in 2025: Top Companies to Hire",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=54943",
          "author": "Tanvir Kour",
          "description": "Managing egress security in cloud-native environments is innately challenging. Traditional perimeter defenses often fail to keep up with Kubernetes, developer workflows, and distributed teams. Cloud-based URL filtering offers a smarter approach. It blocks risky domains before harm occurs, securing CI/CD runners, remote workstations, and even overlooked areas like package registries or SaaS tools used without […]",
          "link": "https://collabnix.com/cloud-native-egress-security-how-msp-managed-url-filtering-protects-kubernetes-and-developer-workflows/",
          "publishedOn": "2025-09-27T14:02:05.000Z",
          "wordCount": null,
          "title": "Cloud-Native Egress Security: How MSP-Managed URL Filtering Protects Kubernetes and Developer Workflows",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=54068",
          "author": "Collabnix Team",
          "description": "Introduction: The Evolution from Single to Multi-Agent AI Systems The artificial intelligence landscape has dramatically shifted in 2025. While single Large Language Models (LLMs) like GPT-4 and Claude dominated 2023-2024, the future belongs to multi-agent LLM systems where specialized AI agents collaborate to solve complex problems. According to recent research, over 80% of enterprise workloads […]",
          "link": "https://collabnix.com/multi-agent-and-multi-llm-architecture-complete-guide-for-2025/",
          "publishedOn": "2025-09-19T10:37:03.000Z",
          "wordCount": null,
          "title": "Multi-Agent and Multi-LLM Architecture: Complete Guide for 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53958",
          "author": "Tanvir Kour",
          "description": "Manufacturing has always been vulnerable to disruption—supply chain delays, labor shortages, or unexpected global events that can shut down production lines overnight. The pandemic proved just how fragile traditional manufacturing operations really are when everything depends on predictable conditions. In today’s digital-first economy, resilience is no longer optional for manufacturers who want to survive the […]",
          "link": "https://collabnix.com/the-role-of-it-in-building-resilient-manufacturing-operations/",
          "publishedOn": "2025-09-17T14:22:02.000Z",
          "wordCount": null,
          "title": "The Role of IT in Building Resilient Manufacturing Operations",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53762",
          "author": "Collabnix Team",
          "description": "OpenAI has released GPT-5-Codex, a specialized AI coding model that can work autonomously for hours, revolutionizing software development with advanced agentic capabilities and superior code review features.",
          "link": "https://collabnix.com/openai-launches-gpt-5-codex-the-ultimate-ai-coding-companion-that-can-work-for-7-hours-independently/",
          "publishedOn": "2025-09-16T14:55:32.000Z",
          "wordCount": null,
          "title": "OpenAI Launches GPT-5-Codex: The Ultimate AI Coding Companion That Can Work for 7+ Hours Independently",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53753",
          "author": "Collabnix Team",
          "description": "As artificial intelligence models continue to grow in size and complexity, the computational and memory requirements for deployment have become increasingly prohibitive. Modern large language models (LLMs) like GPT-4 and Claude contain hundreds of billions of parameters, requiring substantial hardware resources for both training and inference. Quantization has emerged as one of the most effective […]",
          "link": "https://collabnix.com/understanding-quantization-in-ai-a-deep-dive-into-model-compression-techniques/",
          "publishedOn": "2025-09-16T14:15:56.000Z",
          "wordCount": null,
          "title": "Understanding Quantization in AI: A Deep Dive into Model Compression Techniques",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53633",
          "author": "Collabnix Team",
          "description": "Cerebras AI has emerged as one of the most innovative challengers to NVIDIA’s dominance in AI infrastructure, pioneering wafer-scale computing technology that delivers 75x faster inference and 10x faster training than traditional GPU clusters. Founded in 2016 by the team behind SeaMicro (acquired by AMD for $334M), the company has raised over $720 million and […]",
          "link": "https://collabnix.com/cerebras-revolutionizing-ai-infrastructure-with-wafer-scale-computing/",
          "publishedOn": "2025-09-15T06:18:38.000Z",
          "wordCount": null,
          "title": "Cerebras: revolutionizing AI infrastructure with wafer-scale computing",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53496",
          "author": "Collabnix Team",
          "description": "If you’ve been keeping up with the rapidly evolving AI landscape, you’ve probably heard whispers about Qwen 3 – Alibaba’s latest AI powerhouse that’s making developers and AI enthusiasts worldwide take notice. But what exactly is Qwen 3, and why is everyone talking about it? In this comprehensive guide, we’ll dive deep into everything you […]",
          "link": "https://collabnix.com/qwen-3-the-game-changing-ai-model-thats-revolutionizing-local-ai-development/",
          "publishedOn": "2025-09-14T02:59:17.000Z",
          "wordCount": null,
          "title": "Qwen 3: The Game-Changing AI Model That’s Revolutionizing Local AI Development",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53373",
          "author": "Collabnix Team",
          "description": "Discover how Docker's revolutionary cagent framework is transforming AI agent development with simple YAML configurations, multi-agent orchestration, and seamless tool integration.",
          "link": "https://collabnix.com/what-is-docker-cagent-and-what-problem-does-it-solve/",
          "publishedOn": "2025-09-13T19:30:37.000Z",
          "wordCount": null,
          "title": "What is Docker cagent and what problem does it solve?",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53346",
          "author": "Tanvir Kour",
          "description": "Docker isn’t just a buzzword anymore—it’s the backbone of modern software development. With over 13 billion container downloads per month and a market projected to reach $993 million by 2025, Docker has become as essential as knowing how to code itself. But here’s the shocking truth: 90% of developers are using Docker wrong. If you’re […]",
          "link": "https://collabnix.com/the-ultimate-docker-guide-thats-breaking-the-internet-in-2025-why-90-of-developers-are-getting-it-wrong-and-how-to-join-the-top-10/",
          "publishedOn": "2025-09-13T17:37:34.000Z",
          "wordCount": null,
          "title": "The Ultimate Docker Guide That’s Breaking the Internet in 2025: Why 90% of Developers Are Getting It Wrong (And How to Join the Top 10%)",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53341",
          "author": "Tanvir Kour",
          "description": "A comprehensive guide to understanding, implementing, and securing autonomous AI systems in enterprise environments As Agentic AI systems transition from experimental tools to mission-critical business infrastructure, organizations face unprecedented security challenges. Unlike traditional AI that responds to prompts, Agentic AI operates autonomously—planning, executing, and adapting across multiple systems with minimal human oversight. This comprehensive analysis […]",
          "link": "https://collabnix.com/agentic-ai-security-threats-architectures-mitigations/",
          "publishedOn": "2025-09-13T17:16:15.000Z",
          "wordCount": null,
          "title": "Agentic AI Security: Threats, Architectures & Mitigations",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53339",
          "author": "Collabnix Team",
          "description": "Why the shift from traditional AI to autonomous agents is creating a cybersecurity nightmare that 93% of security leaders aren’t prepared for The Shock That Changed Everything Picture this: You wake up Monday morning to discover your AI assistant has autonomously approved $2.3 million in fraudulent transactions, granted system access to unauthorized users, and leaked […]",
          "link": "https://collabnix.com/5-agentic-ai-threats-that-could-cripple-your-business-in-2025/",
          "publishedOn": "2025-09-13T17:10:51.000Z",
          "wordCount": null,
          "title": "5 Agentic AI Threats That Could Cripple Your Business in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53334",
          "author": "Tanvir Kour",
          "description": "Run ChatGPT-level AI models on your laptop for FREE – No API bills, complete privacy, and unlimited usage! Ollama has revolutionized local AI by making it ridiculously easy to run powerful language models on your own hardware. Think of it as “Docker for AI models” – one command and you’re running models that rival ChatGPT, […]",
          "link": "https://collabnix.com/the-complete-ollama-guide-2025-from-zero-to-ai-hero-with-50-code-examples/",
          "publishedOn": "2025-09-13T17:06:04.000Z",
          "wordCount": null,
          "title": "The Complete Ollama Guide 2025: From Zero to AI Hero (With 50+ Code Examples!)",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53330",
          "author": "Tanvir Kour",
          "description": "Explore the future of decentralized social media, from blockchain-based platforms to user-owned content. Learn how it works, what it solves, and where it's headed.",
          "link": "https://collabnix.com/what-decentralized-social-media-could-look-like-in-2025/",
          "publishedOn": "2025-09-13T16:38:45.000Z",
          "wordCount": null,
          "title": "What Decentralized Social Media Could Look Like in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53326",
          "author": "Tanvir Kour",
          "description": "DevOps is more than just automation or fast deployment. The way a team interacts is just as important as the tools they use. Research shows that culture, especially the recognition-first type, greatly impacts delivery performance and employee well-being. In this environment, celebrating wins is not an afterthought. It becomes a regular, visible part of working […]",
          "link": "https://collabnix.com/building-high-performing-devops-teams-through-meaningful-recognition/",
          "publishedOn": "2025-09-13T16:34:19.000Z",
          "wordCount": null,
          "title": "Building High-Performing DevOps Teams Through Meaningful Recognition",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=53323",
          "author": "Tanvir Kour",
          "description": "Protecting music publishing APIs must go beyond basic coding practices. Security ensures that valuable release metadata, audio uploads, and client data remain safe. What makes an effective checklist? Stay tuned as we discuss all the key points you need to cover in your API development efforts. OAuth Scopes for Permission Control OAuth scopes define which […]",
          "link": "https://collabnix.com/security-checklist-for-music-publishing-apis/",
          "publishedOn": "2025-09-13T16:28:31.000Z",
          "wordCount": null,
          "title": "Security Checklist for Music Publishing APIs",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=52493",
          "author": "Collabnix Team",
          "description": "The rise of large language models (LLMs) running locally has revolutionized how developers approach AI integration, with Ollama emerging as the dominant platform for local LLM deployment. However, the true power of Ollama lies in its sophisticated GPU acceleration capabilities, which can deliver 10-50x performance improvements over CPU-only inference. This comprehensive technical guide provides production-ready […]",
          "link": "https://collabnix.com/ollama-gpu-acceleration-the-ultimate-nvidia-cuda-and-amd-rocm-configuration-guide-for-production-ai-deployment/",
          "publishedOn": "2025-09-08T11:52:53.000Z",
          "wordCount": null,
          "title": "Ollama GPU Acceleration: The Ultimate NVIDIA CUDA and AMD ROCm Configuration Guide for Production AI Deployment",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=52484",
          "author": "Collabnix Team",
          "description": "Introduction to Qwen-Image-Edit Qwen-Image-Edit represents a breakthrough in AI-powered image editing technology, extending Alibaba’s powerful 20B parameter Qwen-Image foundation model with specialized editing capabilities. Released in August 2025 and featured extensively on Collabnix for its technical innovation, this state-of-the-art model achieves unprecedented performance in semantic image editing, appearance modification, and most notably, precise text rendering […]",
          "link": "https://collabnix.com/qwen-image-edit-the-ultimate-technical-guide-to-ai-powered-image-editing-2025/",
          "publishedOn": "2025-09-08T07:20:42.000Z",
          "wordCount": null,
          "title": "Qwen-Image-Edit: The Ultimate Technical Guide to AI-Powered Image Editing (2025)",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=52258",
          "author": "Collabnix Team",
          "description": "As artificial intelligence and machine learning workloads continue to dominate modern computing infrastructure, efficiently managing GPU resources in Kubernetes clusters has become critical for organizations looking to maximize performance while controlling costs. With GPU acceleration providing 10-100x performance improvements over CPU-only processing and 48% of organizations now using Kubernetes for AI/ML workloads, implementing proper GPU […]",
          "link": "https://collabnix.com/kubernetes-gpu-resource-management-best-practices-complete-technical-guide-for-2025/",
          "publishedOn": "2025-09-07T05:25:14.000Z",
          "wordCount": null,
          "title": "Kubernetes GPU Resource Management Best Practices: Complete Technical Guide for 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=52069",
          "author": "Collabnix Team",
          "description": "Comprehensive comparison of Hugging Face and Ollama for local AI deployment. Learn setup, performance, use cases, and which platform suits your AI development needs.",
          "link": "https://collabnix.com/hugging-face-vs-ollama-the-complete-technical-deep-dive-guide-for-local-ai-development-in-2025/",
          "publishedOn": "2025-09-06T03:59:17.000Z",
          "wordCount": null,
          "title": "Hugging Face vs Ollama: The Complete Technical Deep Dive Guide for Local AI Development in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=51907",
          "author": "Collabnix Team",
          "description": "Understanding GPU Allocation in Kubernetes Understanding how Kubernetes allocates GPUs to workloads is crucial for anyone working with AI/ML applications or high-performance computing. This comprehensive guide explores the intricate mechanisms behind GPU allocation in Kubernetes, from the device plugin framework to the complete allocation process. Overview: The GPU Allocation Challenge Traditional Kubernetes was designed for […]",
          "link": "https://collabnix.com/how-gpu-allocation-to-kubernetes-works-deep-dive-into-the-mechanism/",
          "publishedOn": "2025-09-05T09:02:45.000Z",
          "wordCount": null,
          "title": "GPU Allocation in Kubernetes: A Comprehensive Guide",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=51903",
          "author": "Collabnix Team",
          "description": "As we advance through 2025, the convergence of Kubernetes and GPU acceleration has become the cornerstone of modern AI/ML infrastructure. With “Kubernetes AI” emerging as the most searched term (experiencing a 300% increase in search volume), organizations are rapidly adopting GPU-enabled Kubernetes clusters to power their machine learning workloads. This comprehensive guide explores the trending […]",
          "link": "https://collabnix.com/kubernetes-and-gpu-the-complete-2025-guide-to-ai-ml-acceleration/",
          "publishedOn": "2025-09-05T08:56:35.000Z",
          "wordCount": null,
          "title": "Kubernetes and GPU: The Complete 2025 Guide to AI/ML Acceleration",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=51314",
          "author": "Tanvir Kour",
          "description": "AI is no longer a concept from the future: it acts now as a practical lever of transformation for businesses. Across industries, companies deploy AI to fine-tune operations, enhance customer experiences, and generate new sources of revenue. However, the creation of AI products is not only reliant on technical skills; it really needs a process-orientated […]",
          "link": "https://collabnix.com/designing-and-building-ai-products-and-services-a-practical-guide-for-businesses/",
          "publishedOn": "2025-09-01T08:33:40.000Z",
          "wordCount": null,
          "title": "Designing and Building AI Products and Services: A Practical Guide for Businesses",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=51268",
          "author": "Tanvir Kour",
          "description": "Artificial intelligence now drives faster coding, higher accuracy, and measurable productivity gains. Leading AI coding tools like GitHub Copilot, Windsurf, and Tabnine generate functions in seconds, detect bugs early, and adapt to individual developer workflows. In this guide, we compare their performance from solo prototyping to enterprise-scale projects, including remote coding scenarios. High-performance AI assistants […]",
          "link": "https://collabnix.com/which-ai-tool-is-best-for-coding-developers-guide/",
          "publishedOn": "2025-08-31T16:21:20.000Z",
          "wordCount": null,
          "title": "Which AI Tool Is Best for Coding? Developers Guide",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=51015",
          "author": "Tanvir Kour",
          "description": "Do you want to scale your advertising strategy? Check out the top 5 programmatic advertising platforms and companies with excellent customer ratings in our listing.",
          "link": "https://collabnix.com/5-best-programmatic-advertising-companies-to-partner-with/",
          "publishedOn": "2025-08-30T08:05:50.000Z",
          "wordCount": null,
          "title": "5 Best Programmatic Advertising Companies to Partner with",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=50899",
          "author": "Tanvir Kour",
          "description": "In today’s world, artificial intelligence is reaching ever greater heights in its development. It is capturing various spheres of activity and people’s everyday lives. Even large companies have not escaped the influence of the development of this neural network. After all, in modern realities, businesses must keep up with the times and adopt advanced technologies. […]",
          "link": "https://collabnix.com/why-businesses-should-use-generative-ai-consulting-services-today/",
          "publishedOn": "2025-08-29T10:01:21.000Z",
          "wordCount": null,
          "title": "Why Businesses Should Use Generative AI Consulting Services Today",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=50618",
          "author": "Tanvir Kour",
          "description": "Do you need help with ad campaigns? Discover the best programmatic advertising platforms to partner with in 2025.",
          "link": "https://collabnix.com/ultimate-guide-to-the-best-programmatic-advertising-platforms-of-2025/",
          "publishedOn": "2025-08-28T13:28:00.000Z",
          "wordCount": null,
          "title": "Ultimate Guide to the Best Programmatic Advertising Platforms of 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=50612",
          "author": "Collabnix Team",
          "description": "Choosing a DevOps consulting company? Learn how to find the right partner with a proven track record, full-cycle services, and a focus on measurable outcomes. Avoid common pitfalls and accelerate your business transformation.",
          "link": "https://collabnix.com/how-to-choose-the-best-devops-consulting-company-in-the-usa/",
          "publishedOn": "2025-08-28T13:05:19.000Z",
          "wordCount": null,
          "title": "How to Choose the Best DevOps Consulting Company in the USA?",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=50231",
          "author": "Tanvir Kour",
          "description": "Learn how rotating proxies in Python enhance web scraping with scalability, anonymity, geo-targeting, and reliable large-scale data collection.",
          "link": "https://collabnix.com/why-use-rotating-proxies-for-web-scraping-in-python/",
          "publishedOn": "2025-08-26T16:37:29.000Z",
          "wordCount": null,
          "title": "Why Use Rotating Proxies for Web Scraping in Python",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=50193",
          "author": "Tanvir Kour",
          "description": "Email remains a vital tool in communication, but it also presents significant security challenges. Digital attacks often get in by finding weak spots in email systems. Because so much private information travels through email, strong security programs are crucial to keep it safe. Want to protect your email? This article shares ways to stop cyber […]",
          "link": "https://collabnix.com/avoid-breaches-with-smarter-email-security-solutions/",
          "publishedOn": "2025-08-26T10:07:30.000Z",
          "wordCount": null,
          "title": "Avoid Breaches With Smarter Email Security Solutions",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=50129",
          "author": "Umang Saxena",
          "description": "This blog was originally posted by the author here Why Use Docker for Your Next.js App ? By containerizing your app, you create a consistent, portable, and reproducible environment that runs the same way on any machine — from your laptop to a production server. How to Dockerize a Next.js App: A Step-by-Step Guide Are […]",
          "link": "https://collabnix.com/hosting-your-nextjs-app-using-docker-in-5-minutes/",
          "publishedOn": "2025-08-26T02:07:24.000Z",
          "wordCount": null,
          "title": "Hosting Your Nextjs App using Docker in 5 Minutes",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=49917",
          "author": "Tanvir Kour",
          "description": "The iOS 26 update adds new features and better performance to iPhone users. Nevertheless, the issue of an unsuccessful update is common, and it may disrupt everyday use and annoy many people. Ignoring it may lead to missed security updates and performance improvements. So, this article explores why the update fails and how to fix […]",
          "link": "https://collabnix.com/how-to-resolve-an-iphone-that-fails-to-update-to-ios-26/",
          "publishedOn": "2025-08-24T14:40:34.000Z",
          "wordCount": null,
          "title": "How to Resolve an iPhone that Fails to Update to iOS 26",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=49904",
          "author": "Collabnix Team",
          "description": "What is Gemini CLI? Your Terminal’s New AI Superpower Gemini CLI is Google’s groundbreaking open-source AI agent that brings the full power of Gemini AI directly into your terminal. Released in 2025, this revolutionary command-line interface transforms how developers code, debug, and manage projects by providing intelligent assistance through natural language commands. Unlike traditional CLI […]",
          "link": "https://collabnix.com/gemini-cli-the-complete-guide-to-googles-revolutionary-ai-command-line-interface-2025/",
          "publishedOn": "2025-08-24T13:57:43.000Z",
          "wordCount": null,
          "title": "Gemini CLI: The Complete Guide to Google’s Revolutionary AI Command Line Interface (2025)",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=49899",
          "author": "Collabnix Team",
          "description": "As AI and machine learning workloads become increasingly central to modern applications, the need for GPU acceleration in Kubernetes has exploded. Whether you’re training deep learning models, running inference workloads, or processing massive datasets, understanding how to effectively leverage GPUs in Kubernetes is essential for any DevOps engineer or ML practitioner. This comprehensive guide covers […]",
          "link": "https://collabnix.com/kubernetes-and-gpu-the-complete-guide-to-ai-ml-acceleration-in-2025/",
          "publishedOn": "2025-08-24T13:47:03.000Z",
          "wordCount": null,
          "title": "Kubernetes and GPU: The Complete Guide to AI/ML Acceleration in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=49886",
          "author": "Collabnix Team",
          "description": "Top Kubernetes Tools for DevOps in 2025 Kubernetes has revolutionized container orchestration, but managing K8s clusters effectively requires the right set of tools. Whether you’re scaling microservices, implementing GitOps, or securing containerized workloads, having the essential Kubernetes tools in your DevOps arsenal can make the difference between smooth operations and constant troubleshooting. In this comprehensive […]",
          "link": "https://collabnix.com/top-20-kubernetes-tools-every-devops-engineer-must-know-in-2025/",
          "publishedOn": "2025-08-24T13:25:56.000Z",
          "wordCount": null,
          "title": "Top Kubernetes Tools for DevOps in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=49182",
          "author": "Collabnix Team",
          "description": "When technical delivery, contracts, and regulations collide, the smallest misstep can slow a whole program. An online data room, or virtual data room(VDR), fixes the usual chaos by giving DevOps, legal, and compliance teams a secure place to work from the same documents, with the same context, and under the same controls. Cross-functional work rarely […]",
          "link": "https://collabnix.com/vdrs-for-cross-functional-collaboration-between-devops-legal-and-compliance-teams/",
          "publishedOn": "2025-08-21T11:35:08.000Z",
          "wordCount": null,
          "title": "VDRs for Cross-Functional Collaboration Between DevOps, Legal, and Compliance Teams",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=48030",
          "author": "Collabnix Team",
          "description": "Master Ollama embedded models for local AI embeddings. Complete technical guide covering implementation, performance optimization, and integration with open-source AI workflows",
          "link": "https://collabnix.com/ollama-embedded-models-the-complete-technical-guide-to-local-ai-embeddings-in-2025/",
          "publishedOn": "2025-08-17T09:32:17.000Z",
          "wordCount": null,
          "title": "Ollama Embedded Models: The Complete Technical Guide to Local AI Embeddings in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=48026",
          "author": "Collabnix Team",
          "description": "Ollama embedded models represent a paradigm shift in local language model deployment, offering enterprise-grade performance with zero-dependency inference through advanced GGUF quantization and llama.cpp optimization. This comprehensive technical analysis examines the architecture, implementation strategies, and performance characteristics of Ollama's embedded ecosystem.",
          "link": "https://collabnix.com/ollama-embedded-models-the-complete-technical-guide-for-2025-enterprise-deployment/",
          "publishedOn": "2025-08-17T09:22:43.000Z",
          "wordCount": null,
          "title": "Ollama Embedded Models: The Complete Technical Guide for 2025 Enterprise Deployment",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=48022",
          "author": "Tanvir Kour",
          "description": "6-video-tips-for-kubernetes-and-docker-tutorials",
          "link": "https://collabnix.com/6-video-tips-for-kubernetes-and-docker-tutorials/",
          "publishedOn": "2025-08-17T09:11:26.000Z",
          "wordCount": null,
          "title": "6 Video Tips for Kubernetes and Docker Tutorials",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=47615",
          "author": "Collabnix Team",
          "description": "Choosing a dedicated server is a big decision, whether you’re running a growing website, managing heavy workloads, or hosting complex applications. Unlike shared or VPS hosting, a dedicated server gives you exclusive access to the entire machine, offering more control, better performance, and greater customization. However, with so many providers and configurations available, it’s important […]",
          "link": "https://collabnix.com/top-7-things-to-check-before-you-buy-a-dedicated-server/",
          "publishedOn": "2025-08-15T11:20:44.000Z",
          "wordCount": null,
          "title": "Top 7 Things to Check Before You Buy a Dedicated Server",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=47175",
          "author": "Collabnix Team",
          "description": "Learn how to customize large language models for your specific needs and deploy them locally using Ollama. This comprehensive guide covers everything from data preparation to model deployment.",
          "link": "https://collabnix.com/how-to-fine-tune-llm-and-use-it-with-ollama-a-complete-guide-for-2025/",
          "publishedOn": "2025-08-13T11:29:57.000Z",
          "wordCount": null,
          "title": "How to Fine-Tune LLM and Use It with Ollama: A Complete Guide for 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=47172",
          "author": "Collabnix Team",
          "description": "Discover the different types of Ollama models available for local AI deployment. Learn about Llama, Mistral, Code Llama, and other model families with practical implementation tips.",
          "link": "https://collabnix.com/types-of-ollama-models-complete-guide-to-local-ai-model-varieties/",
          "publishedOn": "2025-08-13T10:53:30.000Z",
          "wordCount": null,
          "title": "Types of Ollama Models: Complete Guide to Local AI Model Varieties",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=47169",
          "author": "Collabnix Team",
          "description": "Running large language models locally has become essential for developers, enterprises, and AI enthusiasts who prioritize privacy, cost control, and offline capabilities. Ollama has emerged as the leading platform for local LLM deployment, but with over 100+ models available, choosing the right one can be overwhelming. This comprehensive guide covers everything you need to know […]",
          "link": "https://collabnix.com/choosing-ollama-models-the-complete-2025-guide-for-developers-and-enterprises/",
          "publishedOn": "2025-08-13T10:45:00.000Z",
          "wordCount": null,
          "title": "Choosing Ollama Models: The Complete 2025 Guide for Developers and Enterprises",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=47166",
          "author": "Collabnix Team",
          "description": "Discover the top Ollama models for function calling in 2025. Compare performance, features, and implementation guides for Llama 3.1, Mistral, CodeLlama, and more.",
          "link": "https://collabnix.com/best-ollama-models-for-function-calling-tools-complete-guide-2025/",
          "publishedOn": "2025-08-13T10:40:30.000Z",
          "wordCount": null,
          "title": "Best Ollama Models for Function Calling Tools: Complete Guide 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=47156",
          "author": "Tanvir Kour",
          "description": "Discover how vCluster revolutionizes Kubernetes multi-tenancy with 99% faster provisioning, massive cost savings, and enterprise-grade isolation",
          "link": "https://collabnix.com/vcluster-the-complete-guide-to-virtual-kubernetes-clusters-in-2025/",
          "publishedOn": "2025-08-13T08:39:37.000Z",
          "wordCount": null,
          "title": "vCluster: The Complete Guide to Virtual Kubernetes Clusters in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=47124",
          "author": "Tanvir Kour",
          "description": "When you talk about containers, spreadsheets and tax codes aren’t the first things that come to mind. But you would be wrong to think there’s no connection between accountancy and containerization. The accounting world is currently undergoing a digital revolution that will help accountants do their work faster, safer, and more compliantly than ever before. […]",
          "link": "https://collabnix.com/how-containerization-is-reshaping-the-accountancy-workplace/",
          "publishedOn": "2025-08-12T17:09:47.000Z",
          "wordCount": null,
          "title": "How Containerization Is Reshaping the Accountancy Workplace",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=47119",
          "author": "Tanvir Kour",
          "description": "Healthcare IT is changing fast, with DevOps leading the charge. As a result, the patchwork solutions are evaporating, and instead, efficiency is becoming a built-in feature of modern workflows in hospitals and clinics alike. Here’s a look at the intriguing nature of this relationship and what it means in practice for an industry niche that’s […]",
          "link": "https://collabnix.com/how-devops-is-reinventing-workflows-in-healthcare-it/",
          "publishedOn": "2025-08-12T17:05:51.000Z",
          "wordCount": null,
          "title": "How DevOps Is Reinventing Workflows in Healthcare IT",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=46890",
          "author": "Diksha Gathania",
          "description": "We’ve reached a tipping point. AI isn’t just enhancing marketing; it’s starting to run it. Today’s most innovative teams aren’t spending late nights building drip sequences or debating subject lines. Instead, they’re deploying AI agents, digital workers that can write, test, optimize, and even pivot campaigns in real time. And they’re doing it better than […]",
          "link": "https://collabnix.com/how-ai-agents-are-running-campaigns-so-you-dont-have-to/",
          "publishedOn": "2025-08-11T12:03:37.000Z",
          "wordCount": null,
          "title": "How AI Agents Are Running Campaigns So You Don’t Have To",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=46875",
          "author": "Collabnix Team",
          "description": "Understanding the architecture, capabilities, and future of large language models that are reshaping our digital landscape",
          "link": "https://collabnix.com/the-complete-guide-to-ai-models-in-2025-a-technical-deep-dive-into-the-ai-revolution/",
          "publishedOn": "2025-08-11T08:17:59.000Z",
          "wordCount": null,
          "title": "The Complete Guide to AI Models in 2025: A Technical Deep Dive into the AI Revolution",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=46872",
          "author": "Tanvir Kour",
          "description": "Ever wonder how the latest developments in cloud computing and DevOps will affect IT in the future? These domains get set to undergo changes as technology continues to develop at a rapid rate. Cloud computing has emerged as a key enabler for DevOps lead as it facilitates resource scaling, enhances collaboration, and lowers expenses. Most […]",
          "link": "https://collabnix.com/how-do-devops-and-cloud-computing-worktogether-to-create-a-trend-set/",
          "publishedOn": "2025-08-11T07:50:53.000Z",
          "wordCount": null,
          "title": "How do DevOps and Cloud Computing WorkTogether to Create a Trend Set?",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=46865",
          "author": "Collabnix Team",
          "description": "Introduction: What is Hugging Face and Why It’s Revolutionizing AI Hugging Face has emerged as the definitive platform for machine learning and artificial intelligence development, often dubbed “the GitHub of machine learning.” If you’re working with AI in 2025, understanding Hugging Face isn’t just beneficial—it’s essential. This comprehensive guide will walk you through everything you […]",
          "link": "https://collabnix.com/hugging-face-complete-guide-2025-the-ultimate-tutorial-for-machine-learning-and-ai-development/",
          "publishedOn": "2025-08-11T06:38:07.000Z",
          "wordCount": null,
          "title": "Hugging Face Complete Guide 2025: The Ultimate Tutorial for Machine Learning and AI Development",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=46673",
          "author": "Tanvir Kour",
          "description": "Introduction: Why “Kubernetes AI” Dominates 2025 Search Rankings If you’ve been following cloud computing trends in 2025, you’ve probably noticed one term consistently topping search results: Kubernetes AI. This isn’t just a passing fad—it represents the most significant shift in container orchestration since Kubernetes itself revolutionized cloud-native development. According to multiple industry reports and trend […]",
          "link": "https://collabnix.com/kubernetes-ai-the-most-searched-term-transforming-cloud-computing-in-2025/",
          "publishedOn": "2025-08-09T11:35:58.000Z",
          "wordCount": null,
          "title": "Kubernetes AI: The Most Searched Term Transforming Cloud Computing in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=46669",
          "author": "Collabnix Team",
          "description": "Discover the Best Open Source LLMs for 2025 Open-source Large Language Models (LLMs) have revolutionized AI accessibility in 2025, offering powerful alternatives to expensive proprietary models. This guide reviews the 10 best open-source LLMs available today, helping you choose the perfect model for your needs. What Are Open-Source LLMs? Open-source LLMs are freely available language […]",
          "link": "https://collabnix.com/the-10-best-open-source-llms-for-2025-your-complete-guide-to-free-language-models/",
          "publishedOn": "2025-08-09T11:30:25.000Z",
          "wordCount": null,
          "title": "Best Open Source LLMs for 2025: Your Complete Guide",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=46572",
          "author": "Collabnix Team",
          "description": "What is Testcontainers? Testcontainers is a powerful Java library that provides lightweight, throwaway instances of databases, message brokers, web browsers, or anything that can run in a Docker container for integration testing. Instead of mocking external dependencies or maintaining complex test environments, Testcontainers lets you run real instances of your dependencies during tests. Key Features […]",
          "link": "https://collabnix.com/testcontainers-tutorial-complete-guide-to-integration-testing-with-docker-2025/",
          "publishedOn": "2025-08-08T18:25:59.000Z",
          "wordCount": null,
          "title": "Testcontainers Tutorial: Complete Guide to Integration Testing with Docker (2025)",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=46243",
          "author": "Tanvir Kour",
          "description": "Imagine logging in to a digital classroom. Your favorite lessons, quizzes, chat messages, and even your progress through AI-powered learning are right there. Pretty cool, right? But that same convenience comes with a big responsibility: keeping your student data secure. Let’s dig into why this matters for every teacher, student, and parent using cloud-based classrooms […]",
          "link": "https://collabnix.com/student-data-security-an-essential-in-cloud-based-classrooms/",
          "publishedOn": "2025-08-07T10:28:10.000Z",
          "wordCount": null,
          "title": "Student Data Security: An Essential in Cloud-Based Classrooms",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=46238",
          "author": "Collabnix Team",
          "description": "Learn how to install, configure, and deploy OpenAI's GPT OSS models (20B & 120B parameters) with this comprehensive step-by-step tutorial covering local inference, API access, and optimization techniques.",
          "link": "https://collabnix.com/complete-gpt-oss-tutorial-how-to-setup-deploy-optimize-openais-open-source-models/",
          "publishedOn": "2025-08-07T10:02:08.000Z",
          "wordCount": null,
          "title": "Complete GPT OSS Tutorial: How to Setup, Deploy & Optimize OpenAI’s Open Source Models",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=45874",
          "author": "Tanvir Kour",
          "description": "What would you do if your website suddenly crashed out of nowhere on the day of your newest product launch? All the existing orders vanish, customer support lines get flooded, and you’ve started trending on Twitter for all the wrong reasons. How quickly could your team respond to get things back on track? Could the […]",
          "link": "https://collabnix.com/why-operational-resilience-is-the-next-competitive-advantage/",
          "publishedOn": "2025-08-06T10:50:40.000Z",
          "wordCount": null,
          "title": "Why Operational Resilience is the Next Competitive Advantage",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=45746",
          "author": "Tanvir Kour",
          "description": "Electronic forms simplify the complex nature of DevOps workflows. Primarily, these tools replace manual tasks with automated processes that save time. And that’s just the tip of the iceberg. In order to understand how exactly this plays out in practice, stick around and we’ll bring you up to speed with everything. Automating Onboarding and User […]",
          "link": "https://collabnix.com/how-electronic-forms-streamline-devops-workflows/",
          "publishedOn": "2025-08-05T12:50:31.000Z",
          "wordCount": null,
          "title": "How Electronic Forms Streamline DevOps Workflows",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=45696",
          "author": "Tanvir Kour",
          "description": "In an era where even your smart fridge could be collecting data, protecting sensitive business information has become far more complicated than just updating antivirus software. While most companies have shored up their digital defences, there is another threat creeping under the radar, one that operates in plain sight, yet often slips by unnoticed. This […]",
          "link": "https://collabnix.com/how-bug-sweeping-can-help-businesses-stay-ahead-of-cyber-threats/",
          "publishedOn": "2025-08-05T10:23:13.000Z",
          "wordCount": null,
          "title": "How Bug Sweeping Can Help Businesses Stay Ahead of Cyber Threats",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=45693",
          "author": "Tanvir Kour",
          "description": "Our technology-driven world has forced businesses to always be on the lookout for ways to increase productivity and decrease costs. Mobile asset management software provides a solution that is less of a burden and more practical for tracking and managing the resources owned by an organization. This tool allows organizations to conduct business without cumbersome […]",
          "link": "https://collabnix.com/cut-costs-with-mobile-asset-management-software/",
          "publishedOn": "2025-08-05T10:16:34.000Z",
          "wordCount": null,
          "title": "Cut Costs with Mobile Asset Management Software",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=45688",
          "author": "Tanvir Kour",
          "description": "Maintaining equipment, machinery, and entire fleets is no small feat. All maintenance managers have dealt with a missed inspection, an emergency repair, or an unscheduled downtime. But what if there were a better way to streamline all of this? A Computerized Maintenance Management System, or CMMS, makes your maintenance processes easier, smoother, and less stressful. […]",
          "link": "https://collabnix.com/cmms-software-meaning-a-deep-dive-into-maintenance-systems/",
          "publishedOn": "2025-08-05T09:26:15.000Z",
          "wordCount": null,
          "title": "CMMS Software Meaning: A Deep Dive Into Maintenance Systems",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=45524",
          "author": "Collabnix Team",
          "description": "Choosing between Claude API and OpenAI API is one of the most critical decisions developers face when building AI-powered applications in 2025. Both platforms offer powerful capabilities, but they excel in different areas and serve different use cases. This comprehensive comparison analyzes both APIs across performance, pricing, features, and real-world applications. We’ll include actual benchmarks, […]",
          "link": "https://collabnix.com/claude-api-vs-openai-api-2025-complete-developer-comparison-with-benchmarks-code-examples/",
          "publishedOn": "2025-08-05T05:00:23.000Z",
          "wordCount": null,
          "title": "Claude API vs OpenAI API 2025: Complete Developer Comparison with Benchmarks & Code Examples",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=45515",
          "author": "Collabnix Team",
          "description": "The Claude API from Anthropic has become one of the most powerful and reliable AI APIs available to developers in 2025. With Claude Sonnet 4 and Claude Opus 4 now available, integrating Claude’s advanced conversational AI capabilities into your applications has never been more accessible. This comprehensive guide covers everything from basic setup to advanced […]",
          "link": "https://collabnix.com/claude-api-integration-guide-2025-complete-developer-tutorial-with-code-examples/",
          "publishedOn": "2025-08-05T04:47:52.000Z",
          "wordCount": null,
          "title": "Claude API Integration Guide 2025: Complete Developer Tutorial with Code Examples",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=45473",
          "author": "Tanvir Kour",
          "description": "Transform Your AI Experience with Ollama’s Game-Changing Desktop Application The wait is over! Ollama has officially launched its Ollama 0.1.0 desktop application for both macOS and Windows, marking a significant milestone in making local AI accessible to everyone. This groundbreaking release transforms how users interact with large language models, moving beyond command-line interfaces to deliver […]",
          "link": "https://collabnix.com/the-new-ollama-0-1-0-desktop-app-revolutionary-local-ai-made-simple-for-mac-and-windows-users/",
          "publishedOn": "2025-08-05T04:00:21.000Z",
          "wordCount": null,
          "title": "The New Ollama 0.1.0 Desktop App: Revolutionary Local AI Made Simple for Mac and Windows Users",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44791",
          "author": "Tanvir Kour",
          "description": "What is Ollama? Ollama is a lightweight, extensible framework for building and running large language models locally. Run LLaMA, Mistral, CodeLlama, and other models on your machine without cloud dependencies. Quick Installation macOS Linux Windows Docker Installation Starting Ollama Service Basic Model Operations Pull Models List Available Models Remove Models Running Models Interactive Chat Single […]",
          "link": "https://collabnix.com/complete-ollama-guide-installation-usage-code-examples/",
          "publishedOn": "2025-08-04T10:01:24.000Z",
          "wordCount": null,
          "title": "Complete Ollama Guide: Installation, Usage & Code Examples",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44783",
          "author": "Collabnix Team",
          "description": "Docker has transformed how R developers build, deploy, and share data science applications, Shiny dashboards, and analytical workflows. With R’s growing adoption in enterprise environments and the rise of containerized data science, mastering Docker for R development is essential for modern statisticians, data scientists, and R developers. Whether you’re containerizing Shiny applications, Plumber APIs, R […]",
          "link": "https://collabnix.com/10-essential-docker-best-practices-for-r-developers-in-2025/",
          "publishedOn": "2025-08-04T03:50:53.000Z",
          "wordCount": null,
          "title": "10 Essential Docker Best Practices for R Developers in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44780",
          "author": "Collabnix Team",
          "description": "Docker has revolutionized how Python developers build, ship, and run applications. With over 13 billion container downloads and Python consistently ranking as one of the top programming languages, mastering Docker for Python development is crucial for modern software engineering. Whether you’re containerizing Django web applications, Flask APIs, or machine learning models, following Docker best practices […]",
          "link": "https://collabnix.com/10-essential-docker-best-practices-for-python-developers-in-2025/",
          "publishedOn": "2025-08-04T03:38:39.000Z",
          "wordCount": null,
          "title": "10 Essential Docker Best Practices for Python Developers in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44777",
          "author": "Collabnix Team",
          "description": "Master Claude Code's command line interface for efficient AI-powered development workflows",
          "link": "https://collabnix.com/claude-code-best-practices-advanced-command-line-ai-development-in-2025/",
          "publishedOn": "2025-08-04T03:29:20.000Z",
          "wordCount": null,
          "title": "Claude Code Best Practices: Advanced Command Line AI Development in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44684",
          "author": "Collabnix Team",
          "description": "Master MCP security with our 2025 guide. Learn authentication, encryption, monitoring & compliance best practices to protect your Model Context Protocol deployments",
          "link": "https://collabnix.com/mcp-security-best-practices-2025/",
          "publishedOn": "2025-08-03T12:14:25.000Z",
          "wordCount": null,
          "title": "MCP Security Best Practices 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44669",
          "author": "Tanvir Kour",
          "description": "In the rapidly evolving world of software development, having the right tools can make the difference between a frustrating coding session and a productive, enjoyable development experience. This comprehensive guide explores the essential “vibe coding tools” that modern developers use to enhance their workflow, boost productivity, and create a more pleasant coding environment. What Are […]",
          "link": "https://collabnix.com/vibe-coding-tools-boost-your-development-experience-in-2025/",
          "publishedOn": "2025-08-03T06:49:47.000Z",
          "wordCount": null,
          "title": "Vibe Coding Tools: Boost Your Development Experience in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44642",
          "author": "Tanvir Kour",
          "description": "Introduction: What is Perplexity AI? Perplexity AI has emerged as a revolutionary AI-powered search engine that’s changing how we find and consume information online. Unlike traditional search engines that return lists of links, Perplexity provides direct, cited answers to your questions using advanced language models. But is it worth the hype? Let’s dive deep into […]",
          "link": "https://collabnix.com/perplexity-ai-review-2025-the-complete-guide-to-pros-cons-and-user-experience/",
          "publishedOn": "2025-08-03T03:43:24.000Z",
          "wordCount": null,
          "title": "Perplexity AI Review 2025: The Complete Guide to Pros, Cons, and User Experience",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44630",
          "author": "Collabnix Team",
          "description": "Streamline your coding workflow with Claude's intelligent command-line assistant that handles complex programming tasks directly from your terminal.",
          "link": "https://collabnix.com/what-is-claude-code-and-what-problem-does-it-solve/",
          "publishedOn": "2025-08-02T18:03:52.000Z",
          "wordCount": null,
          "title": "What is Claude Code and what problem does it solve",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44614",
          "author": "Collabnix Team",
          "description": "Complete guide to deploying Ollama on Kubernetes with Anthropic MCP integration. Learn production best practices, security, scaling, and monitoring for enterprise LLM workloads.",
          "link": "https://collabnix.com/production-ready-llm-infrastructure-deploying-ollama-on-kubernetes-with-anthropic-mcp-best-practices/",
          "publishedOn": "2025-08-02T10:20:49.000Z",
          "wordCount": null,
          "title": "Production-Ready LLM Infrastructure: Deploying Ollama on Kubernetes with Anthropic MCP Best Practices",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44603",
          "author": "Collabnix Team",
          "description": "The AI landscape in 2025 has reached unprecedented maturity, with powerful models becoming essential tools for modern software development. Whether you’re building the next generation of applications, automating complex workflows, or enhancing user experiences, choosing the right AI model can make or break your project. This comprehensive guide examines the top 10 AI models that […]",
          "link": "https://collabnix.com/the-top-10-ai-models-every-developer-should-know-in-2025-a-comprehensive-guide/",
          "publishedOn": "2025-08-02T09:19:17.000Z",
          "wordCount": null,
          "title": "The Top 10 AI Models Every Developer Should Know in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44578",
          "author": "Collabnix Team",
          "description": "Ollama has emerged as one of the most popular tools for running large language models (LLMs) locally, providing developers and organizations with a simple way to deploy and interact with models like Llama, Mistral, and CodeLlama without relying on external APIs. By packaging these powerful AI models into an easy-to-use interface, Ollama democratizes access to […]",
          "link": "https://collabnix.com/getting-started-with-ollama-on-kubernetes/",
          "publishedOn": "2025-08-02T08:57:54.000Z",
          "wordCount": null,
          "title": "Getting Started with Ollama on Kubernetes",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44572",
          "author": "Collabnix Team",
          "description": "Discover 12 actionable Kubernetes cost optimization strategies that leading companies use to reduce cloud spending by up to 60%. Includes real-world examples and implementation guides",
          "link": "https://collabnix.com/kubernetes-cost-optimization-12-proven-strategies-to-cut-your-cloud-bill-by-60-in-2025/",
          "publishedOn": "2025-08-02T08:20:09.000Z",
          "wordCount": null,
          "title": "Kubernetes Cost Optimization: 12 Proven Strategies to Cut Your Cloud Bill by 60% in 2025",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44489",
          "author": "Collabnix Team",
          "description": "What is MCP Inspector? Your Gateway to Seamless MCP Development MCP Inspector is a powerful development and debugging tool that comes built-in with the Model Context Protocol (MCP) SDK. As part of the MCP ecosystem, this inspector tool provides developers with real-time insights into their MCP server implementations, making it easier to build, test, and […]",
          "link": "https://collabnix.com/mcp-inspector-the-ultimate-developer-tool-for-debugging-model-context-protocol-servers/",
          "publishedOn": "2025-08-01T18:47:34.000Z",
          "wordCount": null,
          "title": "MCP Inspector: The Ultimate Developer Tool for Debugging Model Context Protocol Servers",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=44213",
          "author": "Tanvir Kour",
          "description": "In today’s fast-paced digital world, the insurance industry is undergoing a profound transformation driven by technological innovation. To stay competitive, insurance companies are increasingly turning to custom insurance software development tailored specifically to their unique business needs. Engaging with a trusted insurance software development company can provide insurers with solutions that improve operational efficiency, enhance […]",
          "link": "https://collabnix.com/what-are-the-key-features-of-custom-insurance-software/",
          "publishedOn": "2025-07-31T15:34:58.000Z",
          "wordCount": null,
          "title": "What Are the Key Features of Custom Insurance Software?",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=43965",
          "author": "Collabnix Team",
          "description": "Software errors in medical devices can cost more than time – they can cost lives. That’s why manufacturers increasingly rely on code review as a service to meet the stringent quality demands of regulatory bodies like the FDA, EMA, and ISO. For software-driven medical equipment – whether it’s an infusion pump, diagnostic scanner, or wearable […]",
          "link": "https://collabnix.com/code-review-in-medical-device-software-ensuring-safety-through-precision/",
          "publishedOn": "2025-07-30T17:06:32.000Z",
          "wordCount": null,
          "title": "Code Review in Medical Device Software: Ensuring Safety Through Precision",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=43918",
          "author": "Collabnix Team",
          "description": "Learn how to build production-ready MCP servers with OAuth 2.1 security, Kubernetes scaling, and enterprise-grade observability. Complete guide with code examples and best practices.",
          "link": "https://collabnix.com/building-secure-and-scalable-remote-mcp-servers-a-complete-production-guide/",
          "publishedOn": "2025-07-30T08:08:45.000Z",
          "wordCount": null,
          "title": "Building Secure Remote MCP Servers: A Complete Guide",
          "imageUrl": null
        },
        {
          "id": "https://collabnix.com/?p=43317",
          "author": "Collabnix Team",
          "description": "Kubernetes has become the backbone of modern container orchestration, powering everything from microservices architectures to enterprise-scale applications. However, managing agents across distributed Kubernetes clusters remains a complex challenge that many DevOps teams struggle with daily. Enter Kagents – a revolutionary approach to Kubernetes agent management that’s transforming how organizations deploy, monitor, and maintain their containerized […]",
          "link": "https://collabnix.com/kagents-revolutionizing-kubernetes-agent-management-for-modern-container-orchestration/",
          "publishedOn": "2025-07-27T02:57:53.000Z",
          "wordCount": null,
          "title": "Kagents: Revolutionizing Kubernetes Agent Management for Modern Container Orchestration",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Limboy's Essays",
      "feedUrl": "https://limboy.me/index.xml",
      "siteUrl": "https://limboy.me/",
      "articles": [
        {
          "id": "https://limboy.me/posts/review-system",
          "author": null,
          "description": "未经审视的人生是不值得过的。",
          "link": "https://limboy.me/posts/review-system",
          "publishedOn": "2025-10-17T00:00:00.000Z",
          "wordCount": 155,
          "title": "构建自己的反思系统",
          "imageUrl": null
        },
        {
          "id": "https://limboy.me/posts/before-town-v2",
          "author": null,
          "description": "关于避风塘这个网站的由来，可以见我之前的一篇文章，主要是方便有发布日常/想法的诉求，又缺少合适载体的同学。这次升级让它变得更丰富了些。",
          "link": "https://limboy.me/posts/before-town-v2",
          "publishedOn": "2025-09-24T00:00:00.000Z",
          "wordCount": 181,
          "title": "避风塘 V2",
          "imageUrl": null
        },
        {
          "id": "https://limboy.me/books/born-a-crime",
          "author": null,
          "description": "这本书的核心是诺亚与他母亲帕特里夏的深厚关系。她是一位极具韧性、虔诚且思想独立的女性，用智慧、幽默和坚定的爱武装特雷弗，教他如何利用语言和思想去打破种族和社会的壁垒。因为他的特殊身份，加上淘气的天性，结合南非当时的社会环境，让他的童年和青少年总是在滑稽可笑和惊心动魄之间切换：被母亲从行驶的汽车中扔出以躲避危险；在不同社区间利用语言优势游刃有余；从经营盗版CD生意，到与家暴的继父斗争等等。",
          "link": "https://limboy.me/books/born-a-crime",
          "publishedOn": "2025-08-02T00:00:00.000Z",
          "wordCount": null,
          "title": "天生有罪",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "This Cute World",
      "feedUrl": "https://thiscute.world/index.xml",
      "siteUrl": "https://thiscute.world/",
      "articles": [
        {
          "id": "https://thiscute.world/posts/linux-desktop-6-shutdown-troubleshooting/?utm_source=atom_feed",
          "author": null,
          "description": "<blockquote>\n<p><strong>AI 创作声明</strong>：本系列文章由笔者借助 ChatGPT, Kimi K2, 豆包和 Cursor 等 AI 工具创作，有很大篇幅的内容完全由 AI 在我的指导下生成。如有错误，还请指正。</p>\n</blockquote><h2 id=\"前言\" class=\"headerLink\">\n<a href=\"#%e5%89%8d%e8%a8%80\" class=\"header-mark\"></a>前言</h2><p>系统关机看似简单，但背后涉及了繁杂的资源清理和状态管理过程。当你点击关机按钮，系统却卡在那里不动，或者出现各种奇怪的错误信息时，理解关机流程和故障排查方法就显得尤为重要。</p>\n<p>除了关机，Linux 还提供了休眠和挂起两种重要的电源管理功能，它们可以让系统快速进入低功耗状态，同时保持工作状态，是日常使用中非常实用的功能。</p>",
          "link": "https://thiscute.world/posts/linux-desktop-6-shutdown-troubleshooting/?utm_source=atom_feed",
          "publishedOn": "2025-10-19T02:22:33.000Z",
          "wordCount": 929,
          "title": "Linux 桌面系统故障排查指南（六） - 系统关机与电源管理",
          "imageUrl": "https://thiscute.world/posts/linux-desktop-6-shutdown-troubleshooting/featured-image.webp"
        },
        {
          "id": "https://thiscute.world/posts/linux-desktop-5-network/?utm_source=atom_feed",
          "author": null,
          "description": "<blockquote>\n<p><strong>AI 创作声明</strong>：本系列文章由笔者借助 ChatGPT, Kimi K2, 豆包和 Cursor 等 AI 工具创作，有很大篇幅的内容完全由 AI 在我的指导下生成。如有错误，还请指正。</p>\n</blockquote><h2 id=\"前言\" class=\"headerLink\">\n<a href=\"#%e5%89%8d%e8%a8%80\" class=\"header-mark\"></a>前言</h2><p>网络连接是现代桌面的基础功能，涉及硬件驱动、固件加载、网络管理和 DNS 解析等多个环节。</p>\n<p>本文将从网卡驱动开始，经过内核网络栈，到达应用层，了解 Linux 网络系统的完整架构，包括如何配置网络连接，如何设置防火墙规则，以及如何诊断各种网络问题。</p>",
          "link": "https://thiscute.world/posts/linux-desktop-5-network/?utm_source=atom_feed",
          "publishedOn": "2025-10-19T02:21:33.000Z",
          "wordCount": 1508,
          "title": "Linux 桌面系统故障排查指南（五） - 网络",
          "imageUrl": "https://thiscute.world/posts/linux-desktop-5-network/featured-image.webp"
        },
        {
          "id": "https://thiscute.world/posts/linux-desktop-4-multimedia-input/?utm_source=atom_feed",
          "author": null,
          "description": "<blockquote>\n<p><strong>AI 创作声明</strong>：本系列文章由笔者借助 ChatGPT, Kimi K2, 豆包和 Cursor 等 AI 工具创作，有很大篇幅的内容完全由 AI 在我的指导下生成。如有错误，还请指正。</p>\n</blockquote><h2 id=\"前言\" class=\"headerLink\">\n<a href=\"#%e5%89%8d%e8%a8%80\" class=\"header-mark\"></a>前言</h2><p>Linux 桌面系统的多媒体处理和中文支持涉及多个子系统。音频延迟、字体渲染质量、输入法响应速度等问题看似简单，背后却涉及 PipeWire、fontconfig、fcitx5 等多个组件的协同工作。</p>",
          "link": "https://thiscute.world/posts/linux-desktop-4-multimedia-input/?utm_source=atom_feed",
          "publishedOn": "2025-10-19T02:20:33.000Z",
          "wordCount": 1615,
          "title": "Linux 桌面系统故障排查指南（四） - 多媒体处理与中文支持",
          "imageUrl": "https://thiscute.world/posts/linux-desktop-4-multimedia-input/featured-image.webp"
        },
        {
          "id": "https://thiscute.world/posts/linux-desktop-3-session-graphics/?utm_source=atom_feed",
          "author": null,
          "description": "<blockquote>\n<p><strong>AI 创作声明</strong>：本系列文章由笔者借助 ChatGPT, Kimi K2, 豆包和 Cursor 等 AI 工具创作，有很大篇幅的内容完全由 AI 在我的指导下生成。如有错误，还请指正。</p>\n</blockquote><h2 id=\"前言\" class=\"headerLink\">\n<a href=\"#%e5%89%8d%e8%a8%80\" class=\"header-mark\"></a>前言</h2><p>Systemd 及各项系统服务启动后会进入登录页面，从这一捕开始的 Linux 桌面使用过程涉及会话管理、窗口合成、图形渲染和输入处理等多个组件。</p>",
          "link": "https://thiscute.world/posts/linux-desktop-3-session-graphics/?utm_source=atom_feed",
          "publishedOn": "2025-10-19T02:19:33.000Z",
          "wordCount": 1308,
          "title": "Linux 桌面系统故障排查指南（三） - 桌面会话与图形渲染",
          "imageUrl": "https://thiscute.world/posts/linux-desktop-3-session-graphics/featured-image.webp"
        },
        {
          "id": "https://thiscute.world/posts/linux-desktop-2-systemd-services/?utm_source=atom_feed",
          "author": null,
          "description": "<blockquote>\n<p><strong>AI 创作声明</strong>：本系列文章由笔者借助 ChatGPT, Kimi K2, 豆包和 Cursor 等 AI 工具创作，有很大篇幅的内容完全由 AI 在我的指导下生成。如有错误，还请指正。</p>\n</blockquote><h2 id=\"概述\" class=\"headerLink\">\n<a href=\"#%e6%a6%82%e8%bf%b0\" class=\"header-mark\"></a>概述</h2><p>本文是《Linux 桌面系统故障排查指南》系列的第二篇，专注于 systemd 生态系统与服务管理。在上一篇中，我们了解了系统启动与安全框架，现在让我们深入探讨 systemd 核心功能以及 systemd 生态系统中的各个专门化组件。</p>",
          "link": "https://thiscute.world/posts/linux-desktop-2-systemd-services/?utm_source=atom_feed",
          "publishedOn": "2025-10-19T02:18:33.000Z",
          "wordCount": 2247,
          "title": "Linux 桌面系统故障排查指南（二） - systemd 全家桶与服务管理",
          "imageUrl": "https://thiscute.world/posts/linux-desktop-2-systemd-services/featured-image.webp"
        },
        {
          "id": "https://thiscute.world/posts/linux-desktop-1-boot-security/?utm_source=atom_feed",
          "author": null,
          "description": "<blockquote>\n<p><strong>AI 创作声明</strong>：本系列文章由笔者借助 ChatGPT, Kimi K2, 豆包和 Cursor 等 AI 工具创作，有很大篇幅的内容完全由 AI 在我的指导下生成。如有错误，还请指正。</p>\n</blockquote><h2 id=\"前言\" class=\"headerLink\">\n<a href=\"#%e5%89%8d%e8%a8%80\" class=\"header-mark\"></a>前言</h2><p>本文将简要介绍 Linux 桌面系统的启动机制，从 UEFI 引导到内核加载，从 initramfs 到 systemd\n服务启动，再到桌面环境加载。同时还会探讨系统的安全框架，了解 PAM、PolicyKit 等组件如何保护系统安全。</p>",
          "link": "https://thiscute.world/posts/linux-desktop-1-boot-security/?utm_source=atom_feed",
          "publishedOn": "2025-10-19T02:17:33.000Z",
          "wordCount": 2090,
          "title": "Linux 桌面系统故障排查指南（一） - 系统启动与安全框架",
          "imageUrl": "https://thiscute.world/posts/linux-desktop-1-boot-security/featured-image.webp"
        },
        {
          "id": "https://thiscute.world/posts/linux-desktop-explained/?utm_source=atom_feed",
          "author": null,
          "description": "<h2 id=\"定位与目标\" class=\"headerLink\">\n<a href=\"#%e5%ae%9a%e4%bd%8d%e4%b8%8e%e7%9b%ae%e6%a0%87\" class=\"header-mark\"></a>定位与目标</h2><p>Linux 桌面包含了相当多的系统组件，这些组件组合形成了一个精密的系统，它们共同管理着从硬件设备到用户会话的方方面面。</p>\n<p>即使我已经有七八年的 Linux 使用经验，在遇到系统的各种大小毛病时，还是常常觉得问题的定位跟解决很是艰难。倘若我们能像庖丁那样“目无全牛”，对整个系统的架构了如指掌，在定位问题时顺着骨节筋脉下刀，那解决起问题来自然也将游刃有余。</p>",
          "link": "https://thiscute.world/posts/linux-desktop-explained/?utm_source=atom_feed",
          "publishedOn": "2025-09-09T12:17:33.000Z",
          "wordCount": 4693,
          "title": "Linux 桌面系统组件概览与故障排查指南",
          "imageUrl": "https://thiscute.world/posts/linux-desktop-explained/featured-image.webp"
        }
      ]
    },
    {
      "title": "一颗小树",
      "feedUrl": "https://yeshu.cloud/rss.xml",
      "siteUrl": "https://yeshu.cloud/",
      "articles": [
        {
          "id": "https://yeshu.cloud/posts/newsletter-137/",
          "author": null,
          "description": "真正的突破，往往不是来自于对旧问题的更优解，而是来自于对新问题的勇敢定义。",
          "link": "https://yeshu.cloud/posts/newsletter-137/",
          "publishedOn": "2025-10-19T13:19:39.000Z",
          "wordCount": 235,
          "title": "AI 下半场",
          "imageUrl": "https://yeshu.cloud/images/android-chrome-192x192.png"
        },
        {
          "id": "https://yeshu.cloud/posts/mobx-memory-learning/",
          "author": null,
          "description": "知其然，还要知其所以然。",
          "link": "https://yeshu.cloud/posts/mobx-memory-learning/",
          "publishedOn": "2025-09-07T09:46:51.000Z",
          "wordCount": 771,
          "title": "MobX 核心机制探究",
          "imageUrl": "https://yeshu.cloud/images/android-chrome-192x192.png"
        },
        {
          "id": "https://yeshu.cloud/posts/newsletter-136/",
          "author": null,
          "description": "融入团队的关键，不是被动等待适应，而是主动创造价值。",
          "link": "https://yeshu.cloud/posts/newsletter-136/",
          "publishedOn": "2025-08-31T13:10:22.000Z",
          "wordCount": null,
          "title": "如何快速融入新团队",
          "imageUrl": null
        },
        {
          "id": "https://yeshu.cloud/posts/newsletter-135/",
          "author": null,
          "description": "给自己营造一个可以持续下去的环境。",
          "link": "https://yeshu.cloud/posts/newsletter-135/",
          "publishedOn": "2025-08-17T08:51:20.000Z",
          "wordCount": null,
          "title": "习惯养成的一点新实践",
          "imageUrl": null
        },
        {
          "id": "https://yeshu.cloud/posts/leave-first-job/",
          "author": null,
          "description": "和第一份工作认真告个别。",
          "link": "https://yeshu.cloud/posts/leave-first-job/",
          "publishedOn": "2025-07-27T09:46:51.000Z",
          "wordCount": null,
          "title": "阿里七年，小树毕业了",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "拾月",
      "feedUrl": "https://www.skyue.com/feed/",
      "siteUrl": "https://www.skyue.com/",
      "articles": [
        {
          "id": "https://www.skyue.com/25102113.html",
          "author": "拾月",
          "description": "周末两天到南京玩，纯citywalk。",
          "link": "https://www.skyue.com/25102113.html",
          "publishedOn": "2025-10-21T05:45:00.000Z",
          "wordCount": 564,
          "title": "南京两日游",
          "imageUrl": ""
        },
        {
          "id": "https://www.skyue.com/25100816.html",
          "author": "拾月",
          "description": "第一篇装修日记写于3月，介绍了装修前期各项准备工作，历时7个月，硬装终于搞。",
          "link": "https://www.skyue.com/25100816.html",
          "publishedOn": "2025-10-08T08:08:00.000Z",
          "wordCount": 621,
          "title": "装修日记（2）：硬装",
          "imageUrl": ""
        },
        {
          "id": "https://www.skyue.com/25100716.html",
          "author": "拾月",
          "description": "昨天中秋节，到金沙湖大剧院看了呼兰的《草台班子》专场。",
          "link": "https://www.skyue.com/25100716.html",
          "publishedOn": "2025-10-07T08:14:00.000Z",
          "wordCount": null,
          "title": "呼兰的《草台班子》专场",
          "imageUrl": null
        },
        {
          "id": "https://www.skyue.com/25100715.html",
          "author": "拾月",
          "description": "最近几天研究把博客从Typecho迁移到Wordpress，数据全部完成了迁移，也实现了Obsidian发布到Wordpress的Python脚本（对标此前实现的Typecho版本）。回头看，W...",
          "link": "https://www.skyue.com/25100715.html",
          "publishedOn": "2025-10-07T07:09:00.000Z",
          "wordCount": null,
          "title": "博客从Typecho迁移到Wordpress",
          "imageUrl": null
        },
        {
          "id": "https://www.skyue.com/25100419.html",
          "author": "拾月",
          "description": "今天上午去姨和小舅家，每次看到小舅都让我觉得命运之无常。",
          "link": "https://www.skyue.com/25100419.html",
          "publishedOn": "2025-10-04T11:55:00.000Z",
          "wordCount": null,
          "title": "小舅",
          "imageUrl": null
        },
        {
          "id": "https://www.skyue.com/25092907.html",
          "author": "拾月",
          "description": "本周完成了新家硬装的验收，硬装基本完成，剩些修修补补的事。我们为有财有福留的猫洞，是全屋最个性化的部分。",
          "link": "https://www.skyue.com/25092907.html",
          "publishedOn": "2025-09-28T23:07:00.000Z",
          "wordCount": null,
          "title": "2025W38：新家的猫洞",
          "imageUrl": null
        },
        {
          "id": "https://www.skyue.com/25092207.html",
          "author": "拾月",
          "description": "要搬工区了，周五是浙大森林A座lastday，傍晚到楼下拍照留念。",
          "link": "https://www.skyue.com/25092207.html",
          "publishedOn": "2025-09-21T23:07:00.000Z",
          "wordCount": null,
          "title": "2025W37：浙大森林A座",
          "imageUrl": null
        },
        {
          "id": "https://www.skyue.com/25091507.html",
          "author": "拾月",
          "description": "周三午休，到园区瑞幸喝咖啡，下起暴雨，公司就在眼前却回不去。",
          "link": "https://www.skyue.com/25091507.html",
          "publishedOn": "2025-09-14T23:07:00.000Z",
          "wordCount": null,
          "title": "2025W36：喝咖啡，遇暴雨",
          "imageUrl": null
        },
        {
          "id": "https://www.skyue.com/25091409.html",
          "author": "拾月",
          "description": "昨天到杨公堤15号体验，跟着导航从天目山路突然拐进飞达巷，途经蚂蚁Z空间，勾起了很多回忆。",
          "link": "https://www.skyue.com/25091409.html",
          "publishedOn": "2025-09-14T01:40:00.000Z",
          "wordCount": null,
          "title": "飞达巷",
          "imageUrl": null
        },
        {
          "id": "https://www.skyue.com/25090807.html",
          "author": "拾月",
          "description": "周二是我和南瓜认识两周年、求婚一周年的日子，下班约美瑭广场吃烤肉，赴约路上看到彩虹。 ​​​",
          "link": "https://www.skyue.com/25090807.html",
          "publishedOn": "2025-09-07T23:07:00.000Z",
          "wordCount": null,
          "title": "2025W35：彩虹",
          "imageUrl": null
        },
        {
          "id": "https://www.skyue.com/25090107.html",
          "author": "拾月",
          "description": "周五上班时，瞥了一眼窗外，看到如下场景，联想到很多电影中拍的高楼林立的空镜，既摩登又压抑。",
          "link": "https://www.skyue.com/25090107.html",
          "publishedOn": "2025-08-31T23:07:00.000Z",
          "wordCount": null,
          "title": "2025W34：高楼林立",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "云心怀鹤",
      "feedUrl": "https://bluehe.cn/rss.xml",
      "siteUrl": "https://bluehe.cn/",
      "articles": [
        {
          "id": "https://bluehe.cn/archives/251012-diary",
          "author": "寻鹤",
          "description": "聚餐\n \n把最近五个月的生活叙述整理下，端午节也就是5月31日，同学一直约我出来，我之前婉拒了两次，俗话说事不过三，应邀见面，这是毕业后的为数不多的见面，我们关系很好，在大学图书馆一起学习，期末考试时，我很佩服她做笔记的能力，许多知识点我还在逐条背时，她已经汇总出来了，握住她的 “宝典” ppt，真的让我考试难度降低了一半，学起来也不吃力了。在校由于我们的导师是同一位，所以有很多的共同话题，但五月...",
          "link": "https://bluehe.cn/archives/251012-diary",
          "publishedOn": "2025-10-12T10:22:00.000Z",
          "wordCount": 593,
          "title": "于日常处 · 十月记",
          "enclosure": {
            "url": "https://bluehe.cn/usr/uploads/2025/10/CRnall_20250706_175813899.webp",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://bluehe.cn/usr/uploads/2025/10/CRnall_20250706_175813899.webp"
        },
        {
          "id": "https://bluehe.cn/archives/5938",
          "author": "luhan",
          "description": "大师阿迪斯\n...",
          "link": "https://bluehe.cn/archives/5938",
          "publishedOn": "2025-10-11T12:29:00.000Z",
          "wordCount": 561,
          "title": "未命名文档",
          "imageUrl": null
        },
        {
          "id": "https://bluehe.cn/archives/snapic-just-640px",
          "author": "寻鹤",
          "description": "Snapic Just 640px是我在用的主题，作者更新很快，但一些修改只能在文件修，所以来总结一下我全部的设置。\n\nLopwon：不推荐从外部引入字体，访问不顺畅会导致自己的页面加载受阻，如果非得使用，需要放置在主题本身的 css 文件之下，也就是在 head 标签内的最下方，以覆盖主题 css 中的字体设置。\n\n\n1、我是直接在head.php的< head >部分填写以下代码：...",
          "link": "https://bluehe.cn/archives/snapic-just-640px",
          "publishedOn": "2025-10-09T13:18:00.000Z",
          "wordCount": 1055,
          "title": "Snapic Just 640px 主题入门",
          "enclosure": {
            "url": "https://bluehe.cn/usr/uploads/2025/10/f2434028-185e.webp",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://bluehe.cn/usr/uploads/2025/10/f2434028-185e.webp"
        },
        {
          "id": "https://bluehe.cn/archives/nanning-flower-sea",
          "author": "寻鹤",
          "description": "9月14日，周末想找个地方散步，在小红书搜索了一下南宁周末好去处，看到南宁园博园粉黛花海已经开了，而且今天是教师节福利的最后一天，可以免门票，还可以凭借教师证件以半票的价格且五人入园。\n\n园博园的位置挺远，所以没有活动的时候人流量是很少的，我乘坐BRT公交车直达景区东门口，这辆公交车前面没有问题，后面居然直接停了，有人等不及直接下车步行前往，司机还把后盖给打开散热，又是打电话求助工程师，到后面空调...",
          "link": "https://bluehe.cn/archives/nanning-flower-sea",
          "publishedOn": "2025-10-03T16:38:00.000Z",
          "wordCount": 658,
          "title": "粉黛花海游记",
          "enclosure": {
            "url": "https://bluehe.cn/usr/uploads/2025/10/P20250914-161902_1.webp",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://bluehe.cn/usr/uploads/2025/10/P20250914-161902_1.webp"
        },
        {
          "id": "https://bluehe.cn/archives/people-park-lucky",
          "author": "寻鹤",
          "description": "毕业后似乎失去了保护一般，也面临着就业压力，虽然说大四的时候就应该找好实习工作，在努力争取转正，这便是最好的结局。不可能总是如此幸运，在小国企实习了三个月，项目接近尾声，我已经预感到无法转正了，领导让我决定是否在继续工作两个月，我拒绝了，这不是我所期望的。在南宁这座城市不断的寻找工作，也曾想前往广州深圳寻找发展机会，出去总归需要勇气，一张车票就可以前往，我更喜欢有规划性的做好准备，而不是说走就走。...",
          "link": "https://bluehe.cn/archives/people-park-lucky",
          "publishedOn": "2025-09-13T08:24:00.000Z",
          "wordCount": null,
          "title": "寻找公园里的幸运",
          "enclosure": {
            "url": "https://bluehe.cn/usr/uploads/2025/09/2477840953.jpg",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://bluehe.cn/usr/uploads/2025/09/2477840953.jpg"
        },
        {
          "id": "https://bluehe.cn/archives/nanning-yongjiang",
          "author": "寻鹤",
          "description": "刷到了“世纪晚霞”的帖子，我也经不起诱惑，在8月2日前往，天气虽然炎热，在等待的时候逛起了我从未涉足的南宁古城墙区域，真别说，别有一番风景，几颗大树提供了遮风挡雨，来来往往的骑行人员、一步迈着一步慢跑的人员、江岸边钓鱼人青年、江岸跳水的人群、江上划着皮划艇的南男女女，以及那不没有晚霞的日落，这就是那天的收获。\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n...",
          "link": "https://bluehe.cn/archives/nanning-yongjiang",
          "publishedOn": "2025-08-10T07:44:00.000Z",
          "wordCount": null,
          "title": "邕江沿岸",
          "enclosure": {
            "url": "https://bluehe.cn/usr/uploads/2025/08/3603911509.jpg",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://bluehe.cn/usr/uploads/2025/08/3603911509.jpg"
        }
      ]
    },
    {
      "title": "东评西就",
      "feedUrl": "https://dongjunke.cn/atom.xml",
      "siteUrl": "https://dongjunke.cn/atom.xml",
      "articles": [
        {
          "id": "https://dongjunke.cn/posts/2025/10/11/33842.html",
          "author": null,
          "description": "<p>食草堂是当代艺术家牛印合在1997年创立的手工皮具品牌。坐落在我老家鹿泉区的食草堂，与其说是一家食草堂的工厂店，不如是一座艺术园区，因为园区里还有很多工业遗迹，印象中这里最早是个锅炉厂，园区里还有一些艺术家本人策划的艺术展览和艺术馆。</p>\n<p>似乎艺术家对机车情有独钟",
          "link": "https://dongjunke.cn/posts/2025/10/11/33842.html",
          "publishedOn": "2025-10-11T13:08:56.000Z",
          "wordCount": 436,
          "title": "食草堂",
          "imageUrl": "https://pic.587804.xyz/pic/20251011210414.webp"
        },
        {
          "id": "https://dongjunke.cn/posts/2025/10/04/58899.html",
          "author": null,
          "description": "<p>人到中年，总会遇到自己的苏东坡。</p>\n<p>苏东坡与栾城的渊源，还要从苏味道说起。唐代文学家苏味道生于栾城，是苏轼的第十一世祖，武则天时期曾三度为相，中宗时，被贬为眉州刺史，又改益州长史，最后死在任上。苏味道归葬故里，留下一子在眉州成家，传到眉山苏氏一支，到了十、十一代",
          "link": "https://dongjunke.cn/posts/2025/10/04/58899.html",
          "publishedOn": "2025-10-04T13:35:34.000Z",
          "wordCount": 437,
          "title": "苏自栾城，西宅于眉",
          "imageUrl": "https://pic.587804.xyz/pic/20251004222358.png"
        }
      ]
    },
    {
      "title": "Bensz",
      "feedUrl": "https://blognas.hwb0307.com/feed",
      "siteUrl": "https://blognas.hwb0307.com/",
      "articles": [
        {
          "id": "https://blognas.hwb0307.com/?p=6475",
          "author": "Bensz",
          "description": "Bensz\n前沿快讯 第74期 Arc研究所发起虚拟细胞挑战赛等\n本博客由Faconhost大力赞助！如何更快地访问本站？有需要可加电报群获得更多帮助。本博客用什么VPS？创作不易，请支持苯苯！推荐购买本博客的VIP喔，10元/年即可畅享所有VIP专属内容！ 前言 本文是前沿快讯的第74期。前沿快讯栏目主要收集一些个人感兴趣的近期发表的研究，关注领域包括肿瘤的分子生物学、临床研究、流行病学等，文献类型主要是期刊论文和综述。研究介绍在Google机翻摘要的基础上进行微调，可能不一定特别准确、专业，主要目的是方便自己和大家快速了解和回顾相关领域研究进展。如果你对某个研究的细节感兴趣，请自行寻找全文进一步了解。此外，研究根据子领域会进一步细分，不过交叉领域的研究不好分为某一类，所以这个分类主要用于初级索引，并不十分准确，不喜勿喷。最后，大家看到什么特别的研究，也可以在评论区向我推荐，我会酌情收录在后面的期刊中。如无意外，前沿快讯栏目会长期更新，周期为2周-1月 […]\nBensz",
          "link": "https://blognas.hwb0307.com/medicine/6475",
          "publishedOn": "2025-09-30T14:25:43.000Z",
          "wordCount": 8931,
          "title": "前沿快讯 第74期 Arc研究所发起虚拟细胞挑战赛等",
          "imageUrl": "https://chevereto.hwb0307.com/images/2025/07/05/image-20250705170737633.png"
        },
        {
          "id": "https://blognas.hwb0307.com/?p=6463",
          "author": "Bensz",
          "description": "Bensz\nApple系列 2025年你是否需要iPhone 17？\n本博客由Faconhost大力赞助！如何更快地访问本站？有需要可加电报群获得更多帮助。本博客用什么VPS？创作不易，请支持苯苯！推荐购买本博客的VIP喔，10元/年即可畅享所有VIP专属内容！ 前言 随着极客湾发布了对iPhone17系列的评测，相信很多小伙伴都已经感受到了iPhone 17系列相比前两代所带来的巨大升级。作为一个iPhone 15 Pro Max机主，我也有比较强的换机冲动；使用更老机型的小伙伴类似的冲动或许更加强烈。许多从来没有使用过iPhone的安卓/鸿蒙小伙伴在听闻iPhone 17数字版的“巨大升级”后，也会考虑是否有必要购入1台尝鲜甚至是当主力机。作为一名在苹果生态浸淫多年的iPhone安卓双持用户，我想系统地整理、归纳一些关键信息，以分析在2025年有哪些小伙伴可能需要iPhone 17系列 (～￣▽￣)～ 个人建议 iPhone 18相比iPhone 17的 […]\nBensz",
          "link": "https://blognas.hwb0307.com/apple/6463",
          "publishedOn": "2025-09-20T14:12:51.000Z",
          "wordCount": null,
          "title": "Apple系列 2025年你是否需要iPhone 17？",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Andy烧麦 - 成熟，聪明，豁达的人什么也不问 过去，现在，将来…",
      "feedUrl": "https://4311346.com/index.xml",
      "siteUrl": "https://4311346.com/",
      "articles": [
        {
          "id": "https://4311346.com/post/2025/1012-one-week.html",
          "author": null,
          "description": "奶奶仙逝，享年九十二岁，算得上是人们口中的喜丧，福寿双全。从小就和奶奶生活在一个园区内，距离很近。小学时的其中几年暑假，每天白天都会被送往奶奶家被照顾。\n1981年爷爷就离世了，所以之后出生的我，至今就不知道爷爷是什么样，印象中的奶奶，一直是退休状态，每天在园区内赛晒晒太阳，打打牌，一直很安逸。\n奶奶这一辈子都在部级单位，一直都很幸福，身体特别好，也很少去医院。只是2023年小叔离世后，因为房子的事情和小叔的儿子关系比较紧张，也生了很多的气，但没办法解决。\n10月02日在雨夜驾车从南到北翻越秦岭后，立即返回武汉，也都未能见到奶奶最后一面。\n离别往往就是一瞬间的事，40岁开始，身边离世的人，就开始慢慢频繁了，最后就都是自己…\n通宵开车往返2000公里+离世守夜+上坟，基本又是三天没睡，过完中秋节就回公司上班了，处理了几件大事后，压力稍稍缓解了下，但还是一个字 累！\n节后的周末，就一天休，却在家里加班了一天。\n人在低谷时最不能亏待的就是自己\n走了~",
          "link": "https://4311346.com/post/2025/1012-one-week.html",
          "publishedOn": "2025-10-12T15:16:39.000Z",
          "wordCount": 206,
          "title": "2025年国庆节后的一周",
          "imageUrl": null
        },
        {
          "id": "https://4311346.com/post/2025/1008-ql.html",
          "author": null,
          "description": "国庆前最后的一个工作日加班到深夜回家，也不想10月01日当天在外凑热闹，拖拖拉拉到10月02日的中午才出发，虽然沃尔沃S60国庆出发前做了很多的准备，但只到上车那一刻，才决定最终往那走…\n\n麒麟大口茶，是街道口银泰内刚开的一家，云南风味的茶，全店就一个单品，第一口上去未到怪怪的，下次去云南再喝喝其它品种看看。\n楼下酸奶，武商梦时代内新开，做得很好看，有香港丝袜奶茶的口感和味道。\n\n不知道吃啥，最终还是在来菜吃的，就别管它是不是预制菜了，怎么吃都会有后悔。\n10月01号当天，吃吃逛逛，买了点零食，就准备次日出发。\n10月02日起床已经是上午10点，12点30分折腾出门，一路西北方向，出武汉市区，就开始下雨，而这场雨也基本上覆盖了整个奇葩的旅途。因为有雨，所以天黑得特别的早，16点左右自动大灯就已自动开启了照明模式，而此时也刚刚通过十堰市附近的武当山收费站，后面的200公里山路，也就是中国的南北分界线秦岭。\n\nMANER长途必备，服务区有KFC，能解决吃饭问题。\n\nG70福银高速，安陆服务区，有一辆功臣号坦克，但下着雨，人也多，就没怎么看。过了十堰武当山之后，天就基本黑了。\n早在2024年 武汉-敦煌，自驾青甘大环线之旅 时，就走过这条线路，但这次是夜晚，而且下着雨，还有各种大货车。\nG70福银高速穿越秦岭的一段，是穿越秦岭最优质的路线之一，一路风景很美，只可惜这次是夜晚还下着雨，最终在距离西安80公里的蓝田服务区咪了会。\n24小时后本着不走回头路的想法，选择G40沪陕高速再次在雨中穿越秦岭从西安返回武汉，安全起见基本上除部分隧道限速80外，基本是压着120的时速跑，偶尔超车到140的速度，雨天很爽，只是这油耗和轮胎损耗，确实比常规高速要略高一点。\n雨天高速油耗会更高\n这一路往返共1557公里，加了680元油，平均每公里 0.44元，看来高速雨天的行驶成本会略高\n雨天轮胎磨损会更大\n当然除了油耗外，雨天行驶汽车轮胎的磨损也会更大 Michelin PRIMACY 4 是 S60的原厂配置轮胎，本身就很软，轮胎含有天然橡胶在雨天会吸收水分后会更加的软，所以导致硬度下降除了更容易被尖锐物品刺破外，雨天的路面摩擦力更小，而车辆行驶和刹车所需要的摩擦力度则会加大，反而造成轮胎更快的磨损。\n\n出秦岭一段38.8公里的下山路，百公里油耗 3.3升，是这台沃尔沃最低的一次，比起德令哈到西宁都低。\n当然平时驾车习惯就不会让轮胎磨损太快，本着能不踩刹车时，绝不多踩一脚。所以即使是轮胎5年的日历寿命差不多时，一般轮胎的排水防滑沟槽还挺深，毕竟每年长途需求还挺多，轮胎上绝不能含糊。\n长安24时辰\n在蓝田服务区眯了会，就被秦岭深处的寒气冻醒，此时凌晨5点，车外温度10度，而自己只有短裤短袖… 洗把脸继续将车开到了西安。好在10月03日的上午没下雨，能让我逛个南门早市、城墙、钟鼓楼和回民街，下午回酒店咪了会，晚上逛了下大唐不夜城，次日一早，就急匆匆的往武汉赶。\n不得不临时终止本次行程，还没到下一站甘南天水，就提前返回武汉，然后~ 自己的2025年国庆中秋假期也就这么过去了。\n这是连续第4年，第N次来西安，看来是真的喜欢这里\n\n西安城墙下奈雪的茶，本地奶茶-茶话弄，还有石榴汁确实好喝\n\n南门早市人真的多，张记的凉粉和肉夹馍\n\n糊辣羊蹄，肚包肉，烤串\n\n这次试试老孙家羊肉泡馍，赶时间，没要手掰\n\n在西安待过半个月以上，才吃的董这碗水盆羊肉\n哎~ 24时辰过得太快\n回一下之前的西安\n十三朝古都-长安-碳水之都\n十天之后再到长安\n从长安到奉天，从咸阳到沈阳\n华山西峰索道关闭，双腿已废\n附穿越秦岭的6条高速\nG40沪陕高速，从西安古城出发前往河南省南阳市段\nG70福银高速，蓝田县三里镇的席家河村到商州区的西涧乡\nG65包茂高速，从长安区的太乙宫开始穿越秦岭至柞水县的营盘\nG5京昆高速，北起西安的鄠邑区涝峪口南至汉中的勉县元墩\nG85银昆高速，秦岭北侧的宝鸡市到秦岭南侧的汉中市\n附穿越秦岭的5条国道\n108国道，即古傥骆道‌，洋县傥水河口到周至西骆峪，也是安史之乱唐玄宗逃离长安的路线\n210国道，即古子午道，西安至西乡，开辟于秦代，北出口为长安县子午谷\n211国道，连接西安和安康，即古峪谷道，隋唐时期开辟\n244国道，古褒斜道，从汉中到眉县，开辟于东汉，蜀道难即为此道\n242国道，连接华阴和洛南，穿越华山",
          "link": "https://4311346.com/post/2025/1008-ql.html",
          "publishedOn": "2025-10-08T15:41:21.000Z",
          "wordCount": null,
          "title": "雨夜驾车从南到北翻越秦岭",
          "imageUrl": null
        },
        {
          "id": "https://4311346.com/post/2025/0928-s60-start.html",
          "author": null,
          "description": "2025年09月16日，迎来了小牛NXT的一岁生日，送了它一个价值百元的凯威格手机支架，也算是对它非常不错了，毕竟在一个月前才给它换了一副好鞋 （更换米其林 CITY GRIP SAVER 轮胎）\n6300公里，这台小牛NXT一年的行驶里程基本上和预估值一致，虽然最终大单体必上，但也希望这套72V35A的铅酸电池还能再坚持一年。\n﻿也是因为这6300公里，使得沃尔沃S60的出车频率要降低了很多很多，毕竟大多数时候，都是单人出行，小摩托的快乐，很多时候是汽车无法给予的。\n停放了近20天的沃尔沃S60车机和铁将军胎压监测都再一次的显示了胎压报警，这是这台S60近5W公里以来，第二次破胎，同样是左后。\n\n沃尔沃4S点的小哥差点没检查出来，黑色钢片非常隐蔽的插入在轮胎排水槽当中。途虎80元的蘑菇钉加动平衡套餐，经过一个小时后，终于舒坦了。\n\n接着就是沃尔沃S60常规小保养，距离2025年03月那次间隔2000公里的保养之后，已经6个月，里程增长了4721公里。\n更新沃尔沃S60保养记录\n常规机油机滤外，加了点防冻液\n更换了 空调滤芯，上一次更换居然是2年前…总觉得用车不多，但已经是2W公里之前的事情了，空调滤芯特别的脏。上一次是淘宝购买自己手动更换的，老废腰了，算了把~ 以后都给4S店换把…\n清洗了节气门，费用不便宜，沃尔沃的节气门在发动机前侧下方，拆个节气门，耗时30分钟… 工时费是真贵。\n火花塞、刹车油，汽油滤芯，下一次得更换了…\n保养日期\n公里数\n保养类别\n途径\n\n\n\n\n2025/09/28\n41914KM\n机油、机滤、空滤、节气门\n武汉中升沃茂\n\n\n2025/03/09\n37193KM\n机油、机滤\n武汉中升沃茂\n\n\n2024/11/16\n35152KM\n机油、机滤\n武汉中升沃茂\n\n\n2024/05/11\n31280KM\nLOGO LAMP\n武汉富融\n\n\n2024/04/03\n30077KM\n更换左后视镜\n武汉中升沃茂\n\n\n2024/04/03\n\n空气滤芯\n自行更换\n\n\n2024/03/21\n28089KM\n机油、机滤\n西宁赛亚金孚\n\n\n2024/03/21\n\n空调滤芯\n自行更换\n\n\n2024/01/15\n\n前档加热丝修复\n自行更换\n\n\n2023/11/18\n19290KM\n机油、机滤\n武汉中升沃茂\n\n\n2023/05/27\n7988KM\n机油、机滤\n武汉中升沃茂\n\n\n\n\n至于出发…\n说实话并没有想好一定要去那里，因为2024年进入这个行业以来，一线门店员工除了过年，基本上全年无休，而总部一般都是二线，且人力资源这类岗位，更是属于二线，虽不用在门店去冲业绩，但有时候当业务端有需求的时候，也得在。\n毕竟公司在营业过程中，就会有着各种各样稀奇古怪的事情发生，但凡涉及到人的事，那么人力必须上。\n虽然这个行业8天的假期一次性休满有点难，二线部门6-7天还是有的，到时候说走就走把。\n国庆节说走就走\n2024年10月，又特地去了一趟福州-中国船政文化博物馆\n2023年10月，2023年中秋及国庆-山东枣庄\n2022年10月，国庆假期潮汕地区的吃吃喝喝",
          "link": "https://4311346.com/post/2025/0928-s60-start.html",
          "publishedOn": "2025-09-28T15:53:39.000Z",
          "wordCount": null,
          "title": "沃尔沃S60国庆出发前的准备",
          "imageUrl": null
        },
        {
          "id": "https://4311346.com/post/2025/0928-s60-start.html",
          "author": null,
          "description": "2025年国庆节放假前的一天，在公司加班到23点，但似乎有着干不完的工作…  原计划月末的人力资源部门月度会议，被突发的许多事情多打断和占用。并不是没有做好时间管理，做好计划和安排，只是突如其来的事情很多，很棘手，也很难，当然也很影响心情。但没办法，行业、职业和岗位就注定了需要解决一切关于人的问题，那么也会看到很多很多关于人性黑暗的各种面。",
          "link": "https://4311346.com/post/2025/0928-s60-start.html",
          "publishedOn": "2025-09-28T15:53:39.000Z",
          "wordCount": null,
          "title": "沃尔沃S60国庆出发前的准备",
          "imageUrl": null
        },
        {
          "id": "https://4311346.com/post/2025/0925-500w.html",
          "author": null,
          "description": "时间进入到09月之后，似乎一直马不停蹄，至少到今天快月末了还没有到一段落的感觉。\n最近公司一个业务部门调整，涉及30多人的工作岗位或地点的调整。当员工和公司是对立面的时候，想要做好这个全盘的人员调整，我只能说在事先，我是想的太简单了。\n最后还剩下不到10个员工，公司开始按照律师意见执行相关的调动，这里面有合法也有违法，因为在职时间都是一年左右，就算全部2N支付经济补偿金离开，也不到10万元费用。\n但如何将这10万元花费的有价值，才是真真正正的给自己上了一课。\n试想过去10年，陆陆续续从自己这里签订协商解除协议的人也有上百人，经手的费用最少500万起，但从来没有像现在这样思考这笔钱花出去后的价值。\n公司支付了经济补偿也给了代通知金，把人请出去了，最多只能算做是花费，还能买到其它价值吗？ 或许这些价值，不再这些离开的人身上，而在于筛选出了，真正想要和公司一并发展，共同进步，不在乎一朝得失的优秀员工。\n站在公司端，站在老板身边，或许是这么想。这也就是为什么同样是花费10万元的补偿金，你的方案比其他HRD更有价值。\n但回想自己也曾拿到过一次性10万+的经济补偿，何尝又不想跟公司一起走下去呢~只是相比那些稀烂的人和事，即使没有补偿金，可能也终究会离开把。当然不排除自己那时候也会破罐子破摔，拿着每月花不完的工资，继续混下去~ 好在我没有，一切向前看。",
          "link": "https://4311346.com/post/2025/0925-500w.html",
          "publishedOn": "2025-09-25T15:45:51.000Z",
          "wordCount": null,
          "title": "500万元从手心流走，它的价值如何体现",
          "imageUrl": null
        },
        {
          "id": "https://4311346.com/post/2025/0830-mingtangshan.html",
          "author": null,
          "description": "岳西明堂山\n看到岳西，思想上的第一定位是湖南省西边…但这里的岳西是安徽省的岳西县，大别山系和张家界比不了。明堂山位于安徽省安庆市岳西县境内，是大别山体系的一部分。相传在2100多年前，汉武帝刘彻封禅古南岳天柱山时，曾在此山设祭拜的“明堂”，故此山得名“明堂山”。核心特色为：奇松、怪石、云海、瀑布，当然还有近年来在明堂山上修建的各种单独收费的高空体验项目。\n观光车+索道上下山并没有想象中的那么累，索道到达之后，围着几个山头的悬崖峭壁走了一大圈，风景确实不错，但除了套票外，另外收费的项目也都非常的多。只当是走走逛逛看看风景就好了。\n\n武汉出发一路向东，和2024年黄冈英山桃花冲漂流的路线基本一致，高速必经罗田服务区，\n\n武汉出发大巴车约3小时才能到达明堂山风景区，此时已中午12点，在景区门口吃完午餐再上山。\n\n明堂山风景区导图\n\n配套门票和各种收费项目的价格\n\n电瓶车把人拖到入山口，一段陡峭的楼梯后，开始排队座索道上山。\n\n明堂山索道仅能到半山腰，然后就是楼梯继续上山，花费了30元，魔毯给俺运上去，才开始了真正的明堂山之旅。\n\n步步惊心，峭壁之间的索拉桥，20元/次，走过去。回程反而上方的索拉桥却不收费。\n\n明堂山上看大别山风景，和2024年武汉出发-湖北随州大洪山两日游的风景很像，都是大别山山脉。\n\n和楚北的大别山不同，西面的大别山更多的是悬崖绝壁。整个正真的明堂山之旅其实就是围着几个山头的悬崖峭壁上走一圈。\n\n热，是肯定的~ 好在山上有水卖，比起华山西峰还是要便宜不少，可以随便喝的那种。\n\n峭壁上有一间玻璃屋，咖啡奶茶价格再此，其实就是不打折的外卖价，但可乐茶等价格高不少。咖啡不贵是因为速溶…上山简单。\n\n安徽岳西明堂山的各类特产\n\n天色不对，想起了，鬼吹灯-怒晴湘西 的很多场景，赶紧下山\n\n此时肚子饿了，索性吃完饭再走… 此时天已黑，掏出用了一年多的VivoX100Ultra打开星空模式\n\n真的是不一样的风景，只是秋风起…了阵阵妖风\n\n天猫座，在明堂山正上方，不知道鬼吹灯中，这样的星宿有什么命门或宿命。\n赶紧去大别山的别墅酒店…… 车程差不多一个小时，有点中邪，上车就迷糊了。\n\n出来玩啊，反正也赚不到钱，主打一个快乐自由\n大别山彩虹瀑布\n同样是位于安徽省岳西县的AAAA景区，从明堂山大巴过来得近60分钟，看山玩水体验之一，两日游的搭配项目，风景一般，只是走走逛逛了。 这天虽然晴朗，但并没有在大别山的瀑布旁看到所谓的彩虹…\n\n或许是进入景区的时间比较早，有太阳，看看不到所谓的彩虹，或许是没有风将水花吹起来，特别是中午返程时路过，一样没有。\n差评，做为二天一夜的游玩搭配项目，也就如此了。\n\n顺着瀑布开始缓慢爬山，瀑布背后的溪水，水量不大，所以会怀疑瀑布都是水龙头供应自来水…这种在国内屡见不鲜。\n\n出景区之前的小竹林，有那么一丢丢赏心悦目\n\n除了竹林，还有桃林，摘点带走，当然得单独付钱\n\n商家推荐的，菇…不知道具体是啥名字\n\n飞拉达、攀岩、划船、漂流等收费项目很多，人少的时候，在船上多座了几圈，20元的价格算是值了。全程花了不少自费的钱，越野摩托，200元，40分钟，虽然贵，但好玩。\n玩累了吃饭~  然后回家\n\n炒个当地的农家土鸡蛋\n\n牛骨头，二锅头…",
          "link": "https://4311346.com/post/2025/0830-mingtangshan.html",
          "publishedOn": "2025-08-30T01:20:31.000Z",
          "wordCount": null,
          "title": "武汉出发-岳西明堂山和大别山彩虹瀑布",
          "imageUrl": null
        },
        {
          "id": "https://4311346.com/post/2025/0821-12122.html",
          "author": null,
          "description": "一直很遵守交通规则，快20年的驾龄，行驶中的交通违章仅有3次，其次不计其数的都是路边违停，当然还有几次很奇葩的违章。\n第一次是父母家门口的路口三车道分别为左转、左右转和右转，中间车道很多年都是左右转向可通行，也或许是那段时间好久没回父母家，不知道白鹭街第二车道已改为仅限左转。毕竟在这附近住了30多年，习惯性的第2道右转… 3分100元。\n第二次是一次春节前带着父母前往一个市场采购春节物资，因定位问题，就停在建设十路路边查了下导航并拨打了一次电话，被后端超远距离摄像头拍摄，被认定为违停，3分100元。\n第三次违章，出现在江西高速，1.5L的马自达3昂克赛拉，开到130Km/小时，居然被判定为超速… 唉~ 看照片拍摄角度，应为高速路边临时测试点拍摄。\n当然~ 行驶在武汉市城市道路上，想要一次都不违章其实挺难，好在被抓到的就这几次，还有几次闯红灯，逆向行驶等都没被拍到或被人举报而已。\n最奇葩的一次违停，多年前一次回家晚了，小区内无法临停，就停在马路边。次日一早看到楼下交警在贴条，赶紧穿衣服下楼，绕到车边并提前用钥匙远程开启了双闪。此时交警刚走到车辆正前方，我赶忙上去阻止他拍照。结果一张含有车主照片和车灯闪亮的违停信息在一周后就显示在12123上。\n前段时间处理工伤中的交通事故，拿到的很多交警处理的单据（交通事故责任认定书），都能直观的感受到，交警系统也都是一堆草台班子。\n\n扯不赢的~ 老老实实缴纳罚款，处理违章\n这是行驶过程中的第四次违章\n第四次违章有点气愤的原因是原本就主动避免，结果在不知情的情况下发生违章。知道武汉东湖风景区附近节假日及周末得分单双号行驶，有意避开这些限行路段，但高德导航及现场的导流指引仅且只有一条路，或许自己没注意看到限行标志把。结果一周后收到违章信息很是气愤，都差点想要投诉高德导航…只能吃一垫长一智了，下次绕得远远的行了把。对于不熟悉的路段，导航虽然相对可靠，也不能绝对的依赖导航。\n当然 还有 第一次骑电动车被武汉交警处罚\n都说武汉开车难，是真的~\n最后~ 就是违停~ 虽然多，但将年限拉长，其实也就每年一次而已（前些年比较多，近几年会比较少）。因为吃过了亏，上过了当，算算成本都知道，即时停车场贵点，也要不了一次100元。而违停的风险不光只是一次贴条，还包括了很多其它的成本。所以，还是老老实实停在指定的停车场里，那怕有时候多走那么几步路，比起被贴罚单，总成本也会便宜的多。\n当然，要真的想省钱，那就别开车，更别拥有一辆汽车。",
          "link": "https://4311346.com/post/2025/0821-12122.html",
          "publishedOn": "2025-08-20T15:12:01.000Z",
          "wordCount": null,
          "title": "人生中的第四次交通违章",
          "imageUrl": null
        },
        {
          "id": "https://4311346.com/post/2025/0813-city-grip-saver.html",
          "author": null,
          "description": "CITY GRIP SAVER 是米其林 2023年03月面向中国市场发布的首款电动踏板车轮胎产品，卖点简单说就是 耐磨防滑又省电。\n9090-12型号前后两条轮胎落地，包括含安装费610元没了~ 但成本远高于此…\nCITY GRIP SAVER\n\n拿到这两条轮胎等了快三天，几经波折，原本在小牛电动车店订货，虽然贵点，但省心没怎么纠结。\n只到周日一早去到孝感喝碗孝感米酒后回到发现车店居然还没到货…\n再次驾车从南湖前往汉口江岸区的万国摩托车市场够买，然后给到小牛电动车店的时候帮忙安装。80元的安装费，不算贵，只可惜没办法做动平衡，也不是专业扒胎机，师傅的工具上包了电工胶带然后慢慢一点点撬。\n\n安装比较顺利，唯一要注意的是 米其林 CITY GRIP SAVER 前后轮转动的花纹是不一样的。\n\n﻿小牛NXT几个不地道的地方，后平叉为钢制，不是铝制，拿下TCS装饰盖板后，超级的丑。看了下后卡钳中的刹车片，已经磨损一半了，预计要不了多久就会像马自达昂克赛拉更换EBC绿皮刹车片那样，自费更换更强的刹车片。\n换后的骑行感受\n米其林 CITY GRIP SAVER 和原装 幼神 9080-12，在轮胎宽度上虽然都是90mm，但米其林 CITY GRIP SAVER 接触地面的面积要更多。在静音方面比起幼神要优秀太多，和米其林汽车轮胎PRIMACY 4 浩悦四代一样，明显能感受到米其林轮胎的软和舒适。也是在新胎上车第四天，骑了一趟往返45公里的小短途后，发现滚阻要比原装幼神底很多，那么带来的效果如广告一样…省电，抓地力就更不用说了，太稳了。﻿\n功耗曾经每公里29-30Wh/Km，现在25-26Wh/Km，最后就是骑车的平均时速要更快了一些…  5300公里时更换上的这对 米其林 CITY GRIP SAVER ，希望能坚持 10000公里。\n祸不单行的暑期\n用祸不单行来评价近期非常的好，这个暑期确实非常的忙，暑期还没结束，08月也才刚刚开始不久，但小牛NXT却坚持不住了。\n上周四早上09点公司有个重要的会议，作为HR部门负责人需要在会议开始时做一个简短的发言，按照日常的时间出门，下楼发现小牛NXT的轮胎瘪了… 无法行驶。因为时间较紧，赶紧叫车前往，街道口马房山从南到北没有那天是不堵的，还在出门较早，有惊无险的08点58分到达公司，准时参加了会议。\n下班赶紧回家再次到停车地点，发现旁边其它的电动车轮胎也是没气状态，不由得让人觉得这次车胎是被人为破坏的。随后联系物业调去相关监控，找物业沟通协商大多数其实是无果的，无非是希望物业公司能给到一些情绪价值，那怕啥都不干，只是关心下业主都行，可续保利物业并没有做到。\n如果事情发生在周末的早晨，自己肯定会选择报警，如果只是放气，警察并不会做太多的理会，而报警原因选择谋杀或许才会受到重视… 毕竟损坏轮胎…等于制造交通事故。\n﻿推行至小牛专卖店修车\n1公里的路程，推行了近20分钟… 还推行了2次~ 说来话长，第2次推行之后~ 莫名的头疼了半天…\n第一次前往小牛专卖店，检查后并无异样，原因很简单，有人故意放气… 所以轮胎打气之后，还专门用泡沫液冲洗，检查轮胎是否有漏气。\n次日早上也没啥问题，但次日中午，轮胎再次气压不足，找到附近维修点，发现轮胎上的异物，取出之后，比较难补胎，这是一次性两个洞… 不亚于胎肩补胎，未来的安全性更是难以保障。\n\n索性选择直接换胎，米其林CITY GRIP SAVER一套，钱就是这样没有存住的… 原本换个原装YOSUN幼神轮胎几十元就能搞定的事，这次搞了600多~  缓缓把~\n909012的幼神半热熔9个月时间，刚刚过5300公里里程，一直心心念 米其林CITY2SAVER 这次终于换上了… 但NXT玩家版后轮电机1.85J的宽度，90mm封顶，有点无语。\n想要110mm的宽胎，就必须换电机，换了电机就得换控制器，电机+控制器换了之后扭力变大了，需要更换平叉，马力上来了配套的刹车及卡钳也得一并跟换…外加一块72V100A的大单体电池+华为大炮，合计费用超万元，唉~ 这钱直接买台全新的 NXPRO 电摩把~\n损坏的充电器插头\n而在半个月前，小牛铅酸版车型的充电器的插头居然断了，从损坏情况来看，应该是受过外力冲击导致断裂，但实在想不起是在什么时候和场景出现过类似的场景。但不排除车在充电结束后，有人试图插拔过这个插头，这次并没有更换充电器，而是直接淘宝买了一根三插口的线自己换上。\n\n至此小牛NXT暂时也到此为止把，除了电池，不然改装费用深不见底。\n想去考一个能驾驶摩托车的D罩",
          "link": "https://4311346.com/post/2025/0813-city-grip-saver.html",
          "publishedOn": "2025-08-14T15:52:39.000Z",
          "wordCount": null,
          "title": "更换米其林 CITY GRIP SAVER 轮胎",
          "imageUrl": null
        },
        {
          "id": "https://4311346.com/post/2025/0801-donghuheyan.html",
          "author": null,
          "description": "武汉东湖风景区靠近磨山景区南门那一片有好多的私人会所，大多提供餐厅和住宿服务，每一家都有其独特的特色。\n唐代诗人孟浩然有一首诗中曾写到 “荷风送香气，竹露滴清响” ，这个酷热的夏天能在这样的会所餐厅吃饭，看看湖景，赏赏荷花，聊聊人生，惬意至极。\n荷宴·荷畔院子\n\n磨山景区南门旁，打卡记录下把~ 下次还能来~\n\n早早就预定的777包房，风景无敌\n\n如果只是几个人，大厅长廊窗边的环境也非常的好\n\n窗外的荷花，如此应景。\n\n一定要出来在荷花池中走走，荷庭别院，百味入宴，真的像是来到了一个世外桃源。\n武汉东湖磨山风景区\n\n荷宴·荷畔院子旁就是武汉东湖磨山风景区南门，乘坐30元/人往返的景区电瓶车去到磨山山顶楚天台，一路风景很赞。\n\n不记得是什么时候开始，磨山风景区免票了，而作为武汉人，特别是从小在东湖边长大的人来说，东湖磨山也有很多年没来过了，特别的陌生。\n\n电瓶车送到楚天台楼梯口，一口气上去后，发现居然还得掏20元/人买票才能进入楚天台。\n\n原因是楚天台内每天几个时间段有湖北编钟表演\n\n磨山风景区楚天台的结构图，直接上官方描述。\n楚天台坐落于武汉东湖磨山第二主峰，是楚文化游览区的标志性建筑。该建筑依山势而建，采用外五层内六层结构，主体高度达35.26米，建筑面积2260平方米。台前345级台阶与弧形道相连接，栏板雕刻楚器云纹浮雕，正面镶嵌600余块天然大理石拼成\"楚天仙境丹凤朝阳\"图案。\n建筑顶部安放1.2米高青铜凤标，基座高1.5米，整体净高7.2米，展现楚文化中\"凤水合一\"的图腾崇拜。台内常年展出楚国出土文物复仿制品及名人蜡像，并每日定时举办编钟乐舞表演。登临顶层观景平台可俯瞰东湖全景，形成山水人文相融的景观体系\n\n楚天台上，远看东湖听涛景区\n\n楚天台上，远看东湖落雁景区\n\n楚天台上，远看东湖吹笛景区\n逛累了，回到荷宴开吃\n\n小盘开胃菜，武汉怀旧妈妈菜 和 青笋海蜇丝\n\n金汤薏米佛跳墙，这里居然也能喝到福州的佛跳墙，内容厚实\n\n三文鱼拼鹅肝刺身，金砖鹅肝，凸(艹皿艹 )~入口即化的冰淇淋感，晚上回家淘宝回购了\n还有几个有特色的菜品\n年份甲鱼烧蹄筋鞭花、绝味黑鸦煲、开胃天门鳝鱼羹、腊味黄陂煮豆丝\n总体来说，比隔壁不远处的东湖莲舍性价比更高，不管是环境还是菜品。",
          "link": "https://4311346.com/post/2025/0801-donghuheyan.html",
          "publishedOn": "2025-08-01T14:52:19.000Z",
          "wordCount": null,
          "title": "武汉的夏天，东湖荷宴·荷畔院子",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Dennis",
      "feedUrl": "https://domon.cn/rss/",
      "siteUrl": "https://www.domon.cn/",
      "articles": [
        {
          "id": "68ea5add12ab346740f8fa5d",
          "author": "Domon",
          "description": "很久没有在 blog 里发「文章」了，借口当然很多，但最主要的还是少了表达欲，那种喷涌而出的感觉。每次打开 Obsidian，",
          "link": "https://www.domon.cn/diu-shi-de-biao-da-yu/",
          "publishedOn": "2025-10-12T01:32:09.000Z",
          "wordCount": 158,
          "title": "丢失的表达欲",
          "imageUrl": "https://images.unsplash.com/photo-1526398977052-654221a252b1?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxMTc3M3wwfDF8c2VhcmNofDl8fHRhbGt8ZW58MHx8fHwxNzYwMTg5MTYwfDA&ixlib=rb-4.1.0&q=80&w=2000"
        },
        {
          "id": "68e9c7a012ab346740f8fa42",
          "author": "Domon",
          "description": "人们所说的未来，其实就是明天。",
          "link": "https://www.domon.cn/2025-9yue-yue-du-shu-zhai/",
          "publishedOn": "2025-10-11T03:03:39.000Z",
          "wordCount": 165,
          "title": "2025年9月阅读书摘",
          "imageUrl": "https://images.unsplash.com/photo-1523865236457-3ae3358a4eaa?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxMTc3M3wwfDF8c2VhcmNofDIzfHxib29rcyUyMHxlbnwwfHx8fDE3NjAxNTE5MjR8MA&ixlib=rb-4.1.0&q=80&w=2000"
        },
        {
          "id": "68bd796e12ab346740f8fa20",
          "author": "Domon",
          "description": "保持内心平静不是无视焦虑泛滥这个现实。相反，平静是在给予我们适应这个瞬息万变的世界所需的韧性、能量以及耐力。",
          "link": "https://www.domon.cn/2025-8yue-yue-du-shu-zhai/",
          "publishedOn": "2025-09-07T12:26:24.000Z",
          "wordCount": 161,
          "title": "2025年8月阅读书摘",
          "imageUrl": "https://images.unsplash.com/photo-1610116306796-6fea9f4fae38?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxMTc3M3wwfDF8c2VhcmNofDJ8fGJvb2tzfGVufDB8fHx8MTc1NzE4NzQ2Mnww&ixlib=rb-4.1.0&q=80&w=2000"
        },
        {
          "id": "6890be7112ab346740f8fa0d",
          "author": "Domon",
          "description": "虽然我在中国见过很多胆小鬼，但坚忍不拔却是中国人最大的特点。",
          "link": "https://www.domon.cn/2025nian-7yue-yue-du-shu-zhai/",
          "publishedOn": "2025-08-04T14:08:07.000Z",
          "wordCount": 201,
          "title": "2025年7月阅读书摘",
          "imageUrl": "https://images.unsplash.com/photo-1523865236457-3ae3358a4eaa?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxMTc3M3wwfDF8c2VhcmNofDE1fHxib29rc3xlbnwwfHx8fDE3NTQzMTY0NzJ8MA&ixlib=rb-4.1.0&q=80&w=2000"
        }
      ]
    },
    {
      "title": "杜老师说",
      "feedUrl": "https://dusays.com/atom.xml",
      "siteUrl": "https://dusays.com/atom.xml",
      "articles": [
        {
          "id": "https://dusays.com/832/",
          "author": null,
          "description": "<blockquote>\n<p>因为图床程序暂不支持套餐到期通知，需要杜老师定期统计到期的用户，再通过邮箱发通知。每次统计时操作较麻烦，为了方便统计用户，尝试用 PHP 编写一个页面，可以筛选去不图床到期用户邮箱。</p>\n</blockquote>",
          "link": "https://dusays.com/832/",
          "publishedOn": "2025-10-15T16:00:00.000Z",
          "wordCount": 614,
          "title": "如何使用 PHP 脚本筛选去不图床已到期用户邮箱",
          "imageUrl": "https://cdn.dusays.com/avatar.png"
        },
        {
          "id": "https://dusays.com/831/",
          "author": null,
          "description": "<blockquote>\n<p>在当今数字化协作时代，高效的项目管理工具对于团队的成功至关重要。Focalboard 作为一款开源的项目管理软件，正在逐渐崭露头角，受到了众多团队和个人青睐。</p>\n</blockquote>",
          "link": "https://dusays.com/831/",
          "publishedOn": "2025-10-09T16:00:00.000Z",
          "wordCount": 507,
          "title": "Focalboard 开源项目管理的有力工具",
          "imageUrl": "https://cdn.dusays.com/avatar.png"
        },
        {
          "id": "https://dusays.com/830/",
          "author": null,
          "description": "<blockquote>\n<p>NodePass 是一个开源网络隧道工具，其基于 Go 语言开发，目标是让两台机器之间的通信变得简单又安全。想象一下，您有一台内网 Web 服务器，想让远在千里之外同事访问，NodePass 就能搭一座隐形的桥，把数据安全送过去。</p>\n</blockquote>",
          "link": "https://dusays.com/830/",
          "publishedOn": "2025-10-03T16:00:00.000Z",
          "wordCount": 528,
          "title": "NodePass 开源的隧道工具重新定义内网穿透",
          "imageUrl": "https://cdn.dusays.com/avatar.png"
        },
        {
          "id": "https://dusays.com/829/",
          "author": null,
          "description": "<blockquote>\n<p>在计算机网络的学习与研究领域，Mininet 是款极具价值的工具。它就像是一个迷您网络世界的构建者，为我们提供便捷的网络实验环境。本文将带您深入了解 Mininet 魅力所在，并手把手教您安装与使用它。</p>\n</blockquote>",
          "link": "https://dusays.com/829/",
          "publishedOn": "2025-09-27T16:00:00.000Z",
          "wordCount": null,
          "title": "探索网络实验的神器 Mininet",
          "imageUrl": null
        },
        {
          "id": "https://dusays.com/828/",
          "author": null,
          "description": "<blockquote>\n<p>为了更好的执行 Python 脚本，杜老师习惯使用 Ubuntu 系统，不过在安装 Python 库时经常报错。收集了安装 Python 库的报错信息，并整理了解决办法，供需要的小伙伴们参考。</p>\n</blockquote>",
          "link": "https://dusays.com/828/",
          "publishedOn": "2025-09-21T16:00:00.000Z",
          "wordCount": null,
          "title": "Ubuntu 系统无法通过 pip 命令安装 Python 库问题解决",
          "imageUrl": null
        },
        {
          "id": "https://dusays.com/827/",
          "author": null,
          "description": "<blockquote>\n<p>随着相机像素越来越大，图片体积也变大了。在图片处理中，较大的文件体积会影响性能，因此杜老师会先生成缩略图，筛选完成后再通过 Python 脚本实现图片相似度匹配。这里是一个简单的示例，供需要的小伙伴们参考。</p>\n</blockquote>",
          "link": "https://dusays.com/827/",
          "publishedOn": "2025-09-15T16:00:00.000Z",
          "wordCount": null,
          "title": "使用 Python 脚本实现图片相似度匹配",
          "imageUrl": null
        },
        {
          "id": "https://dusays.com/826/",
          "author": null,
          "description": "<blockquote>\n<p>北京这边天气不错，特别适合骑行。杜老师拿出了压箱底的全景相机，打算录制一段沿途景色，结果压制出的文件体积很大。之前分享过通过 FFmpeg 来压缩视频的方法，这次整理了更多的方法，供需要的小伙伴们参考！</p>\n</blockquote>",
          "link": "https://dusays.com/826/",
          "publishedOn": "2025-09-09T16:00:00.000Z",
          "wordCount": null,
          "title": "几种通过 FFmpeg 无损压缩视频的方法",
          "imageUrl": null
        },
        {
          "id": "https://dusays.com/825/",
          "author": null,
          "description": "<blockquote>\n<p>刚从合肥返京，就收到了天津出差任务。虽然京津距离不远，但杜老师平时工作较忙，周末一般都在家睡懒觉，所以也是想着趁此机会游玩一下！分享给未来过天津的小伙伴，大家来云旅游~</p>\n</blockquote>",
          "link": "https://dusays.com/825/",
          "publishedOn": "2025-09-03T16:00:00.000Z",
          "wordCount": null,
          "title": "天津游记「多图预警」",
          "imageUrl": null
        },
        {
          "id": "https://dusays.com/824/",
          "author": null,
          "description": "<blockquote>\n<p>时隔一年，又一次来到了安徽省会——合肥。这次出差的时间很灵活，杜老师有半天时间可以到附近景区逛一逛，就特地带了单反相机拍了些照片。本文整理了几张特色的美照，特邀杜老师的另一半帮忙配的介绍文，感兴趣的小伙伴可进来一看！</p>\n</blockquote>",
          "link": "https://dusays.com/824/",
          "publishedOn": "2025-08-28T16:00:00.000Z",
          "wordCount": null,
          "title": "合肥游记「多图预警」",
          "imageUrl": null
        },
        {
          "id": "https://dusays.com/823/",
          "author": null,
          "description": "<blockquote>\n<p>当今数字化浪潮中，人工智能正以前所未有的速度改变着我们的工作和生活方式。字节跳动于 2025 年 4 月 19 日推出的通用型 AI Agent 平台，无疑是这一变革中一颗璀璨新星，为我们带来了全新的 AI 协作办公体验。</p>\n</blockquote>",
          "link": "https://dusays.com/823/",
          "publishedOn": "2025-08-22T16:00:00.000Z",
          "wordCount": null,
          "title": "探索扣子空间「邀请码不限量分享」",
          "imageUrl": null
        },
        {
          "id": "https://dusays.com/822/",
          "author": null,
          "description": "<blockquote>\n<p>KVM 是一种开源全虚拟化解决方案，能够在 Linux 系统运行多个操作系统。本文将详细介绍如何在银河麒麟桌面操作系统 ARM 版安装 KVM 虚拟化环境，帮助用户搭建高效的虚拟化平台。</p>\n</blockquote>",
          "link": "https://dusays.com/822/",
          "publishedOn": "2025-08-16T16:00:00.000Z",
          "wordCount": null,
          "title": "在银河麒麟桌面操作系统 ARM 版上安装 KVM 虚拟化",
          "imageUrl": null
        },
        {
          "id": "https://dusays.com/821/",
          "author": null,
          "description": "<blockquote>\n<p>在数字媒体盛行的今天，观看电影、电视剧等视频内容成为了人们日常娱乐的重要部分。然而，许多视频平台要么需要付费订阅，要么充斥大量广告，还有的需要复杂的注册流程，极大地影响了观影体验。今天，就给大家介绍一款名为 LibreTV 的开源工具，它将彻底改变在线观影方式。</p>\n</blockquote>",
          "link": "https://dusays.com/821/",
          "publishedOn": "2025-08-10T16:00:00.000Z",
          "wordCount": null,
          "title": "LibreTV 免费的在线视频观看神器",
          "imageUrl": null
        },
        {
          "id": "https://dusays.com/820/",
          "author": null,
          "description": "<blockquote>\n<p>在数字化工作时代，一款高效、便捷的终端工具对于开发者、系统管理员和网络工程师等人群来说至关重要。Electerm 作为一款开源免费的跨平台终端模拟器，凭借其丰富的功能和优秀的用户体验，成为了众多用户的首选。</p>\n</blockquote>",
          "link": "https://dusays.com/820/",
          "publishedOn": "2025-08-04T16:00:00.000Z",
          "wordCount": null,
          "title": "Electerm 高效便捷的开源终端工具",
          "imageUrl": null
        },
        {
          "id": "https://dusays.com/819/",
          "author": null,
          "description": "<blockquote>\n<p>在现代开发工作中，终端是我们必不可少的工具之一。今天要给大家介绍的 Wave Terminal，无疑是一款将传统终端功能与图形化能力完美融合开源终端，能够极大地提升我们的工作效率。</p>\n</blockquote>",
          "link": "https://dusays.com/819/",
          "publishedOn": "2025-07-29T16:00:00.000Z",
          "wordCount": null,
          "title": "Wave Terminal 多功能开源终端工具",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Linux运维笔记",
      "feedUrl": "https://wanghaiyang.cc/rss.xml",
      "siteUrl": "https://haiyang.host",
      "articles": []
    },
    {
      "title": "清风",
      "feedUrl": "https://xbd666.cn/rss.xml",
      "siteUrl": "https://xbd666.cn",
      "articles": []
    },
    {
      "title": "牧尘的NAS小站",
      "feedUrl": "https://www.dreamlyn.cn/atom.xml",
      "siteUrl": "https://www.dreamlyn.cn/atom.xml",
      "articles": [
        {
          "id": "https://www.dreamlyn.cn/1975778823.html",
          "author": null,
          "description": "<h1 id=\"🍳-CookLikeHOC：用老乡鸡的方式烹饪美味，轻松上手的JavaScript项目！\"><a href=\"#🍳-CookLikeHOC：用老乡鸡的方式烹饪美味，轻松上手的JavaScript项目！\" class=\"headerlink\" title=\"🍳",
          "link": "https://www.dreamlyn.cn/1975778823.html",
          "publishedOn": "2025-09-13T07:08:09.000Z",
          "wordCount": 620,
          "title": "CookLikeHOC：用老乡鸡的方式烹饪美味，轻松上手的JavaScript项目！",
          "imageUrl": "https://img.dreamlyn.cn:8443/i/2024/02/22/115030.webp"
        },
        {
          "id": "https://www.dreamlyn.cn/1975778801.html",
          "author": null,
          "description": "<h1 id=\"SQLBot：问数新纪元的智能助手-🚀\"><a href=\"#SQLBot：问数新纪元的智能助手-🚀\" class=\"headerlink\" title=\"SQLBot：问数新纪元的智能助手 🚀\"></a>SQLBot：问数新纪元的智能助手 🚀</h1><",
          "link": "https://www.dreamlyn.cn/1975778801.html",
          "publishedOn": "2025-09-10T12:08:09.000Z",
          "wordCount": null,
          "title": "SQLBot：问数新纪元的智能助手 🚀",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Pandalab",
      "feedUrl": "https://pandalab.me/rss.xml",
      "siteUrl": "https://pandalab.me/",
      "articles": []
    },
    {
      "title": "雨月空间站",
      "feedUrl": "https://www.mintimate.cn/atom.xml",
      "siteUrl": "https://www.mintimate.cn/atom.xml",
      "articles": [
        {
          "id": "https://www.mintimate.cn/2025/09/12/qcloudCaptchaIntegration/",
          "author": null,
          "description": "我们在设计一些公共业务接口的时候，比如登录、注册、找回密码等，为了防止恶意请求，我们通常会采用人机验证、恶意请求拦截等手段来保护我们的接口。本文将介绍如何使用腾讯云天御验证码来实现人机验证和恶意请求拦截。",
          "link": "https://www.mintimate.cn/2025/09/12/qcloudCaptchaIntegration/",
          "publishedOn": "2025-09-12T07:19:26.000Z",
          "wordCount": 1649,
          "title": "Vue项目接口防刷加固：接入腾讯云天御验证码实现人机验证、恶意请求拦截",
          "imageUrl": "https://imagehost.mintimate.cn/post_qcloudCaptchaIntegration/banner.webp"
        },
        {
          "id": "https://www.mintimate.cn/2025/08/24/knowledgeRagCnb/",
          "author": null,
          "description": "将 VitePress 文档的 Markdown 数据向量化，并使用 RAG 进行检索，在 VitePress 导航栏添加 AI 助手插件。",
          "link": "https://www.mintimate.cn/2025/08/24/knowledgeRagCnb/",
          "publishedOn": "2025-08-24T07:00:00.000Z",
          "wordCount": null,
          "title": "将 VitePress 文档数据向量化，配合 RAG 实现 AI 助手插件",
          "imageUrl": null
        },
        {
          "id": "https://www.mintimate.cn/2025/07/28/installFirefox/",
          "author": null,
          "description": "特供版 Firefox 即将停止服务，那么如何安装国际版的 Firefox 呢？使用软件包管理器(Windows(winget)、macOS(brew) 和 Linux)可以丝滑安装 Firefox, 但是如果想要迁移到国际版，该怎么做呢?",
          "link": "https://www.mintimate.cn/2025/07/28/installFirefox/",
          "publishedOn": "2025-07-27T16:08:48.000Z",
          "wordCount": null,
          "title": "Firefox中国版关闭，如何下载国际版并迁移数据？",
          "imageUrl": null
        },
        {
          "id": "https://www.mintimate.cn/2025/07/26/vaultwardenHost/",
          "author": null,
          "description": "自建开源 Bitwarden/Vault 密码库：安全托管强密码，跨平台自动同步、自动填充密码，支持 MFA 多因素认证。掌控数据，提升安全！​",
          "link": "https://www.mintimate.cn/2025/07/26/vaultwardenHost/",
          "publishedOn": "2025-07-26T08:47:38.000Z",
          "wordCount": null,
          "title": "​​开源密码管理新选择：自建 Bitwarden(Vault)密码托管，跨平台同步 + MFA 多因素认证",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "杂烩饭",
      "feedUrl": "https://zahui.fan/atom.xml",
      "siteUrl": "https://zahui.fan/atom.xml",
      "articles": [
        {
          "id": "https://zahui.fan/posts/t3e151/",
          "author": null,
          "description": "<p>在 macOS 中运行命令行程序，如果你不想开一个终端窗口，并且希望实现开机自启动等等功能，可以使用 macOS 自带的服务管理。这里以 easytier 这个组网工具为例：</p>\n<p>直接执行的命令是：<code>/usr/local/bin/easytier-core -c /Users/iuxt/config/easytier.toml</code></p>\n<h2",
          "link": "https://zahui.fan/posts/t3e151/",
          "publishedOn": "2025-09-30T06:10:12.000Z",
          "wordCount": 806,
          "title": "macOS自定义后台运行程序",
          "imageUrl": "https://s3.babudiu.com/iuxt/public/skeleton1.svg"
        },
        {
          "id": "https://zahui.fan/posts/t37flu/",
          "author": null,
          "description": "<h2 id=\"为什么有这个需求\"><a href=\"#为什么有这个需求\" class=\"headerlink\" title=\"为什么有这个需求\"></a>为什么有这个需求</h2><p>假设有如下情况：</p>\n<ol>\n<li>这个服务很重要，很多服务在连，停服不知道会有什么影响。</li>\n<li>服务是运行在 docker 里的，但是 docker",
          "link": "https://zahui.fan/posts/t37flu/",
          "publishedOn": "2025-09-26T16:39:30.000Z",
          "wordCount": null,
          "title": "正在运行的Docker容器增加端口映射",
          "imageUrl": null
        },
        {
          "id": "https://zahui.fan/posts/t22j7t/",
          "author": null,
          "description": "<p>要先打开服务器的内核转发：<code>net.ipv4.ip_forward = 1</code><br>假设 WireGuard 自身的虚拟网段是 <code>10.8.0.0/24</code>, 给服务器分配的 IP 是：<code>10.8.0.1</code>，服务器的公网 IP 是：<code>124.221.31.148</code></p>\n<h2",
          "link": "https://zahui.fan/posts/t22j7t/",
          "publishedOn": "2025-09-04T14:35:52.000Z",
          "wordCount": null,
          "title": "轻量级组网工具WireGuard",
          "imageUrl": null
        },
        {
          "id": "https://zahui.fan/posts/t0wu1k/",
          "author": null,
          "description": "<ol>\n<li>Elasticsearch 有自己的高可用集群机制，不建议再用 k8s 管理</li>\n<li>适用于临时使用一下、或者测试使用</li>\n</ol>\n<h2 id=\"数据存储问题\"><a href=\"#数据存储问题\" class=\"headerlink\" title=\"数据存储问题\"></a>数据存储问题</h2><p>为了测试使用，我也没有用 pvc 来管理数据，而是选择了",
          "link": "https://zahui.fan/posts/t0wu1k/",
          "publishedOn": "2025-08-13T02:10:31.000Z",
          "wordCount": null,
          "title": "在Kubernetes中部署一个单节点Elasticsearch",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Lixx Blog - 李晓旭的博客",
      "feedUrl": "https://lixx.cn/rss.xml",
      "siteUrl": "http://blog.lixx.cn/",
      "articles": []
    },
    {
      "title": "BMPI",
      "feedUrl": "https://www.bmpi.dev/index.xml",
      "siteUrl": "https://www.bmpi.dev/",
      "articles": [
        {
          "id": "https://www.bmpi.dev/self/35/",
          "author": null,
          "description": "以一个普通人十年的经历为案例，探讨如何在不确定的世界里，从“有限游戏”的困境中挣脱，转向构建属于自己的“无限游戏”。",
          "link": "https://www.bmpi.dev/self/35/",
          "publishedOn": "2025-10-06T00:00:00.000Z",
          "wordCount": 309,
          "title": "三十五",
          "imageUrl": null
        },
        {
          "id": "https://www.bmpi.dev/self/my-invest-pilot/",
          "author": null,
          "description": "如何做出更好的投资决策？",
          "link": "https://www.bmpi.dev/self/my-invest-pilot/",
          "publishedOn": "2025-09-10T00:00:00.000Z",
          "wordCount": null,
          "title": "我的AI投资助手",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Home on 阳明的博客",
      "feedUrl": "https://www.qikqiak.com/index.xml",
      "siteUrl": "https://www.qikqiak.com/",
      "articles": []
    },
    {
      "title": "小z博客",
      "feedUrl": "https://blog.xiaoz.org/feed",
      "siteUrl": "https://blog.xiaoz.org",
      "articles": [
        {
          "id": "https://blog.xiaoz.org/?p=22523",
          "author": "xiaoz",
          "description": "游惠宝国际漫游长效卡是一款可在中国大陆漫游使用上网卡，在启动的时候自行选购香港电话号码，号码可用于接收短信使用，支持漫游中国大陆、中国香港、中国澳门、新加坡、马来西亚等22个国家地区的流量。适用场景游惠宝长效卡适用于以下任意一种场景：经常在中国大陆、港、澳、新加坡等多地出差的商务人士希望拥有一个香港",
          "link": "https://blog.xiaoz.org/archives/22523",
          "publishedOn": "2025-10-17T04:31:39.000Z",
          "wordCount": 244,
          "title": "低成本拥有一张游惠宝长效卡，大陆港澳轻松漫游，支持实体SIM卡和eSIM",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22504",
          "author": "xiaoz",
          "description": "CTExcel是中国电信面向海外公众客户推出的自主品牌移动通信服务，CTExcel推出的【中英共享】套餐，让你在中国和英国都能轻松的使用移动数据上网，非常适合海外留学、英国旅游、国内魔法上网等场景。这篇文章博主将介绍CTExcel套餐资费、开通和使用注意事项。适用场景英国、欧洲留学使用跨境电商英国、",
          "link": "https://blog.xiaoz.org/archives/22504",
          "publishedOn": "2025-10-15T09:17:03.000Z",
          "wordCount": 263,
          "title": "国内可漫游上网的CTExcel eSIM套餐：资费、开通与使用全指南",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22488",
          "author": "xiaoz",
          "description": "我们去海外旅游时，以往会选择开通三大运营商的海外漫游包，亦或者网上提前购买一张当地的SIM卡，但这样的传统方案不仅价格较贵，且操作较为繁琐。那有没有既能便宜上网，又不用拔插实体SIM卡的方案呢？当然有，我们只需用手机的eSIM功能 + 流量套餐即可解决，比如接下来将要介绍的eSIM功能和eSIM-H",
          "link": "https://blog.xiaoz.org/archives/22488",
          "publishedOn": "2025-10-13T10:38:03.000Z",
          "wordCount": 250,
          "title": "无需换卡，海外旅游轻松上网：eSIM-Home 多国流量包体验",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22469",
          "author": "xiaoz",
          "description": "亚马逊云科技是业界公认的全面、可靠且可扩展的云服务平台。现在，新用户可获得高达200美元服务抵扣金，用于免费体验其核心服务，还没 注册亚马逊云科技 的朋友千万别错过。这200美元由两部分组成：注册即得$100：完成注册，立获100美元抵扣金。任务再得$100：完成简单探索任务，额外再得100美元抵扣",
          "link": "https://blog.xiaoz.org/archives/22469",
          "publishedOn": "2025-10-11T02:06:04.000Z",
          "wordCount": 264,
          "title": "新用户专属福利：手把手教你领取200美元亚马逊云科技服务抵扣金",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22413",
          "author": "xiaoz",
          "description": "为助力开发者与企业用户更低成本、更轻松地开启云端探索，亚马逊云科技正式推出新版本的 Free Tier 2.0，对免费套餐服务进行了一次值得关注的优化与升级。需要注意的是，此项全新福利目前仅在海外区域上线（北京与宁夏区域除外），正是您注册并启动亚马逊云科技海外区之旅的好时机。这篇文章将介绍：注册亚马",
          "link": "https://blog.xiaoz.org/archives/22413",
          "publishedOn": "2025-09-30T01:56:05.000Z",
          "wordCount": 257,
          "title": "亚马逊云科技免费套餐升级2.0，新用户注册最高可获得 $200 美元抵扣金",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22450",
          "author": "xiaoz",
          "description": "eSIM在国外虽然已经普及很久，但是国内大多数手机依然不支持eSIM，不过别担心，现在我们可以使用eUICC卡来让原本不支持eSIM功能的手机间接支持eSIM，然后轻松的开通国外eSIM卡，xiaoz亲测有效。什么是eUICC卡普通SIM卡是固定了一家运营商的“身份卡”，而eUICC卡是一张“空卡”",
          "link": "https://blog.xiaoz.org/archives/22450",
          "publishedOn": "2025-09-28T01:36:09.000Z",
          "wordCount": null,
          "title": "不到30元，让你的手机变相支持eSIM：eUICC卡使用指南",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22439",
          "author": "xiaoz",
          "description": "HexHub 是一款专为程序员与运维人员打造的一站式 DevOps 利器。它不仅支持连接 SSH 服务器，还集成了 Docker 与常见数据库管理功能。这意味着，在开发过程中您无需在多个软件间频繁切换，仅凭 HexHub 即可同时搞定运维与数据库操作。Hexhub功能特点支持连接SSH支持跨平台：m",
          "link": "https://blog.xiaoz.org/archives/22439",
          "publishedOn": "2025-09-26T02:22:57.000Z",
          "wordCount": null,
          "title": "运维&开发的终极利器？一个Hexhub全搞定！下单专业版再赠Zdir/OneNav授权",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22391",
          "author": "xiaoz",
          "description": "一年零九个月，这是xiaoz上一块手表（小米Watch S3 eSIM版）的陪伴时长。在上一篇分享中，xiaoz聊过对它的期待与失落；而现在，xiaoz手中的设备已换成一加手表2。今天这篇文章，就来聊聊这次换新后的真实体验。为什么要替换小米Watch S3 eSIM版xiaoz家里面的大部分电器都是",
          "link": "https://blog.xiaoz.org/archives/22391",
          "publishedOn": "2025-09-25T02:35:19.000Z",
          "wordCount": null,
          "title": "入手了一加手表2，终于有点智能的味道了",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22383",
          "author": "xiaoz",
          "description": "xiaoz 一直想开发一个热点资讯网站，把关注的新闻热点聚合起来，方便日常阅读。最近花了一周时间，终于将这个想法落地实现，我为她取名「热点墨客」，现已正式上线，欢迎大家来体验！热点墨客体验地址：https://hot.rss.ink/ （请复制到浏览器打开）关于热点墨客不知道你有没有这种感觉：很多热",
          "link": "https://blog.xiaoz.org/archives/22383",
          "publishedOn": "2025-09-23T02:09:40.000Z",
          "wordCount": null,
          "title": "我搞了个网站「热点墨客」，让AI直接把热点读给你听！",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22368",
          "author": "xiaoz",
          "description": "TriliumNext 是一个功能强大、支持层级笔记与关系图谱的开源自托管知识库系统，这款工具xiaoz从去年就开始关注，但一直没来得及体验。最近xiaoz抽时间用Docker部署TriliumNext后发现真香，如果您也想部署自己的私有笔记系统，TriliumNext绝对值得一试。TriliumN",
          "link": "https://blog.xiaoz.org/archives/22368",
          "publishedOn": "2025-09-10T02:09:44.000Z",
          "wordCount": null,
          "title": "是时候换笔记工具了？TriliumNext 安装与入门指南（支持 Docker）",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22358",
          "author": "xiaoz",
          "description": "OneNav 是一款功能强大且简洁高效的浏览器书签管理器，支持集中式管理书签，完美解决跨设备、跨平台、跨浏览器的同步与访问难题，实现一处部署、随处访问。它不仅安装简单、界面简洁、操作方便，还可与浏览器扩展（插件）配合使用，为你带来更加高效便捷的书签管理体验。安装OneNav还未安装OneNav的用户",
          "link": "https://blog.xiaoz.org/archives/22358",
          "publishedOn": "2025-09-01T08:02:01.000Z",
          "wordCount": null,
          "title": "OneNav 书签 1.2.2 正式发布：订阅用户专属主题BookNest上线",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22347",
          "author": "xiaoz",
          "description": "IPING 是一款新一代的 IP 查询工具，能够从多个维度深入分析 IP 信息，不仅涵盖地理位置，还包括是否原生 IP、IP 类型识别、代理检测及风险标签等关键指标，有效帮助用户评估 IP 的信誉度和纯净程度。如何使用 IPING？IPING 是一款完全免费的网络工具，提供中英文双语界面，使用简单便",
          "link": "https://blog.xiaoz.org/archives/22347",
          "publishedOn": "2025-08-20T06:41:23.000Z",
          "wordCount": null,
          "title": "一款便捷的IP查询工具IPING，提供免费API调用",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22339",
          "author": "xiaoz",
          "description": "最近博主又发现一个新的虚拟卡服务商HornetPay，提供多种卡头（BIN）可选，且不需要实名即可开卡使用，充值仅支持USDT，有需要的可以试试。注意：本站仅做整理和推荐，如果继续阅读和使用相关风险需要您自行承担，否则请立即停止阅读！！！优点无需实名可自定义卡片姓名一个账户可开通多张虚拟卡多种卡头（",
          "link": "https://blog.xiaoz.org/archives/22339",
          "publishedOn": "2025-08-18T03:30:20.000Z",
          "wordCount": null,
          "title": "HornetPay虚拟卡，免实名，支持OpenAI/Claude",
          "imageUrl": null
        },
        {
          "id": "https://blog.xiaoz.org/?p=22322",
          "author": "xiaoz",
          "description": "OneNav 是一款功能强大且简洁高效的浏览器书签管理器，支持集中式管理书签，完美解决跨设备、跨平台、跨浏览器的同步与访问难题，实现一处部署、随处访问。它不仅安装简单、界面简洁、操作方便，还可与浏览器扩展（插件）配合使用，为你带来更加高效便捷的书签管理体验。Github开源地址：https://gi",
          "link": "https://blog.xiaoz.org/archives/22322",
          "publishedOn": "2025-08-14T05:15:11.000Z",
          "wordCount": null,
          "title": "OneNav 书签 1.2.0 正式发布：全新 Minima 极简主题登场",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Alliot's blog",
      "feedUrl": "https://www.iots.vip/atom.xml",
      "siteUrl": "https://www.iots.vip/atom.xml",
      "articles": []
    },
    {
      "title": "弹霄博科",
      "feedUrl": "https://www.txisfine.cn/atom.xml",
      "siteUrl": "https://www.txisfine.cn/atom.xml",
      "articles": []
    },
    {
      "title": "云原生实验室",
      "feedUrl": "https://icloudnative.io/index.xml",
      "siteUrl": "https://icloudnative.io/",
      "articles": []
    },
    {
      "title": "潘智祥",
      "feedUrl": "https://panzhixiang.cn/atom.xml",
      "siteUrl": "https://panzhixiang.cn/atom.xml",
      "articles": [
        {
          "id": "https://panzhixiang.cn/2025/ai-era-engineer-gap/",
          "author": null,
          "description": "记录一下关于AI时代下资深工程师与新人之间的差距感想，分享了一点自己的经验，试着分析了技术广度与深度的平衡，以及AI对工程师职业发展的影响",
          "link": "https://panzhixiang.cn/2025/ai-era-engineer-gap/",
          "publishedOn": "2025-09-04T16:00:00.000Z",
          "wordCount": 197,
          "title": "AI时代，到底是拉近了还是拉大了资深工程师与新人的差距？",
          "imageUrl": "https://blog.panzhixiang.cn/images/how-junior-grow-up-in-ai-era.png"
        },
        {
          "id": "https://panzhixiang.cn/2025/douyin/",
          "author": null,
          "description": "<p>我大概两个月前开始做一个抖音账号。</p>\n<p>因为是业余时间做的，基本上都是下班路上随便找个地方坐下来讲一些话题，或者就是在书房录制一些视频。算是佛系更新吧。</p>\n<p>我前天没有啥话题，正好在南京南的站台上有很多人抽烟，我就随手拍了一张照片吐槽一下。没想到因为这个",
          "link": "https://panzhixiang.cn/2025/douyin/",
          "publishedOn": "2025-08-28T16:00:00.000Z",
          "wordCount": null,
          "title": "在抖音上被喷惨了",
          "imageUrl": null
        },
        {
          "id": "https://panzhixiang.cn/2025/a-prompt-help-ai-understanding-your-code/",
          "author": null,
          "description": "AI 编程助手总是在你的大项目里“重复造轮子”？核心原因是它缺少全局上下文。我分享一个用了很久的 Prompt，能让 AI 自己为代码库生成一份 README “说明书”，辅助解决“失忆”问题。告别无效沟通，让你的 AI 变成真正懂项目的队友。",
          "link": "https://panzhixiang.cn/2025/a-prompt-help-ai-understanding-your-code/",
          "publishedOn": "2025-08-19T16:00:00.000Z",
          "wordCount": null,
          "title": "用这个提示词，教会AI理解你的整个项目",
          "imageUrl": null
        },
        {
          "id": "https://panzhixiang.cn/2025/side-project-always-be-hacked/",
          "author": null,
          "description": "我开发的一个英语学习工具意外成为黑客攻击目标，通过AI分析攻击日志，识别出攻击类型，并获得实用的安全防护建议。分享这次独特的网络安全经历和AI在技术问题解决中的应用。",
          "link": "https://panzhixiang.cn/2025/side-project-always-be-hacked/",
          "publishedOn": "2025-07-27T16:00:00.000Z",
          "wordCount": null,
          "title": "我业余时间做的一个小工具，竟成了黑客的“靶场”",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "青牛踏雪 - Kubernetes|Docker|Istio|Envoy|Hugo|Golang",
      "feedUrl": "https://unixsre.com/index.xml",
      "siteUrl": "https://unixsre.com/",
      "articles": []
    },
    {
      "title": "山山仙人博客",
      "feedUrl": "https://www.ssgeek.com/atom.xml",
      "siteUrl": "https://www.ssgeek.com/",
      "articles": []
    },
    {
      "title": "张戈博客",
      "feedUrl": "https://zhangge.net/feed",
      "siteUrl": "https://zhang.ge",
      "articles": []
    },
    {
      "title": "Zhangguanzhang",
      "feedUrl": "https://zhangguanzhang.github.io/atom.xml",
      "siteUrl": "http://zhangguanzhang.github.io/atom.xml",
      "articles": [
        {
          "id": "http://zhangguanzhang.github.io/2025/10/17/keepalived-locking-pid-file-invalid/",
          "author": null,
          "description": "<h2 id=\"由来\"><a href=\"#由来\" class=\"headerlink\" title=\"由来\"></a>由来</h2><p>现场部署业务后发现访问有问题，排查后发现业务网关访问 etcd 的 <a href=\"https://zhangguanzhang.gith",
          "link": "http://zhangguanzhang.github.io/2025/10/17/keepalived-locking-pid-file-invalid/",
          "publishedOn": "2025-10-17T18:10:30.000Z",
          "wordCount": 2584,
          "title": "keepalived Locking pid file error 22 - Invalid argument",
          "imageUrl": null
        },
        {
          "id": "http://zhangguanzhang.github.io/2025/10/13/k8s-hostNetwork-hostname/",
          "author": null,
          "description": "<p>最近升级和压测遇到的 hostNetwork 下 hostname 的坑问题</p>",
          "link": "http://zhangguanzhang.github.io/2025/10/13/k8s-hostNetwork-hostname/",
          "publishedOn": "2025-10-13T10:10:30.000Z",
          "wordCount": 2911,
          "title": "hostNetwork下hostname的坑",
          "imageUrl": null
        },
        {
          "id": "http://zhangguanzhang.github.io/2025/09/23/flannel.1-cannot-ping/",
          "author": null,
          "description": "<p>一次客户环境上个别节点 flannel.1 的 IP 无法 ping 的排查</p>",
          "link": "http://zhangguanzhang.github.io/2025/09/23/flannel.1-cannot-ping/",
          "publishedOn": "2025-09-23T10:10:30.000Z",
          "wordCount": null,
          "title": "个别节点上 flannel.1 的 IP 无法 ping",
          "imageUrl": null
        },
        {
          "id": "http://zhangguanzhang.github.io/2025/09/12/salt-run-hang/",
          "author": null,
          "description": "<p>一次 salt-run 很久才返回的排查</p>",
          "link": "http://zhangguanzhang.github.io/2025/09/12/salt-run-hang/",
          "publishedOn": "2025-09-12T20:10:30.000Z",
          "wordCount": null,
          "title": "salt-run很久才返回",
          "imageUrl": null
        },
        {
          "id": "http://zhangguanzhang.github.io/2025/09/10/kylin-4.19.90-52.49-udp-drop/",
          "author": null,
          "description": "<p>一次麒麟内核导致 flannel 跨节点不通的排查</p>",
          "link": "http://zhangguanzhang.github.io/2025/09/10/kylin-4.19.90-52.49-udp-drop/",
          "publishedOn": "2025-09-10T18:10:30.000Z",
          "wordCount": null,
          "title": "麒麟内核4.19.90-52.49导致的flannel vxlan跨节点不通",
          "imageUrl": null
        },
        {
          "id": "http://zhangguanzhang.github.io/2025/09/03/flannel-mode-chaos/",
          "author": null,
          "description": "<p>一次 flannel 路由错乱导致的跨节点不通</p>",
          "link": "http://zhangguanzhang.github.io/2025/09/03/flannel-mode-chaos/",
          "publishedOn": "2025-09-03T10:10:30.000Z",
          "wordCount": null,
          "title": "flannel 路由错乱",
          "imageUrl": null
        },
        {
          "id": "http://zhangguanzhang.github.io/2025/08/06/centos7-podman/",
          "author": null,
          "description": "<p>CentOS 7 上 Podman调研…..</p>",
          "link": "http://zhangguanzhang.github.io/2025/08/06/centos7-podman/",
          "publishedOn": "2025-08-06T10:10:30.000Z",
          "wordCount": null,
          "title": "私有化下(CentOS 7)Podman调研",
          "imageUrl": null
        },
        {
          "id": "http://zhangguanzhang.github.io/2025/07/29/python-grpc-first-long/",
          "author": null,
          "description": "<p>最近给同事解决的 python grpc 耗时长问题…..</p>",
          "link": "http://zhangguanzhang.github.io/2025/07/29/python-grpc-first-long/",
          "publishedOn": "2025-07-29T17:40:30.000Z",
          "wordCount": null,
          "title": "python grpc 使用域名第一次耗时长问题",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "柒's Blog",
      "feedUrl": "https://blog.52itstyle.vip/feed",
      "siteUrl": "https://blog.52itstyle.vip/",
      "articles": [
        {
          "id": "https://blog.52itstyle.vip/archives/5627/",
          "author": "柒",
          "description": "LInux安装 Apache Solr",
          "link": "https://blog.52itstyle.vip/archives/5627/",
          "publishedOn": "2025-09-26T00:53:00.000Z",
          "wordCount": 845,
          "title": "LInux安装 Apache Solr",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Linux运维笔记|自动化运维攻城狮",
      "feedUrl": "https://blog.imdst.com/rss",
      "siteUrl": "https://blog.imdst.com/",
      "articles": []
    },
    {
      "title": "Ready, Set, Virtual!",
      "feedUrl": "https://www.readysetvirtual.com/feed",
      "siteUrl": "https://www.readysetvirtual.com",
      "articles": [
        {
          "id": "https://www.readysetvirtual.com/?p=1759",
          "author": "Keiran Shelden",
          "description": "Recently I made the move to migrate all my VMs from running on VMware ESXi to running on",
          "link": "https://www.readysetvirtual.com/2025/10/19/getting-network-on-linux-servers-operational-after-migrating-hypervisors/",
          "publishedOn": "2025-10-19T12:54:10.000Z",
          "wordCount": 2550,
          "title": "Getting network on Linux servers operational after migrating hypervisors",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Christopher Kusek, Technology Evangelist",
      "feedUrl": "https://www.pkguild.com/feed",
      "siteUrl": "https://www.pkguild.com",
      "articles": []
    },
    {
      "title": "SFlanders",
      "feedUrl": "https://sflanders.net/feed",
      "siteUrl": "https://sflanders.net/",
      "articles": []
    },
    {
      "title": "TinkerTry",
      "feedUrl": "https://tinkertry.com/feed",
      "siteUrl": "https://tinkertry.com",
      "articles": []
    },
    {
      "title": "思有云 - IOIOX",
      "feedUrl": "https://www.ioiox.com/feed",
      "siteUrl": "https://www.ioiox.com/",
      "articles": []
    },
    {
      "title": "小炒肉",
      "feedUrl": "https://jicki.cn/index.xml",
      "siteUrl": "https://jicki.cn/",
      "articles": []
    },
    {
      "title": "RSS - Jamin Zhang",
      "feedUrl": "https://jaminzhang.github.io/rss/",
      "siteUrl": "http://jaminzhang.me",
      "articles": []
    },
    {
      "title": "Kovacs",
      "feedUrl": "https://mritd.com/atom.xml",
      "siteUrl": "https://mritd.com/atom.xml",
      "articles": []
    },
    {
      "title": "CHEGVA",
      "feedUrl": "https://chegva.com/feed",
      "siteUrl": "https://chegva.com",
      "articles": [
        {
          "id": "https://chegva.com/?p=6538",
          "author": "anzhihe",
          "description": "使用SQL客户端连接达梦数据库，主要有命令行工具 DISQL 和图形化工具 DM管理工具 两种方式。具体选择可参考下表：\n\n\n工具类型工具名称主要特点/适用场景\n\n命令行工具DISQL达梦自带，类似Oracle的SQLPlus，存放于安装路径的/bin/或/tool/目录，适合习惯命令行操作、需执行特定命令（如DESC查看表结构）或自动化脚本的场景。\n图形化工具DM管理工具功能强大、操作简单的图形化客户端，适合日常管理、查询数据、视觉化操作。\n\n\n🖥️ 使用DISQL命令行连接\nDISQL工具位于达梦数据库安装路径下的bin或tool目录。\n\n基本连接语法：\n\n./disql 用户名/密码@主机地址:端口号\n例如，连接本地默认数据库实例（端口通常为5236）：\n./disql SYSDBA/SYSDBA@localhost:5236\n注意：在/bin目录下使用disql时，建议直接在命令中写全连接信息。如果只输入./disql后回车，后续将无法输入端口号（除非使用默认端口5236）。\n\n交互式连接：\n在/tool目录下或直接运行disql后，可以使用LOGIN或CONN（CONNECT）命令连接。\n\nCONN SYSDBA/SYSDBA@localhost:5236\n或 LOGIN 随后根据提示输入服务器地址、用户名、密码及端口号。\n\n简化连接配置（可选）：\n为省去每次输入完整地址的麻烦，可配置dm_svc.conf文件（通常在/etc目录）。在文件中按格式添加服务名：\n\n自定义服务名=(IP地址:端口号)\r\n\r\n例如：DMDB=(192.168.1.100:5236)\n配置后，连接时只需使用服务名：\n./disql SYSDBA/SYSDBA@DMDB\n🖱️ 使用图形化客户端连接\n达梦数据库也提供了图形化的DM管理工具（DM Management Studio）。\n\n…",
          "link": "https://chegva.com/6538.html",
          "publishedOn": "2025-10-19T21:21:39.000Z",
          "wordCount": 17661,
          "title": "DM达梦数据库登陆方式及日常运维命令",
          "imageUrl": null
        },
        {
          "id": "https://chegva.com/?p=6518",
          "author": "anzhihe",
          "description": "之前使用的归档页面是秋叶博客分享的 → Wordpress带缓存和特效的归档页面制作，使用的是php的缓存机制，每次发布/删除文章后，归档页面缓存不会自动清除和重建，想整一个包含缓存机制和手动刷新功能的归档页面，针对原来的归档页面优化了一下。\n\n实现方案：将核心功能放在functions.php中，页面模板只负责显示。这种架构使缓存管理和内容生成逻辑集中化，而页面模板只负责显示内容，系统会在文章更新时自动刷新缓存，同时为管理员提供手动刷新选项，确保归档页面始终保持最新状态。更符合WordPress最佳实践，具有更好的性能和可维护性。\n查看效果：https://chegva.com/archive/\n功能设计\n\nfunctions.php部分：\n\n\n缓存管理机制\n\n文章更新时自动清除缓存\n\n归档内容生成函数\n\n手动清除缓存的工具\n\n\n页面模板部分：\n\n\n只负责显示归档内容\n\n包含响应式布局和交互功能\n\n\n缓存清除场景说明\n\n\n场景旧状态新状态说明\n\n  新文章发布非发布状态 (draft, pending 等)publish归档需要添加新文章\n定时发布futurepublish 归档需要添加新文章\n  取消发布publish非发布状态 (draft, private 等)归档需要移除该文章\n  移至回收站任何状态trash归档需要移除该文章\n  已发布文章更新publishpublish❌ 不触发缓存清除\n  草稿更新draftdraft❌ 不触发缓存清除\n\n\n工作流程图\n\n\n定时发布文章的工作流程\n\n实现代码\n第一步：在functions.php中添加以下代码\n/**\r\n * 添加归档页面\r\n **/\r\n\r\n// 注册归档缓存选项\r\nadd_action('init', function() {\r\n    add_option('qiuye_archives', '', '…",
          "link": "https://chegva.com/6518.html",
          "publishedOn": "2025-10-13T15:17:21.000Z",
          "wordCount": 12830,
          "title": "WordPress自动更新缓存功能的归档页面制作",
          "imageUrl": null
        },
        {
          "id": "https://chegva.com/?p=6528",
          "author": "anzhihe",
          "description": "距离上一次更新快三个月了，这次情况有点不妙~。嘎了一只小龟苗，当时买的一对巴西龟苗子，现在只剩一只了，最近剩下那只小龟苗也不太活跃，不吃食，泡了两天妈咪爱，状态好了不少，这只苗子背甲还经常感染真菌，治了两次了，这对苗子感觉就是体质有点弱，长得也慢。巴西蛊王和两只小草龟都大了一圈，特别是蛊王啥都吃，现在个头最大。中间有一次自制的过滤器把龟缸的水都抽到地板上了，发现的时候缸里的水已经到过滤板下边了，剩下的一条斗鱼躺在过滤板上居然没死，成为了后边的缸霸，跑到过滤板下边的黄丫头、泥鳅、虾和虾虎鱼幸免于难，养了几个月剩下的八九条青鳉鱼就没这么幸运，全部消失了，具体也不知道是谁吃的...自从这次悲剧发生后，小鱼的生存环境很艰难了，中途又放了十几条青鳉进去，不到一个月全部被吃完，后边又买了二十条白云金丝放里头，目前也只剩下四条了。不过凶手可能不只是乌龟，根据我后边的观察，大点的虾也抓小鱼吃，泥鳅更是把缸底一只斗鱼的尸体吃完了。\n龟缸里两条泥鳅都是从湖里捞的，养了也有两个多月了，还捞了个河蚌养到鱼缸里了，后边又买了十条鳑鲏放进去一起养，看看会不会生小鱼崽。黄丫头比之前体型大了一倍都不止，估计也吃了不少小鱼小虾，至于那条仅存的斗鱼也长了两公分，不过领地意识太强了，后面又买了6条斗鱼，放到龟缸里全被它追着咬，基本上尾巴都被咬伤了，躲到过滤板下边都不敢上来，有两条直接卡在下边死掉了，后来实在看不下去，把剩下的4条斗鱼放鱼缸里去了，嘎了两条，剩下的两条活得挺好，断尾后边都长出来了。那条斗鱼后边就叫它缸霸，乌龟好像也不怎么咬那条斗鱼估计是追不上放弃了。龟缸里没啥鱼看着不热闹，小鱼不敢放了，于是买了十条小锦鲤，龟缸鱼缸各放五条，这玩意游速快，乌龟也不好抓。结果现在就是斗鱼和锦鲤在缸里干架，相互追着打。\n\n\r\n\r\n\r\n\r\n\r\n[video dplayer=\"true\" autoplay=\"false\" src=\"https://cdn.chegva.com/ueditor/php/upload/video/20251010/1760099354134752.mp4\" loop=\"false\" preload=\"true\" theme=\"#b7daff\" mutex=\"true\" iconsColor=\"#ffffff\"]\r\n\r\n\r\n[video dplayer=\"true\" autoplay=\"false\" src=\"https://cdn.chegva.com/ueditor/php/upload/video/20251010/1760099358690347.mp4\" loop=\"false\" preload=\"true\" theme=\"#b7daff\" mutex=\"true\" iconsColor=\"#ffffff\"]\r\n\r\n\r\n[video dplayer=\"true\" autoplay=\"false\" src=\"https://cdn.chegva.com/ueditor/php/upload/video/20251010/1760099353894203.mp4\" loop=\"false\" preload=\"true\" theme=\"#b7daff\" mutex=\"true\" iconsColor=\"#ffffff\"]\r\n\r\n\r\n[video dplayer=\"true\" autoplay=\"false\" src=\"https://cdn.chegva.com/ueditor/php/upload/video/20251010/1760099355768796.mp4\" loop=\"false\" preload=\"true\" theme=\"#b7daff\" mutex=\"true\" iconsColor=\"#ffffff\"]\r\n\r\n\r\n[video dplayer=\"true\" autoplay=\"false\" src=\"https://cdn.chegva.com/ueditor/php/upload/video/20251010/1760099358509762.mp4\" loop=\"false\" preload=\"true\" theme=\"#b7daff\" mutex=\"true\" iconsColor=\"#ffffff\"]",
          "link": "https://chegva.com/6528.html",
          "publishedOn": "2025-10-10T14:29:05.000Z",
          "wordCount": 8662,
          "title": "绝地大逃杀3.0之血色黄昏",
          "imageUrl": null
        },
        {
          "id": "https://chegva.com/?p=6527",
          "author": "anzhihe",
          "description": "《论持久战》\n（一九三八年五月）\n这是毛泽东一九三八年五月二十六日至六月三日在延安抗日战争研究会的讲演。\n◎目录\n\n问题的提起\n\n问题的根据\n\n驳亡国论\n\n妥协还是抗战？腐败还是进步？\n\n亡国论是不对的，速胜论也是不对的\n\n为什么是持久战？\n\n持久战的三个阶段\n\n犬牙交错的战争\n\n为永久和平而战\n\n能动性在战争中\n\n战争和政治\n\n抗日的政治动员\n\n战争的目的\n\n防御中的进攻，持久中的速决，内线中的外线\n\n主动性，灵活性，计划性\n\n运动战，游击战，阵地战\n\n消耗战，歼灭战\n\n乘敌之隙的可能性\n\n抗日战争中的决战问题\n\n兵民是胜利之本\n\n结论\n\n问题的提起\n　　（一）伟大抗日战争的一周年纪念，七月七日，快要到了。全民族的力量团结起来，坚持抗战，坚持统一战线，同敌人作英勇的战争，快一年了。这个战争，在东方历史上是空前的，在世界历史上也将是伟大的，全世界人民都关心这个战争。身受战争灾难、为着自己民族的生存而奋斗的每一个中国人，无日不在渴望战争的胜利。然而战争的过程究竟会要怎么样？能胜利还是不能胜利？能速胜还是不能速胜？很多人都说持久战，但是为什么是持久战？怎样进行持久战？很多人都说最后胜利，但是为什么会有最后胜利？怎样争取最后胜利？这些问题，不是每个人都解决了的，甚至是大多数人至今没有解决的。于是失败主义的亡国论者跑出来向人们说：中国会亡，最后胜利不是中国的。某些性急的朋友们也跑出来向人们说：中国很快就能战胜，无需乎费大气力。这些议论究竟对不对呢？我们一向都说：这些议论是不对的。可是我们说的，还没有为大多数人所了解。一半因为我们的宣传解释工作还不够，一半也因为客观事变的发展还没有完全暴露其固有的性质，还没有将其面貌鲜明地摆在人们之前，使人们无从看出其整个的趋势和前途，因而无从决定自己的整套的方针和做法。现在好了，抗战十个月的经验，尽够击破毫无根据的亡国论，也尽够说服急性朋友们的速胜…",
          "link": "https://chegva.com/6527.html",
          "publishedOn": "2025-09-29T21:28:18.000Z",
          "wordCount": 21398,
          "title": "《论持久战》(全文）",
          "imageUrl": null
        },
        {
          "id": "https://chegva.com/?p=6523",
          "author": "anzhihe",
          "description": "一、ContainerLab 是什么？\nContainerLab 是一个强大且高效的网络实验室工具，用于部署和管理由容器互联构成的虚拟网络环境。它允许网络工程师、开发者和学习者使用基于容器的节点（如路由器、交换机、防火墙）来快速创建、销毁和测试复杂的网络拓扑。\n\n官方网站：https://containerlab.dev/\n\n你可以把它想象成是网络领域的 Docker Compose，但专门为网络设备拓扑而设计。\n核心特点：\n\n速度快：基于容器技术，能在几秒内启动或销毁一个完整的网络拓扑，远比传统虚拟机（如 GNS3/EVE-NG）快。\n\n轻量级：容器共享主机内核，资源占用（CPU、内存、磁盘）极低，一台普通笔记本电脑也能轻松运行大型拓扑。\n\n依赖简单：只需要安装 Docker 和 ContainerLab 本身，无需下载和管理庞大的虚拟机镜像（虽然某些节点类型仍需特定镜像）。\n\n支持多种节点类型：\n\n\n容器化网络操作系统 (NOS)：如 Arista cEOS, Nokia SR Linux, SONiC, FrRouting等。\n\n通用 Linux 容器：如 Alpine, Ubuntu，用作客户端、服务器或终端。\n\n第三方工具容器：如 Wireshark, iPerf3, 监控代理等。\n\n\n拓扑即代码：使用简洁的 YAML 文件定义拓扑，易于版本控制、共享和复用。\n\n二、核心概念\n\n拓扑文件：一个 YAML 格式的文件（通常以 .clab.yml 或 .clab.yaml 结尾），用于定义网络拓扑中的所有元素。\n\n节点 (Node)：拓扑中的设备，比如一台路由器、一台交换机或一台 Linux 主机。\n\n种类 (Kind)：定义节点的类型，例如 linux（通用Linux容器）、ceos（Arista cEOS）、srl（Nokia SR Linux）等。\n\n链接 (L…",
          "link": "https://chegva.com/6523.html",
          "publishedOn": "2025-09-22T21:10:20.000Z",
          "wordCount": 13486,
          "title": "ContainerLab使用指南",
          "imageUrl": null
        },
        {
          "id": "https://chegva.com/?p=6512",
          "author": "anzhihe",
          "description": "以大模型为代表的AI技术正在重塑自动化运维（AIOps）的范式，通过预测、自动化、优化、安全四大核心能力，解决传统运维中响应滞后、效率低下、成本高昂等痛点。以下是具体分析：\n\n一、AI为自动化运维带来的核心价值\n\n故障预测与自愈\n\n\n预测性分析\n基于历史日志、指标数据训练模型，提前识别硬件故障（如磁盘损坏）、网络拥堵、服务崩溃等风险。例如，通过LSTM模型分析服务器CPU使用率趋势，预测72小时内可能发生的性能瓶颈。\n\n自动化修复\n结合Ansible/SaltStack等工具，AI可自动执行修复脚本（如重启服务、扩容资源），减少人工干预。例如，当检测到数据库连接池耗尽时，AI触发自动重启数据库进程并调整连接池参数。\n\n\n智能告警与根因分析\n\n\n告警降噪\n通过NLP技术对告警信息进行语义分析，合并重复告警并标注优先级。例如，将“磁盘空间不足”的100条告警聚类为1条核心告警，并关联历史处理方案。\n\n根因定位\n利用图神经网络（GNN）构建服务依赖拓扑，快速定位故障根源。例如，当Web服务不可用时，AI通过拓扑分析发现是数据库连接超时导致，而非网络问题。\n\n\n资源优化与成本节约\n\n\n动态资源调度\n基于强化学习（RL）模型，根据业务负载自动调整资源分配。例如，在电商大促期间，AI预测流量峰值并提前扩容云服务器，活动结束后自动释放资源，降低30%以上成本。\n\n能耗优化\n通过AI算法分析数据中心PUE（电源使用效率），动态调整制冷系统参数，减少能源浪费。\n\n\n安全运维增强\n\n\n异常检测\n利用无监督学习（如Isolation Forest）识别异常登录行为、API调用模式，实时阻断DDoS攻击或数据泄露风险。\n\n漏洞预测\n基于代码静态分析（SAST）和动态分析（DAST）结果，AI预测潜在安全漏洞，并生成修复建议。\n\n\n二、AI功能开发的关键路径\n1. 技术选型与架构设计\n\n后端AI服务…",
          "link": "https://chegva.com/6512.html",
          "publishedOn": "2025-09-15T06:17:53.000Z",
          "wordCount": 17148,
          "title": "AI技术赋能自动化运维的核心价值与功能开发路径",
          "imageUrl": null
        },
        {
          "id": "https://chegva.com/?p=6385",
          "author": "anzhihe",
          "description": "天涯莲蓬鬼话小说精选，《鬼吹灯》《盗墓笔记》这些就不用说了，友情提醒：胆小者、唯物主义者慎看哦\n《我當道士那些年》\n作者：仐三\n\n\n符籙、虎爪、靈玉、鎖魂結、引魂燈、聚陰地、修仙、崑崙……道家源流傳承千年，未必一切只是傳說！\n\n因為踩著正午十二點出生擁有天生的童子命，讓嬰兒時期的我被百鬼纏身，父母尋訪了村子裡的高人，我的師父── 一個高深莫測的真正道士，註定了我這輩子要做道士。跟著師傅修練闖蕩，遇見冤魂、厲鬼、蛇靈、餓鬼墓……此乃區區小事，苗疆蠱術、神秘的川地南部養屍地、人人聞之色變的滅村傳說……原來平常保衛國家的，除了軍人之外，還有道術的山、醫、命、卜這些派系傳人，玄學世界的神秘面紗即將被揭開……\n\n《我在泰国卖佛牌的那几年》\n作者：鬼店主\n\n鬼这东西，很多人信，也有很多人不信，世界上有太多事情根本无法用科学方式来解释和回答。我本是个无神论者，可一次无意间到泰国的旅游经历，却完全改变了我的命运。我不但信了鬼，而且还在泰国开店卖鬼。你没看错，别人都是捉鬼，而我是卖鬼。\n\n《苗疆蛊事》\n作者：南无袈裟理科佛\n\n\n巫蛊之祸，自西汉起延续几千年，屡禁不止，直至如今，在大中国，唯有乡野之民谈及。而巫蛊降头茅山之术，偏偏在东南亚各地盛行，连香港、台湾之地，也繁荣昌盛，流派纷起。诸位好友，真的认为华夏大地无奇人焉？否！否！否！我会告诉你我就是一个来自苗疆的养蛊人么？\n\n《苗疆蛊事Ⅱ》又名《苗疆蛊事之世界尽头》\n\n苗疆青年陆言，回乡途中，误被人害，下了恐怖之蛊毒，在生死求存之中，却发现自家亲戚之中，居然有一位更加恐怖的苗疆养蛊人，而倒霉的是，求医问药的他陷入了一场关于某位大人失踪的悬疑奇案之中，挣脱不得……\n天山之后，并非末法，旧人落，新人出，黑恶势力卷土重来，曾经的朋友却化身做了敌人，危机重重，幕后黑手呼之欲出，又有域外势力逐鹿中原，上演八国联军之态势，华夏黯淡，谁能扛起新时代的旗帜，…",
          "link": "https://chegva.com/6385.html",
          "publishedOn": "2025-09-05T12:26:50.000Z",
          "wordCount": 8804,
          "title": "天涯莲蓬鬼话小说精选",
          "imageUrl": null
        },
        {
          "id": "https://chegva.com/?p=6506",
          "author": "anzhihe",
          "description": "问题\n无法从以下任一项中本地卸载 MA：\n\nWindows 程序和功能控制面板\n\n命令提示符\n\n当您尝试卸载 MA 时，会显示以下错误：\n\nMcAfee Agent cannot be removed because other products are still using it\n注意: 如果客户端计算机上未安装其他 McAfee 企业版产品，则可能会发生此问题。\n原因\n当 MA 处于 托管模式时，会发生此错误。\n这种行为是设计使然，以防止用户删除代理。\nMA 以两种模式运行：\n\n托管模式 - MA 与 ePolicy Orchestrator （ePO）进行连接并与之通信，以管理 McAfee Enterprise 产品更新。\n\n非托管模式 - MA 不会与 ePO 连接或通信，而是从 McAfee Enterprise HTTP 服务器提取更新。\n\n解决\n1、停止McAfee服务：\n按 Windows 键 + R，键入 services.msc ，然后停止 MA 相关服务。\n\n2、卸载McAfee服务：\n将计算机退出托管模式，删除任何依存该代理的托管产品，然后再尝试卸载该代理：\n\n以管理员身份打开命令提示符：\n\n\n按 Windows 键 + R，键入 cmd ，然后按 Enter 键。\n\n如果出现用户帐户控制对话框，请确认其显示的操作是您想要的，然后单击继续。\n\n\n\n在客户端计算机上，访问该 frminst 文件。在命令窗口中，键入以下内容：\n64位操作系统：CD C:\\Program Files\\Mcafee\\Agent\\x86\\，32位操作系统：CD C:\\Program Files\\Mcafee\\Agent\\\n\n键入以下命令。，然后按 Enter 键：frminst.exe /remove=agent\n\nClose the command prompt.\n\n从客户端计算机中删除所有 McAfee Enterprise 托管产品。 示例：\n\n\nEndpoint Security\n\nVirusScan Enterprise\n\nEndpoint Encryption\n\n\n\n可选：从客户端计算机中删除 McAfee Framework Service 通过 程序和功能。\n\n\n\n参考：\n\nhttps://thrive.trellix.com/s/article/KB60556?language=zh_CN\n\n\n处于托管模式时无法删除mcafee解决办法",
          "link": "https://chegva.com/6506.html",
          "publishedOn": "2025-08-25T12:48:36.000Z",
          "wordCount": 9003,
          "title": "Win10卸载McAfee Agent托管模式本地卸载被阻止问题",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "朱磊的博客",
      "feedUrl": "https://zhuleichina.github.io/feed.xml",
      "siteUrl": "https://zhuleichina.github.io/",
      "articles": []
    },
    {
      "title": "Chris Chan's BLOG",
      "feedUrl": "https://rorschachchan.github.io/atom.xml",
      "siteUrl": "/atom.xml",
      "articles": []
    },
    {
      "title": "杰哥的{运维，编程，调板子}小笔记",
      "feedUrl": "https://jia.je/feed.xml",
      "siteUrl": "https://jia.je/",
      "articles": [
        {
          "id": "https://jia.je/software/2025/10/09/blog-analytics-three-months/",
          "author": null,
          "description": "本博客近三个月来的访问数据观察¶\n写在前面¶\n这个博客自 2014 年更新至今，已走过近十一个年头，累计发布了四百多篇文章。出于好奇，我一直想了解哪些内容更受读者欢迎。五年前，我曾配置过 Google Analytics，但使用体验并不理想，于是转而自行部署了 rybbit 实例来收集访问数据。如今三个月过去，是时候与大家分享一些有趣的发现。\nP.S. 如果你对数据收集有所顾虑，可以屏蔽对应的 analytics 脚本。\n\n数据总览与趋势¶\n首先来看这三个月内的整体访问情况与趋势：\n\n访问量比我的预期要高一些。虽然这些年写了不少内容，但并没有刻意宣传，主要依赖搜索引擎推荐和读者的订阅与转发。从时间趋势上可以看出两个明显特点：\n\n工作日访问量显著高于周末，通常为周末的两到三倍；\n开学后工作日的访问量比暑假期间又高出一倍，但周末依然低迷。\n\n由此推测，学生读者占比较高。结合国庆假期访问量的下降来看，国内读者仍是主力。下面是各国家与地区的访问分布：\n\n值得一提的是，也有不少海外读者访问，看来近年来有意识地撰写英文内容确实产生了效果。\n以 UTC+8 时区为基准，从访问时间分布中可以看出大家的作息习惯：\n\n尽管大家可能习惯熬夜，但深夜阅读博客的并不多，多数访问集中在工作时间。\n接下来是基于 User Agent 的统计。首先是浏览器分布：\n\n不出所料，Chrome 及基于 Chromium 内核的浏览器占据主流，Firefox 和 Safari 占比不高。我本人目前也在使用 Firefox，希望它能持续发展，避免 Chrome 一家独大。\n操作系统分布如下：\n\nWindows 占比最高，macOS 次之。考虑到博客内容主要涉及计算机技术，这也大致反映了相关从业人员的偏好。\n以下是访问次数较多的几篇文章：\n\nACPI 学习笔记: 886 次\nNVIDIA 驱动和 CUDA 版本信息速查: 835 次\n在 QEMU 中运行 OpenBMC: 725 次\nSPEC CPU 2006 性能测试: 520 次\nMIFARE Classic 上配置 NDEF: 464 次\n\n这个排名有些出乎我的意料。这几篇文章在撰写时并未特别考虑入门读者的理解难度或内容的丰富性。或许是因为它们涉及的领域资料较少，因此在相关关键词搜索中容易被找到。这一点在 Google Search Console 中也得到了印证：\n\n相比之下，一些精心准备的文章阅读量并不高，可能是因为所在领域已有较多优质内容，新文章难以脱颖而出。这也说明文章质量与阅读量之间并非简单的正比关系。\n我还注意到一些重度用户，他们不仅阅读多篇文章，且停留时间较长：\n\n未知用户一：阅读了分支预测、乱序执行、CPU 微架构分析等文章，推测可能是刚开始研究 CPU 微架构的同行；\n未知用户二：浏览了 wishbone、乱序执行相关内容，猜测是学习清华计算机组成原理课程的学生；\n未知用户三：从华为相关文章进入，随后浏览了其他内容，可能是搜索华为内容进入博客后，被其他文章吸引的读者；\n未知用户四：阅读了 ARM/Samsung/Intel 等处理器微架构分析文章，又一位同行，但有一定基础，更加关注业界。\n\n类似的例子还有不少，在此不一一列举。尽管 CPU 相关文章的阅读量不及软件类内容，但能得到这么多同行的关注，确实令人欣慰——毕竟这本身就是一个小众领域，不能奢求过高的阅读量。\n通过这次数据分析，我收获了不少有趣的观察。未来可能会不定期更新类似内容，看看随着时间推移，是否会有新的发现。\n最后，如果你对访问数据的收集感到不适，可以直接屏蔽 analytics 脚本（或许你的浏览器插件已经这样做了）。根据 rybbit 的官方说明，其信息收集方法较为尊重用户隐私，我也没有对代码进行任何修改，不放心的读者可以阅读 rybbit 的源码来审计。\nP.S. 你能看出这篇文章是，我先写了一遍，然后让大模型润色的结果吗？",
          "link": "https://jia.je/software/2025/10/09/blog-analytics-three-months/",
          "publishedOn": "2025-10-09T00:00:00.000Z",
          "wordCount": 271,
          "title": "本博客近三个月来的访问数据观察",
          "enclosure": {
            "url": "https://jia.je/assets/images/social/blog/posts/software/blog-analytics-three-months.png",
            "type": "image/png",
            "length": "56203"
          },
          "imageUrl": "https://jia.je/assets/images/social/blog/posts/software/blog-analytics-three-months.png"
        },
        {
          "id": "https://jia.je/hardware/2025/09/10/arm-core-development/",
          "author": null,
          "description": "ARM 公版核微架构演进¶\n背景¶\nARM 公版核微架构的演进频繁，型号又比较多，相关信息散落在各种地方，为了方便查阅，在这里做一个收集。\n\n2025 年¶\nC1-Ultra¶\n\nArmの新しいCPU「C1」は2桁パーセントの性能アップ。電力効率も大幅改善\nInside Arm's New C1‑Ultra CPU: Double‑Digit IPC Gains Again!\nC1-Ultra: successor to Cortex X925\nBranch prediction: Additional tracking for local/per-PC history\n33% increase in L1 I-Cache available bandwidth\nOut of order window size growth: Up to 25% growth, Up to ~2K instruction in flight\n2x L1 data cache capacity (128KB)\nData prefetchers: array-indexing coverage\n\nArm® C1-Ultra Core Technical Reference Manual\nImplementation of the Scalable Vector Extension (SVE) with a 128-bit vector length and Scalable Vector Extension 2 (SVE2)\nImplementation of the Scalable Matrix Extension (SME) and Scalable Matrix Extension 2 (SME2), and support for the C1-SME2 unit\nconfigure…",
          "link": "https://jia.je/hardware/2025/09/10/arm-core-development/",
          "publishedOn": "2025-09-10T00:00:00.000Z",
          "wordCount": 2739,
          "title": "ARM 公版核微架构演进",
          "enclosure": {
            "url": "https://jia.je/assets/images/social/blog/posts/hardware/arm-core-development.png",
            "type": "image/png",
            "length": "70789"
          },
          "imageUrl": "https://jia.je/assets/images/social/blog/posts/hardware/arm-core-development.png"
        }
      ]
    },
    {
      "title": "迷鹿屋",
      "feedUrl": "https://lostdeer.xyz/feed",
      "siteUrl": "https://lostdeer.xyz",
      "articles": []
    },
    {
      "title": "酷 壳 – CoolShell",
      "feedUrl": "https://coolshell.cn/feed",
      "siteUrl": "https://coolshell.cn",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}